{"news_desk": "Classified", "print_page": "08", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "396", "lead_paragraph": "LANDESMAN--Jay. Jay Landesman, passed away peacefully at his home in Manhattan on June 27, 2016 at age 77. Jay was a first generation American, born in Brooklyn and raised in Long Beach, New York. He attended the University of Vermont and, after a year there, attended the University of Wisconsin and its Law School, where he achieved top tier ranks while attending only a few lectures, as he was busy driving back and forth selling real estate in Chicago resulting in becoming a millionaire before he graduated. He also received three degrees at the same time, in Law, Psychology and History. His wealth of intellectual talents and ability led him to pursue a career in law, where he was hired on the spot in an interview at the prestigious New York City law firm of Cravath Swaine & Moore. Jay's ambitions led him to later become an entrepreneur with various business successes, including forming and growing his real estate firm with its portfolio of properties across the United States. Jay enjoyed yearly trips to Sun Valley for skiing and the beauty of its slopes. He also enjoyed traveling to Paris and throughout Europe, as well as a safari to Botswana. He had a vast knowledge of numerous topics, one of which was World War II, where he could recite the key invasion dates, battles, defeats and the like, as he was an avid reader. He enjoyed the arts, especially ballet, and regularly attended the theater and opera. Jay thoroughly enjoyed many aspects of his life, and people he encountered from all walks of life all found him to be exceptionally charming, witty and a great raconteur. Wherever he went, he owned the room with his charm, elegance, brilliance, and modesty. He enjoyed spending his weekends at his beautiful property in Southampton. He will be greatly missed by his family, friends and business colleagues. Jay is survived by his devoted wife of 34 years, Maria Kimberly Landesman, whom he cherished, and by his sister, Rochelle Landesman Millen, his brother, Sheldon Landesman and many of his siblings' children and grandchildren. A funeral service will be held at Frank Campbell's Funeral Chapel at 1076 Madison Avenue, New York, New York on July 6, 2016 at 11:30am. In lieu of flowers, donations can be made to Wounded Warriors Project, P.O. Box 758517, Topeka, Kansas 66675 and to our veterans. 1/3", "pub_date": "2016-07-02T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  LANDESMAN, JAY"}, "snippet": "LANDESMAN--Jay. Jay Landesman, passed away peacefully at his home in Manhattan on June 27, 2016 at age 77. Jay was a first generation American, born in Brooklyn and raised in Long Beach, New York. He attended the University of Vermont and, after a...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9805E6DD113AF931A35754C0A9609D8B63", "keywords": [{"value": "LANDESMAN, JAY", "name": "persons"}], "blog": [], "_id": "5781bab038f0d876825ded95", "source": "The New York Times"}