{"news_desk": "Classified", "print_page": "12", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "283", "lead_paragraph": "LEOPOLD SARGENT-- Elaine (nee Albert), 1933-2016 Passed away peacefully, on Tuesday, July 12, 2016, in New York. Loving mother of Stephen Leopold and John Leopold, and mother-in-law Joanne Kussner Leopold. Adored grandmother of Arthur, Alex, Justin and Carolyn Leopold. Beloved daughter of the late Bernard Albert and the late Evelyn Vineberg Albert. Sister of the late Lois Albert Leterman. Elaine was laid to rest with her family at her side at the Shaar Hashomayim Cemetery in Montreal on Monday, July 18. A trailblazer in Montreal and New York City, Elaine broke the glass ceiling as not only one of the first female stockbrokers in both Montreal and on Wall Street, but also one of the leading stockbrokers in an era when women were almost nonexistent in the world of finance. Her keen mind and passion for the arts led her from Chairmanship of the Angel's Ball Committee in Montreal to being a great patron of the New York City arts including The New York City Opera, Lincoln Center Theater, New York Theater Workshop, Roundabout Theater, and to Chairing the Our Time Theater Company. Elaine established the Avon Chair dedicated to ovarian cancer research at Memorial Sloan Kettering Hospital. In 1997, she founded a scholarship in the name of her late uncle, Dr. Arthur Vineberg, at McGill University, world renowned pioneer of modern day heart surgery. The family is immensely grateful to all those who were helpful along the way, including the late Dr. Leon Root, Dr. David W. Kennedy, Dr. Hooman Yaghoobzadeh and Dr. Frank A. Petito. In lieu of flowers, donations to the \"Elaine Leopold Sargent Scholarship Fund for Faculty of Medicine\" at McGill University, (514) 398-2787, would be greatly appreciated. 1/3", "pub_date": "2016-07-19T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  LEOPOLD SARGENT, ELAINE (NEE ALBERT)"}, "snippet": "LEOPOLD SARGENT-- Elaine (nee Albert), 1933-2016 Passed away peacefully, on Tuesday, July 12, 2016, in New York. Loving mother of Stephen Leopold and John Leopold, and mother-in-law Joanne Kussner Leopold. Adored grandmother of Arthur, Alex, Justi...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A05E1D6113AF93AA25754C0A9609D8B63", "keywords": [{"value": "LEOPOLD SARGENT, ELAINE", "name": "persons"}], "blog": [], "_id": "5798240f38f0d860009228f6", "source": "The New York Times"}