{"news_desk": "Classified", "print_page": "12", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "277", "lead_paragraph": "PEARCE--Stewart, age 65, passed away from lymphoma on July 17 with Kevin Kellogg, his adored husband, at his side. Stewart was born in Brooklyn and raised in New Jersey, the son of Daniel and Dorothy Linn Pearce. After graduating Phi Beta Kappa from Brandeis, Stewart received his Masters in Arts Administration from NYU. Stewart Pearce's nearly 40 year career at the Metropolitan Opera and Metropolitan Opera Guild encompassed major leadership roles in every aspect of opera management. Beginning as an intern and ending his career as Managing Director of the Guild, over the years Stewart was promoted again and again within the Metropolitan Opera by five different General Managers. Working with Joseph Volpe for many years, Stewart was named Director of Planning, Budgets and Marketing. Peter Gelb further appointed Stewart Assistant General Manager, Operations, the post he held until his retirement from the Met. With his brilliant intelligence and innate calm and grace, Stewart was an inspirational mentor and a treasure to countless colleagues. Upon his retirement the Metropolitan Opera's Board of Directors formally paid tribute to \"Mr. Pearce for his extraordinary expertise, leadership and commitment throughout the entirety of his distinguished career at the Met\". Stewart's wide-ranging interests outside opera ranged from politics to pasta, pets to philanthropy. He had a passion for travel, film and theater. Stewart had a wondrous capacity for love and will be mourned by his many dear friends. Stewart Pearce is survived by his ever-devoted husband Kevin, his nephew Chris, and niece Noelle. A memorial service will be held at a later date. In lieu of flowers, donations may be made to Doctors Without Borders in memory of Stewart Pearce. 1/3", "pub_date": "2016-07-19T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  PEARCE, STEWART"}, "snippet": "PEARCE--Stewart, age 65, passed away from lymphoma on July 17 with Kevin Kellogg, his adored husband, at his side. Stewart was born in Brooklyn and raised in New Jersey, the son of Daniel and Dorothy Linn Pearce. After graduating Phi Beta Kappa fr...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9407E1D6113AF93AA25754C0A9609D8B63", "keywords": [{"value": "PEARCE, STEWART", "name": "persons"}], "blog": [], "_id": "5798240538f0d860009228f5", "source": "The New York Times"}