{"news_desk": "Classified", "print_page": "22", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "427", "lead_paragraph": "RAMBO--Dr. John H. T. Dr. John H.T. Rambo was born April 21, 1915 in Menlo, GA to Gordon and Martha Mae Kennedy. His sister Martha was born March 16, 1920. When his father died in a car crash at age nine, he was shuffled between relatives until he wound up in New Castle, PA. There he quarterbacked the high school football team, winning a championship, before he decided to become a doctor with a loan from an uncle. He went to Emory University for his undergraduate and medical degree and began his rotation as an intern at Grady Memorial Hospital in Atlanta from 1940-41. He then joined the Army Air Corps in 1941 serving in Panama. Discharged in 1945, having achieved a rank of Lieutenant Colonel, he went to Boston to do his residency at Massachusetts Eye and Ear Infirmary from 1946-48. Also he worked at the ENT laboratory at Harvard Medical School which he described as the happiest year he ever had in medicine. There he met and married Kathleen Foreman from Regina, Saskatchewan. They had two children, Michael and Tracy. After his residency in Boston he joined Dr. Julius Lempert at the Lempert Institute of Otology in New York City. Dr. Lempart was considered the father of otology, and Dr. Rambo became his associate and stayed at the Institute for many years, learning all he could along with the best otologists in medicine. It was at the Institute that he developed his own techniques in the field of middle-ear and mastoid surgery. His modesty, scrupulous attention to detail and fierce focus made him a much sought after surgeon. He loved his profession and was proud of it. He appeared on the cover of Modern Medicine in 1958. In 1957, he joined the staff of Lennox Hill Hospital in New York City where he said the generous support of his fellow doctors made it a joy for him. In 1958 he was invited to Alaska to lend his surgical skills to the native peoples of Pt. Barrow near the Arctic Circle. Flying by bush pilot he said it was an adventure and they were lucky to escape with their lives. He pursued golf and won a doctor's championship in 1973. He retired in 1983. He was fascinated by the family's civil war history and by the Rambo family origins, discovering that one young man who arrived from Sweden in 1640 helped start, and become the father of the New Sweden colony. Dr. Rambo died in New York City at his home on his 101st birthday. 1/3", "pub_date": "2016-07-03T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  RAMBO, DR"}, "snippet": "RAMBO--Dr. John H. T. Dr. John H.T. Rambo was born April 21, 1915 in Menlo, GA to Gordon and Martha Mae Kennedy. His sister Martha was born March 16, 1920. When his father died in a car crash at age nine, he was shuffled between relatives until he...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9906EEDD113AF930A35754C0A9609D8B63", "keywords": [{"value": "RAMBO, DR", "name": "persons"}], "blog": [], "_id": "57830d4e38f0d874e6b5a3be", "source": "The New York Times"}