{"news_desk": "Classified", "print_page": "22", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "498", "lead_paragraph": "KOBLINER--Shirley (nee Cohen), passed away on July 1, surrounded by her loving family: her husband of 65 years, Harold Kobliner, who was her best friend, confidant and soul mate; her son, Perry Kobliner; her son and daughter-in-law, Kenneth and Miriam Kobliner; and her daughter and son-in-law, Beth Kobliner Shaw and David Shaw. Shirley was a spectacular wife, mother and grandmother, who cherished, more than would seem humanly possible, her husband, children, children-in-law and six grandchildren, Rebecca, Adam, Benjamin, Joshua, Sarah and Jacob. Shirley and Harold's marriage was a miraculous one in their unwavering support and admiration for each other. Theirs was a true love. He was her number one, and she was his. Anyone who ever crossed paths with them knows how extraordinary their beautiful union was. Shirley adored being a wife, mother and grandmother, and relished that experience with genuine joy, humor and zest. She was good, honest and kind, and encouraged her children always. Born in 1929 in Astoria, Queens, Shirley treasured childhood days spent with her mother Belle, father Ben, sister Betty, and brother Murray, who died at age 10. It was a time when resources were scarce, but love was abundant. Shirley would often recall fondly how much she loved helping her father weigh and measure the medications he dispensed at his business, Cohen's Pharmacy, and it was there that her love of chemistry took root. Shirley graduated with a Bachelor of Science in chemistry from Queens College in 1951. When she was 16 years old, at the encouragement of her mother, she attended a dance at the 92nd Street Y, where she met Harold Kobliner, then 17, who was from the Bronx. It turned out to be well worth the three subway trains and a bus that Harold had had to take to get there, since he won Shirley over, and they were married in 1951. Shirley taught chemistry in the New York City public high schools, and she was a wonderful support to Harold as he went on to get his Ph.D. in education. \"I could never have done it without her,\" he would say to everyone they met, adding that she was his inspiration. After raising their three children in Bayside, Queens, Harold and Shirley moved to Great Neck, Long Island. As a member of Temple Israel, Shirley embarked on a series of roles in the Temple Israel Players' productions such as Oklahoma!, Fiddler on the Roof and Guys & Dolls, in which she played a Hot Box girl. Shirley also volunteered countless hours for the Association for Neurologically Impaired Brain Injured Children (ANIBIC) in Queens, where she was honored for her hard work and dedication. Funeral services will take place at 11am on Sunday, July 3, at Riverside-Nassau North Chapel, 55 North Station Plaza, Great Neck, New York. In lieu of flowers, memorial donations may be made to the Michael J. Fox Foundation for Parkinson's Research by mail at P.O. Box 5014, Hagerstown, MD, 21741-5014 or online at www.michaeljfox.org. 1/3", "pub_date": "2016-07-03T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  KOBLINER, SHIRLEY (NEE COHEN)"}, "snippet": "KOBLINER--Shirley (nee Cohen), passed away on July 1, surrounded by her loving family: her husband of 65 years, Harold Kobliner, who was her best friend, confidant and soul mate; her son, Perry Kobliner; her son and daughter-in-law, Kenneth and Mi...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A00EFDD113AF930A35754C0A9609D8B63", "keywords": [{"value": "KOBLINER, SHIRLEY", "name": "persons"}], "blog": [], "_id": "57830d1a38f0d874e6b5a3b0", "source": "The New York Times"}