{"news_desk": "Classified", "print_page": "22", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "292", "lead_paragraph": "McDONOUGH--Richard D. died on June 27 surrounded by his beloved wife and extended family. Born in St. Stephen, Canada in 1931, Dick was graduated from Dartmouth College in 1952 and embarked upon a successful career in accounting and finance, retiring in 1994 as Vice Chairman and Chief Financial Officer of newsprint manufacturer Bowater, Inc. In his earlier positions with General Electric and the Singer Company, Dick and Caroline travelled the world. On their honeymoon in 1956 they drove to Mexico where their three children were born. During the 1960s and 1970s Dick with his family enjoyed many happy years working in Europe, traveling across the Atlantic six times as he took up positions in Scotland, Germany and England. Eventually, the family settled in Greenwich, CT in 1979. Dick made many life-long friends during his years in Hanover, New Hampshire and remained a devoted supporter of Dartmouth College. He served as his class president for eight years and was the recipient of multiple Alumni Awards for his contributions to the college and his Class of 1952, including the 2000 Dartmouth Alumni Award. Larger than life in stature, heart, generosity and humor, Dick was loved by his family, his friends, and the many who had the pleasure of working with him. Dick is survived by his wife Caroline; daughter Lisa O'Neill (Sean); sons David (Katrina) and Philip (Kristina); grandsons Richard, Spencer and Jack; sister Nancy and brother Michael; and many nieces and nephews. A service will be held 11:30am, Tuesday, July 26 at Christ Church Greenwich, Connecticut. A Celebration of Dick's Life will be held at his long-time home at Harbour Ridge, Florida in early autumn. In lieu of flowers, contributions may be made to the Dartmouth College Alumni Fund, Hanover, NH 03755. 1/3", "pub_date": "2016-07-03T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  MCDONOUGH, RICHARD D"}, "snippet": "McDONOUGH--Richard D. died on June 27 surrounded by his beloved wife and extended family. Born in St. Stephen, Canada in 1931, Dick was graduated from Dartmouth College in 1952 and embarked upon a successful career in accounting and finance, retir...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9807EEDD113AF930A35754C0A9609D8B63", "keywords": [{"value": "MCDONOUGH, RICHARD D", "name": "persons"}], "blog": [], "_id": "57830ca038f0d874e6b5a39a", "source": "The New York Times"}