{"news_desk": "Classified", "print_page": "22", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "216", "lead_paragraph": "FULENWIDER--Constance Morrow, died suddenly, of natural causes, at her home in Weston, Massachusetts on Friday, June 24. She was 73. Born in Carmel Valley, California, to Margot Loines Morrow and Dwight Morrow Jr., she grew up in New York City, where she attended the Brearley School before graduating from Concord Academy in Massachusetts in 1960. She proudly graduated Summa Cum Laude from Wellesley College as a Davis Scholar in 2006. A joyful connector of people, Constance was a vibrant member of the community in Weston, where she and her husband moved in 1972 and raised a family. She served on the board of the Boston Philharmonic and the Elisabeth Morrow School in Englewood, New Jersey, housed in her paternal grandparents' former home. A lifelong animal lover, she trained as an International Therapy Dog volunteer, and in 2013, she worked with survivors of the Boston Marathon Bombing. She is survived by her husband, Michael Fulenwider, her daughters, Anne Fulenwider and Wendy Fulenwider Liszt, two sons-in law, Bryan Blatstein and Jeffrey Liszt, four grandchildren, and her sister, Faith Williams, and her beloved black lab, Luna. A celebration of her life will be held at the First Parish Church in Weston on Thursday, July 14th at 2pm. In lieu of flowers, please send donations to Therapy Dogs International. 1/3", "pub_date": "2016-07-03T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  FULENWIDER, CONSTANCE MORROW"}, "snippet": "FULENWIDER--Constance Morrow, died suddenly, of natural causes, at her home in Weston, Massachusetts on Friday, June 24. She was 73. Born in Carmel Valley, California, to Margot Loines Morrow and Dwight Morrow Jr., she grew up in New York City, wh...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E07E0DD113AF930A35754C0A9609D8B63", "keywords": [{"value": "FULENWIDER, CONSTANCE MORROW", "name": "persons"}], "blog": [], "_id": "57830d3238f0d874e6b5a3b4", "source": "The New York Times"}