{"news_desk": "Classified", "print_page": "22", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "949", "lead_paragraph": "BREEN--Daniel Anthony, Jr. Of Houston, TX and East Hampton, NY, passed away peacefully on Monday, the 27th of June 2016, at the age of 87. A nationally recognized pioneer in the field of investment management, Dan was a larger than life personality. He loved sports, he loved music - he never passed up the chance to sing \"Danny Boy\" and \"My Way\" before an audience - and he had an enormous capacity for friendship. Above all, Dan loved his family, his beloved wife Pat, his six sons, and his nine grandchildren. Dan was born in Minneapolis, MN, in 1928, the son of Dan Breen, Sr. and Helen Frances Brady. Dan took great pride in his Irish-Catholic heritage and was a great fan of Notre Dame sports. From his father he learned to respect all people, regardless of their station in life. From his mother, who dabbled in the stock market, he developed an early interest in investments. He attended Rockhurst University in Kansas City, MO, where he was two-time captain of the basketball team. After earning a degree in business administration Dan entered the Army, mustering out in 1953. He then joined IBM as a marketing representative, the first step in a long and successful career in business. While working for IBM in New York City, Dan noticed a strikingly beautiful young woman, Pat McCloskey. On the 11th of February 1961, they were married in St. Patrick's Cathedral in New York. This past February they celebrated their 55th wedding anniversary. At IBM Dan rose through the ranks, eventually serving as director of sales promotion and co-director of industry marketing at the firm's world headquarters in New York. But the then-nascent field of investment management outside bank trust departments fascinated Dan, and in 1968 he joined National Securities and Research, a Wall Street mutual fund company, as senior vice president. Two years later, in a pivotal development in Dan's professional life, Fayez Sarofim, a rising young money manager in Houston, persuaded Dan to join him as a partner in Fayez Sarofim & Co. The two formed a close, complementary professional relationship, with Sarofim's stock-picking acumen complemented by Dan's management and marketing skills. When Dan joined the firm it had $600 million in assets under management. Over their 13 year association, during which Dan served as President of the company in addition to being Chairman of its Portfolio Management Group and a member of the Board of Directors, that figure grew to $14.5 billion. Dan took great pride in his association with Fayez Sarofim & Co. and in its accomplishments, but he always nursed the ambition of owning his own firm, and in 1983, at the age of 54, he struck out on his own, founding Daniel Breen & Co. By 1997 Daniel Breen & Co. and Breen Trust Co. had close to $3.5 billion assets under management. Major clients included Rice University, Rockhurst University, Davidson College, Wesleyan University, Rockefeller Dodge Foundation, Lincoln Center, New York Telephone, and Coca-Cola of New York. In that year Dan sold the two firms to Banque Indosuez. Some years later he started Breen Investors LP, transitioning ownership to two sons. At the time of his death he was Chairman Emeritus and adviser. During his career, Dan managed assets for more than 25 of the top 100 companies in the world. In the last years of his life he took particular pride in organizing the Our Future Speaker Series, in which he and his professional and personal friends - all high-achievers in their fields - traveled to Houston-area schools to offer career-development advice to kids graduating from high school and college. Left to mourn Dan's passing are his wife Pat; his sons Daniel Breen III and wife Dionne and their children Diandra and Daniel IV; John Breen and wife Zoe and their sons Jack and Dashiell; Thomas Breen and wife Chesie and their daughters Virginia, Eliza and Margaret; Brian Breen; Patrick Breen and wife Erin and son Declan; and Michael Breen and wife Erin and son Andrew. Survivors also include his brother Michael Breen and sister Nancy Creel and husband Walter; sister-in-law Jackie Donovan; and many nieces and nephews. Dan's professional affiliations over the years included: Member, Knights of Malta; Georgetown University Board of Regents; Rockhurst College Board of Trustees; Chairman of the Board, Strake Jesuit College Preparatory; President of the Board, St. Joseph's Hospital; Board of Houston Museum of Natural Science; and Pacific Rim Board, Banque Indosuez. He was a member of the Houston Country Club; Maidstone Club, East Hampton, New York; National Golf Links of America, Southampton, New York; Lyford Cay Club, Nassau, Bahamas. Family and friends gathered in Houston this past Thursday, the 30th of June, to celebrate Dan's life during a Mass of Christian Burial at St. Anne Catholic Church, followed by the Rite of Committal at Glenwood Cemetery. Honored to serve as casket bearers during the services were Milton Carroll, Donald Chapoton, Gordon Johnson, Johnny Johnson, Anthony Petrello, and Robert Whilden. Serving as honorary pallbearers were Leslie Alexander, A.L. Ballard, Lewis Brazelton, John Chapoton, Ernest Cockrell, James Crownover, the Honorable Charles Duncan, John Duncan, George Farris, Ronald Glauser, Gerald Hines, John Jakobson, Robert Mangan, James McCartney, Robert McNair, Dr. Walter McReynolds, Carl Menges, Dee Osborne, Risher Randall, Thomas Reckling, III and Selby Sullivan. Services in Houston entrusted to Geo. H. Lewis & Sons, the Funeral Directors Since 1936, 713-789-3005. www.geohlewis.com. The full obituary was published in the Houston Chronicle and remains accessible via the internet at the previously mentioned website and at www.chron.com. Dan Breen loved life, loved golf, loved his friends, but most of all, he loved us. He was our Danny Boy. Oh Dan, we loved you so. 1/3", "pub_date": "2016-07-03T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  BREEN, DANIEL ANTHONY"}, "snippet": "BREEN--Daniel Anthony, Jr. Of Houston, TX and East Hampton, NY, passed away peacefully on Monday, the 27th of June 2016, at the age of 87. A nationally recognized pioneer in the field of investment management, Dan was a larger than life personalit...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9D07E1DD113AF930A35754C0A9609D8B63", "keywords": [{"value": "BREEN, DANIEL ANTHONY", "name": "persons"}], "blog": [], "_id": "57830cd038f0d874e6b5a3a2", "source": "The New York Times"}