{"news_desk": "Classified", "print_page": "22", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "481", "lead_paragraph": "LAMM--Maurice, Rabbi The Yeshiva University family and the affiliated Rabbi Isaac Elchanan Theological Seminary (RIETS) are profoundly saddened by the passing of one of our institution's most illustrious alumni, Rabbi Maurice Lamm, Z\"l, who graduated from Yeshiva College (1951), RIETS (1954) and The Bernard Revel Graduate School of Jewish Studies (1973). He received an honorary Doctor of Divinity degree from our institution where he served as the Professor of Professional Rabbinics in the Chair established by members of Beth Jacob Congregation of Beverly Hills, where he served from 1972 to 1985 as spiritual leader before retiring from the congregation. He then established the Palm Springs Desert Synagogue and served as its rabbi for several years. Earlier, after graduating from RIETS, he started as a Chaplain in the United States Armed Forces and following that began his career as a pulpit rabbi in San Juan, Puerto Rico. Earlier, while in New York, he served as Rabbi of the Floral Park Synagogue and the Hebrew institute of University Heights in the Bronx. While there, he helped the other rabbis in the Bronx/Riverdale area and their lay leaders to establish the SAR Academy. His rabbinic career was capped by his founding and serving as the President of the National Institute of Jewish Hospice in 1985, in which his beloved wife, Shirley Lamm, assisted him. He was world renowned as the author of some five significant books; the first and most famous is The Jewish Way in Death and Mourning, of which 275,000 copies were sold, helping many more thousands of families cope with their bereavement. His other books are The Jewish Way in Love and Marriage, Becoming a Jew, The Power of Hope and Consolation. His kindness, warmth, wisdom and genuine concern for strengthening Jewish life was shared with young rabbinic colleagues in the field, whom he visited as a consultant under the Jack E. and Rachel Gindi Rabbinic Mentoring Program at RIETS. He was the proud younger brother of Rabbi Dr. Norman Lamm, President Emeritus of Yeshiva University, who served for 27 years as President, and of their cherished sisters, Tzibby Citner and Miriam Auslander. He was devoted to his beloved wife, Shirley Lamm, his Ayshet Chayil, a veritable \"Woman of Valor,\" who helped him survive serious illness for many years. He was the revered father of his loving children, David Lamm, Judith Young, of blessed memory, and Dodi Lee Lamm, and the doting grandfather of 18 grandchildren and 35 great- grandchildren, all of whom carry on his legacy of love and concern for their Torah heritage, which he inspired. Heartfelt condolences are extended to Shirley Lamm, their wonderful children and all their progeny and their former congregants whose lives were touched by this unique leader of the Jewish people. May they be comforted among all who mourn for Zion and Jerusalem. Yeshiva University Richard M. Joel, President Norman Lamm, President Emeritus 1/3", "pub_date": "2016-07-03T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  LAMM, MAURICE"}, "snippet": "LAMM--Maurice, Rabbi The Yeshiva University family and the affiliated Rabbi Isaac Elchanan Theological Seminary (RIETS) are profoundly saddened by the passing of one of our institution's most illustrious alumni, Rabbi Maurice Lamm, Z\"l, who gradua...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=950DEFDD113AF930A35754C0A9609D8B63", "keywords": [{"value": "LAMM, MAURICE", "name": "persons"}], "blog": [], "_id": "57830ce238f0d874e6b5a3a6", "source": "The New York Times"}