{"news_desk": "Classified", "print_page": "22", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "129", "lead_paragraph": "FRIEDMAN--Shirley Ruth (Kopel) died peacefully on April 12th, 2016 in Canaan, CT at age 94. Adored wife of the late Lawrence Friedman, beloved mother of Joan Krey (Lewis), Laura Goldberg (Mark) and Barbara Friedman-Dow (Robert); proud grandmother of Theodore, Jocelyn, Adrienne, Marissa, Jordan, Samantha and Jeffery; contented great-grandmother of Nina; and her late brother Dr. Hugh Kopel. A graduate of Wayne State University, Shirley received a MA in Education from Columbia University Teachers' College and loved her 25 year career in teaching at which she excelled and impacted countless children's lives in Ossining. She was passionate about tennis, bridge, crossword puzzles, cooking, traveling, theatre and dogs. Always curious, adventurous, outspoken, and ready to tell a good joke. Donations to Living Waters Children Center Fund www.lwccfund.orgaiti/, for Haiti Fund. 1/3", "pub_date": "2016-04-17T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Memorials  FRIEDMAN, SHIRLEY RUTH (KOPEL) DIED PEACEFULLY ON APRIL 12TH, 2016 IN CANAAN, CT AT AGE 94. ADORED WIFE OF THE LATE LAWRENCE FRIEDMAN, BELOVED MOTHER OF JOAN KREY (LEWIS), LAURA GOLDBERG (MARK) AND BARBARA FRIEDMAN, DOW (ROBERT); PROUD GRANDMOTHER OF THEODORE, JOCELYN, ADRIENNE, MARISSA, JORDAN, SAMANTHA AND JEFFERY; CONTENTED GREAT, GRANDMOTHER OF NINA; AND HER LATE BROTHER DR. HUGH KOPEL. A GRADUATE OF WAYNE STATE UNIVERSITY, SHIRLEY RECEIVED A MA IN EDUCATION FROM COLUMBIA UNIVERSITY TEACHERS' COLLEGE AND LOVED HER 25 YEAR CAREER IN TEACHING AT WHICH SHE EXCELLED AND IMPACTED COUNTLESS CHILDREN'S LIVES IN OSSINING. SHE WAS PASSIONATE ABOUT TENNIS, BRIDGE, CROSSWORD PUZZLES, COOKING, TRAVELING, THEATRE AND DOGS. ALWAYS CURIOUS, ADVENTUROUS, OUTSPOKEN, AND READY TO TELL A GOOD JOKE. DONATIONS TO LIVING WATERS CHILDREN CENTER FUND WWW.LWCCFUND.ORG"}, "snippet": "FRIEDMAN--Shirley Ruth (Kopel) died peacefully on April 12th, 2016 in Canaan, CT at age 94. Adored wife of the late Lawrence Friedman, beloved mother of Joan Krey (Lewis), Laura Goldberg (Mark) and Barbara Friedman-Dow (Robert); proud grandmother of Theodore, Jocelyn, Adrienne, Marissa, Jordan, Samantha and Jeffery; contented great-grandmother of Nina; and her late brother Dr. Hugh Kopel. A graduate of Wayne State University, Shirley received a MA in Education from Columbia University Teachers' College and loved her 25 year career in teaching at which she excelled and impacted countless children's lives in Ossining. She was passionate about tennis, bridge, crossword puzzles, cooking, traveling, theatre and dogs. Always curious, adventurous, outspoken, and ready to tell a good joke. Donations to Living Waters Children Center Fund www.lwccfund.orgaiti/, for Haiti Fund. 1/3", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9402E1D7153AF934A25757C0A9609D8B63", "keywords": [{"value": "PROUD GRANDMOTHER OF THEODORE, JOCELYN, ADRIENNE, MARISSA, JORDAN, SAMANTHA AND JEFFERY", "name": "persons"}, {"value": "FRIEDMAN, SHIRLEY RUTH", "name": "persons"}, {"value": "AND HER LATE BROTHER DR. HUGH KOPEL. A GRADUATE OF WAYNE STATE UNIVERSITY, SHIRLEY RECEIVED A MA IN EDUCATION FROM COLUMBIA UNIVERSITY TEACHERS' COLLEGE AND LOVED HER 25 YEAR CAREER IN TEACHING AT WHICH SHE EXCELLED AND IMPACTED COUNTLESS CHILDREN'S LIVES IN OSSINING. SHE WAS PASSIONATE ABOUT TENNIS, BRIDGE, CROSSWORD PUZZLES, COOKING, TRAVELING, THEATRE AND DOGS. ALWAYS CURIOUS, ADVENTUROUS, OUTSPOKEN, AND READY TO TELL A GOOD JOKE. DONATIONS TO LIVING WATERS CHILDREN CENTER FUND WWW.LWCCFUND.ORG", "name": "persons"}, {"value": "CONTENTED GREAT, GRANDMOTHER OF NINA", "name": "persons"}], "blog": [], "_id": "571d894f38f0d8550bf1a706", "source": "The New York Times"}