{"news_desk": "Classified", "print_page": "08", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "280", "lead_paragraph": "SHAPIRO--A. Alfred (\"Ace\"). August 9, 1923 - March 27, 2016. A remarkable and dignified man of great character, strength and integrity, always looking past his needs to those of others. His ability to make friends wherever he went was another of his sterling qualities. He was a people magnet nicknamed \"Ace\" by his friends and all who knew him for just being the best. Truly part of the greatest generation. A decorated WWII Veteran in the 11th Airborne Division. A paratrooper who bravely and honorably defended his nation in the South Pacific. Raised in Oceanside, New York, Ace was known for his decades of leadership and philanthropic efforts throughout the community serving as a past President of the Oceanside Kiwanis Club and mentoring many students in the local Key Club. A superior athlete, Ace (a natural hitter) was drafted by Branch Rickey of the Brooklyn Dodgers while attending the University of Miami. A knee injury suffered during the war prevented what could have been a great career. He returned to Oceanside and became a successful businessman. Ace would tell you his greatest accomplishment, however, was his family. He leaves this world with the undying love and devotion of his family and friends. He will be truly missed and will forever be a part of us. Beloved husband of 64 years to Sheila Shapiro. Adored father and father-in- law to Kenneth Shapiro, Elyse and Andrew Cantor, Sharon and Maurice Kassimir, and Debra and Brad Becker. Cherished grandfather to Evan and Brandon Kassimir, Jared and Ian Cantor, Halle and Amanda Becker. How blessed we've been to have had you in our lives. Services Tuesday, March 29, 2016, 11:00pm, Gutterman's Rockville Center. 1", "pub_date": "2016-03-28T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Memorials  SHAPIRO, A. ALFRED (\"ACE\"). AUGUST 9, 1923, MARCH 27, 2016. A REMARKABLE AND DIGNIFIED MAN OF GREAT CHARACTER, STRENGTH AND INTEGRITY, ALWAYS LOOKING PAST HIS NEEDS TO THOSE OF OTHERS. HIS ABILITY TO MAKE FRIENDS WHEREVER HE WENT WAS ANOTHER OF HIS STERLING QUALITIES. HE WAS A PEOPLE MAGNET NICKNAMED \"ACE\" BY HIS FRIENDS AND ALL WHO KNEW HIM FOR JUST BEING THE BEST. TRULY PART OF THE GREATEST GENERATION. A DECORATED WWII VETERAN IN THE 11TH AIRBORNE DIVISION. A PARATROOPER WHO BRAVELY AND HONORABLY DEFENDED HIS NATION IN THE SOUTH PACIFIC. RAISED IN OCEANSIDE, NEW YORK, ACE WAS KNOWN FOR HIS DECADES OF LEADERSHIP AND PHILANTHROPIC EFFORTS THROUGHOUT THE COMMUNITY SERVING AS A PAST PRESIDENT OF THE OCEANSIDE KIWANIS CLUB AND MENTORING MANY STUDENTS IN THE LOCAL KEY CLUB. A SUPERIOR ATHLETE, ACE (A NATURAL HITTER) WAS DRAFTED BY BRANCH RICKEY OF THE BROOKLYN DODGERS WHILE ATTENDING THE UNIVERSITY OF MIAMI. A KNEE INJURY SUFFERED DURING THE WAR PREVENTED WHAT COULD HAVE BEEN A GREAT CAREER. HE RETURNED TO OCEANSIDE AND BECAME A SUCCESSFUL BUSINESSMAN. ACE WOULD TELL YOU HIS GREATEST ACCOMPLISHMENT, HOWEVER, WAS HIS FAMILY. HE LEAVES THIS WORLD WITH THE UNDYING LOVE AND DEVOTION OF HIS FAMILY AND FRIENDS. HE WILL BE TRULY MISSED AND WILL FOREVER BE A PART OF US. BELOVED HUSBAND OF 64 YEARS TO SHEILA SHAPIRO. ADORED FATHER AND FATHER, IN, LAW TO KENNETH SHAPIRO, ELYSE AND ANDREW CANTOR, SHARON AND MAURICE KASSIMIR, AND DEBRA AND BRAD BECKER. CHERISHED GRANDFATHER TO EVAN AND BRANDON KASSIMIR, JARED AND IAN CANTOR, HALLE AND AMANDA BECKER. HOW BLESSED WE'VE BEEN TO HAVE HAD YOU IN OUR LIVES. SERVICES TUESDAY, MARCH 29, 2016, 11:00PM, GUTTERMAN'S ROCKVILLE CENTER. 1"}, "snippet": "SHAPIRO--A. Alfred (\"Ace\"). August 9, 1923 - March 27, 2016. A remarkable and dignified man of great character, strength and integrity, always looking past his needs to those of others. His ability to make friends wherever he went was another of his sterling qualities. He was a people magnet nicknamed \"Ace\" by his friends and all who knew him for just being the best. Truly part of the greatest generation. A decorated WWII Veteran in the 11th Airborne Division. A paratrooper who bravely and honorably defended his nation in the South Pacific. Raised in Oceanside, New York, Ace was known for his decades of leadership and philanthropic efforts throughout the community serving as a past President of the Oceanside Kiwanis Club and mentoring many students in the local Key Club. A superior athlete, Ace (a natural hitter) was drafted by Branch Rickey of the Brooklyn Dodgers while attending the University of Miami. A knee injury suffered during the war prevented what could have been a great career. He returned to Oceanside and became a successful businessman. Ace would tell you his greatest accomplishment, however, was his family. He leaves this world with the undying love and devotion of his family and friends. He will be truly missed and will forever be a part of us. Beloved husband of 64 years to Sheila Shapiro. Adored father and father-in- law to Kenneth Shapiro, Elyse and Andrew Cantor, Sharon and Maurice Kassimir, and Debra and Brad Becker. Cherished grandfather to Evan and Brandon Kassimir, Jared and Ian Cantor, Halle and Amanda Becker. How blessed we've been to have had you in our lives. Services Tuesday, March 29, 2016, 11:00pm, Gutterman's Rockville Center. 1", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9B0CE2D8143AF93BA15750C0A9609D8B63", "keywords": [{"value": "SHAPIRO, A. ALFRED", "name": "persons"}], "blog": [], "_id": "57032a9b38f0d828b0bfadb3", "source": "The New York Times"}