{"news_desk": "Classified", "print_page": "19", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "167", "lead_paragraph": "WEIDENFELD--Lord George The America-Israel Friendship League expresses its great sorrow at the passing of Lord George Weidenfeld. His wisdom, experience, good will and warm friendship can never be replaced and will never be forgotten. His activities in support of efforts to resolve the challenges of international affairs involved intimate contact with world leaders at the highest levels. He will especially be remembered for guiding the renewal of German participation in world affairs which accelerated Germany's acceptance in the councils of peace and constructive dialogue. His commitment to the survival and success of Israel in world affairs can be matched by few participants in international diplomacy. We send our sincere condolences to Lady Weidenfeld and his adoring family. Mortimer B. Zuckerman, Honorary President; Kenneth J. Bialkin, Chairman; Ambassador Dan Gillerman, Chairman of Israel Board; Daniella Rilov, Executive Director; Ruby Shamir, Executive Director, AIFL Israel and Director of International Operations; Dr. Charlotte K. Frank, Chair, Executive Committee; Ira J. Greenblatt, Treasurer; Peter J. Halasz, Secretary James S. Tisch 1", "pub_date": "2016-01-24T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Memorials  WEIDENFELD, LORD GEORGE THE AMERICA, ISRAEL FRIENDSHIP LEAGUE EXPRESSES ITS GREAT SORROW AT THE PASSING OF LORD GEORGE WEIDENFELD. HIS WISDOM, EXPERIENCE, GOOD WILL AND WARM FRIENDSHIP CAN NEVER BE REPLACED AND WILL NEVER BE FORGOTTEN. HIS ACTIVITIES IN SUPPORT OF EFFORTS TO RESOLVE THE CHALLENGES OF INTERNATIONAL AFFAIRS INVOLVED INTIMATE CONTACT WITH WORLD LEADERS AT THE HIGHEST LEVELS. HE WILL ESPECIALLY BE REMEMBERED FOR GUIDING THE RENEWAL OF GERMAN PARTICIPATION IN WORLD AFFAIRS WHICH ACCELERATED GERMANY'S ACCEPTANCE IN THE COUNCILS OF PEACE AND CONSTRUCTIVE DIALOGUE. HIS COMMITMENT TO THE SURVIVAL AND SUCCESS OF ISRAEL IN WORLD AFFAIRS CAN BE MATCHED BY FEW PARTICIPANTS IN INTERNATIONAL DIPLOMACY. WE SEND OUR SINCERE CONDOLENCES TO LADY WEIDENFELD AND HIS ADORING FAMILY. MORTIMER B. ZUCKERMAN, HONORARY PRESIDENT; KENNETH J. BIALKIN, CHAIRMAN; AMBASSADOR DAN GILLERMAN, CHAIRMAN OF ISRAEL BOARD; DANIELLA RILOV, EXECUTIVE DIRECTOR; RUBY SHAMIR, EXECUTIVE DIRECTOR, AIFL ISRAEL AND DIRECTOR OF INTERNATIONAL OPERATIONS; DR. CHARLOTTE K. FRANK, CHAIR, EXECUTIVE COMMITTEE; IRA J. GREENBLATT, TREASURER; PETER J. HALASZ, SECRETARY JAMES S. TISCH 1"}, "snippet": "WEIDENFELD--Lord George The America-Israel Friendship League expresses its great sorrow at the passing of Lord George Weidenfeld. His wisdom, experience, good will and warm friendship can never be replaced and will never be forgotten. His activities in support of efforts to resolve the challenges of international affairs involved intimate contact with world leaders at the highest levels. He will especially be remembered for guiding the renewal of German participation in world affairs which accelerated Germany's acceptance in the councils of peace and constructive dialogue. His commitment to the survival and success of Israel in world affairs can be matched by few participants in international diplomacy. We send our sincere condolences to Lady Weidenfeld and his adoring family. Mortimer B. Zuckerman, Honorary President; Kenneth J. Bialkin, Chairman; Ambassador Dan Gillerman, Chairman of Israel Board; Daniella Rilov, Executive Director; Ruby Shamir, Executive Director, AIFL Israel and Director of International Operations; Dr. Charlotte K. Frank, Chair, Executive Committee; Ira J. Greenblatt, Treasurer; Peter J. Halasz, Secretary James S. Tisch 1", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9405E7DA1F3AF937A15752C0A9609D8B63", "keywords": [{"value": "RUBY SHAMIR, EXECUTIVE DIRECTOR, AIFL ISRAEL AND DIRECTOR OF INTERNATIONAL OPERATIONS", "name": "persons"}, {"value": "AMBASSADOR DAN GILLERMAN, CHAIRMAN OF ISRAEL BOARD", "name": "persons"}, {"value": "PETER J. HALASZ, SECRETARY JAMES S. TISCH 1", "name": "persons"}, {"value": "DANIELLA RILOV, EXECUTIVE DIRECTOR", "name": "persons"}, {"value": "WEIDENFELD, LORD GEORGE THE AMERICA, ISRAEL FRIENDSHIP LEAGUE EXPRESSES ITS GREAT SORROW AT THE PASSING OF LORD GEORGE WEIDENFELD. HIS WISDOM, EXPERIENCE, GOOD WILL AND WARM FRIENDSHIP CAN NEVER BE REPLACED AND WILL NEVER BE FORGOTTEN. HIS ACTIVITIES IN SUPPORT OF EFFORTS TO RESOLVE THE CHALLENGES OF INTERNATIONAL AFFAIRS INVOLVED INTIMATE CONTACT WITH WORLD LEADERS AT THE HIGHEST LEVELS. HE WILL ESPECIALLY BE REMEMBERED FOR GUIDING THE RENEWAL OF GERMAN PARTICIPATION IN WORLD AFFAIRS WHICH ACCELERATED GERMANY'S ACCEPTANCE IN THE COUNCILS OF PEACE AND CONSTRUCTIVE DIALOGUE. HIS COMMITMENT TO THE SURVIVAL AND SUCCESS OF ISRAEL IN WORLD AFFAIRS CAN BE MATCHED BY FEW PARTICIPANTS IN INTERNATIONAL DIPLOMACY. WE SEND OUR SINCERE CONDOLENCES TO LADY WEIDENFELD AND HIS ADORING FAMILY. MORTIMER B. ZUCKERMAN, HONORARY PRESIDENT", "name": "persons"}, {"value": "KENNETH J. BIALKIN, CHAIRMAN", "name": "persons"}, {"value": "DR. CHARLOTTE K. FRANK, CHAIR, EXECUTIVE COMMITTEE", "name": "persons"}, {"value": "IRA J. GREENBLATT, TREASURER", "name": "persons"}], "blog": [], "_id": "56aed93038f0d82f06c0cce2", "source": "The New York Times"}