{"news_desk": "Classified", "print_page": "15", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "191", "lead_paragraph": "GOLDBERG--Judy-Lynn, passed away on June 19, 2016 at age 62. She had a distinguished career in education and law. She served as an ALJ for the State of MD, DLLR for 23 years. She also was a Senior Lecturer at the John Hopkins University Carey Program and received the Faculty Teaching Excellence Award in 2003. Judy had a solo law practice in Baltimore City and Towson. She worked in advertising for a year in NYC and then moved to Baltimore where she taught at Sparrows Point High School. Judy grew up in Cranford, NJ and earned a BS degree at the University of Vermont in 1975. She graduated from the University of Baltimore School of Law in 1982. Judy enjoyed traveling, gardening, the New York Times crosswords and the fine arts. She cherished a loving circle of friends who will miss her deeply. She is survived by her brother, Alan B. Goldenberg and her sister-in-law, Joanne Moustakas of Boynton Beach, FL and numerous cousins. Judy was an avid animal advocate. Donations may be made in her name to the Best Friends Animal Society, Kanub, Utah, or another animal rights organization. 1/3", "pub_date": "2016-07-01T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  GOLDBERG, JUDY, LYNN"}, "snippet": "GOLDBERG--Judy-Lynn, passed away on June 19, 2016 at age 62. She had a distinguished career in education and law. She served as an ALJ for the State of MD, DLLR for 23 years. She also was a Senior Lecturer at the John Hopkins University Carey Prog...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E07EFDE113AF932A35754C0A9609D8B63", "keywords": [{"value": "GOLDBERG, JUDY, LYNN", "name": "persons"}], "blog": [], "_id": "5780698738f0d8706f764249", "source": "The New York Times"}