{"news_desk": "Classified", "print_page": "15", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "461", "lead_paragraph": "MORRIS--Irving Nathaniel. Irving Morris, an attorney known for his tenacious representation of plaintiffs across a broad range of litigation over a five-decade career, died on Tuesday at his home in Palm Beach, Florida. He was ninety years old. Irving Nathaniel Morris was born in Trenton, New Jersey, on December 18, 1925, the third of Abraham and Katie Morris' four children. The family moved to Wilmington, Delaware, when Morris was two years old. He lived, practiced law and raised a family there until his retirement in 2001. Morris turned nineteen in a foxhole, was captured during the Battle of the Bulge, and spent six weeks as a \"guest of the Germans\" before being liberated in 1945. After completing studies at the University of Delaware and Yale Law School on the GI Bill, Morris served for two years as a law clerk to U.S. District Court Chief Judge Paul Leahy, before entering private practice in 1953. Morris specialized in representing shareholders injured by corporations' misstatements and misconduct, and spent decades fighting segregation and pursuing equal opportunity in education for Delaware's school children. He was a member of the American College of Trial Lawyers, the American Bar Foundation, the American Bar Association, and served as President of the Delaware Bar Association. He was awarded the Delaware Bar Association's highest award for leadership and service, The First State Distinguished Service Award. He was also a leader in his community, serving as President of Congregation Beth Shalom, where he was a lifelong member, and chairing fundraising campaigns for The United Way and the Jewish Federation of Delaware. Morris retired from the practice of the law on September 11, 2001, directing his energy to \"The Rape Case\", a book chronicling his successful 1950s defense on appeal of three accused rapists. The case established the principal that the presence of police perjury renders a trial fundamentally unfair, denying due process as guaranteed in the Constitution. Morris was predeceased by his siblings, Melvin, Sylvia Rochlin and Herbert; his son, Jonathan; son-in-law, Bruce Zakheim; and by Doris, his wife of 58 years. He is survived by his daughters, Deborah Zakheim and Karen Morris (Alan Levenson); and his son, David; and by nine grandchildren who were enriched by years of Grandpa's unwavering attention and unquestioning love: Jonathan (Amanda), Adam, Benjamin, Tyler, Joshua, Devin, Samuel, Shelby, and Peyton. Funeral services will be 11:00am, Friday, July 1, 2016 at Congregation Beth Shalom, 1801 Baynard Boulevard, Wilmington, DE 19802. Shiva will be observed 7:30pm, Saturday, July 2 through Thursday, July 7 at the home of Karen Morris and Alan Levenson. In lieu of flowers, the family suggests contributions in memory of Irving Morris to the Brennan Center for Justice at the NYU School of Law (www.brennancenter.org) or to HIAS (www.hias.org). Schoenberg Memorial Chapel. 1/3", "pub_date": "2016-07-01T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  MORRIS, IRVING NATHANIEL"}, "snippet": "MORRIS--Irving Nathaniel. Irving Morris, an attorney known for his tenacious representation of plaintiffs across a broad range of litigation over a five-decade career, died on Tuesday at his home in Palm Beach, Florida. He was ninety years old. Ir...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9F07EEDE113AF932A35754C0A9609D8B63", "keywords": [{"value": "MORRIS, IRVING NATHANIEL", "name": "persons"}], "blog": [], "_id": "578069a138f0d8706f764250", "source": "The New York Times"}