{"news_desk": "Classified", "print_page": "19", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "273", "lead_paragraph": "LEE--Wol Sue (Chun) Wol Sue Lee (Chun) has passed peacefully at her home in Scarsdale, New York. Born in Cheonan, South Korea on January 11, 1938, Wol Sue studied English Literature at Ewha Womans University in Seoul, graduating with honors in 1960. In 1963 she followed love seven thousand miles across the Pacific Ocean to Boston, where she married John Jongjin Lee and earned her Masters in Education at Boston University. John and Wol Sue moved to Nashville, Tennessee in 1968, where she earned a Masters in Library Science at Peabody College. In 1970 Wol Sue took a job at the New York Public Library where she ultimately served as Head Reference Librarian at the Mid-Manhattan branch. For 38 years she answered questions for New Yorkers on every conceivable topic, finally retiring from NYPL in 2008. Warm hearted and quick to laugh, Wol Sue took care of everyone around her. She is survived by her husband John, children Carol and Christopher, her grandchildren Jack, Moose, and Ellie who will miss their Halmony deeply, her sisters Yang Soo Kim, Yun Soo Lim and Nam Sue Chun, and her brothers Myung Soo Chun, Chong Soo Chun and Moon Soo Chun. She was preceded in death by her sister Ae Sue Jin. Memorial services will be held at Scarsdale Community Baptist Church on Saturday, May 28, 2016 at 2 o'clock. Donations can be made to the Wol Sue (Chun) Lee Scholarship at Ewha Womans University through the International Foundation of Ewha Womans University (IFEWU) at 475 Riverside Drive, Rm 1505, NY, NY 10115. Raise a glass (small) of Harvey's Bristol Cream and remember her well. 1", "pub_date": "2016-05-27T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Memorials  LEE, WOL SUE (CHUN) WOL SUE LEE (CHUN) HAS PASSED PEACEFULLY AT HER HOME IN SCARSDALE, NEW YORK. BORN IN CHEONAN, SOUTH KOREA ON JANUARY 11, 1938, WOL SUE STUDIED ENGLISH LITERATURE AT EWHA WOMANS UNIVERSITY IN SEOUL, GRADUATING WITH HONORS IN 1960. IN 1963 SHE FOLLOWED LOVE SEVEN THOUSAND MILES ACROSS THE PACIFIC OCEAN TO BOSTON, WHERE SHE MARRIED JOHN JONGJIN LEE AND EARNED HER MASTERS IN EDUCATION AT BOSTON UNIVERSITY. JOHN AND WOL SUE MOVED TO NASHVILLE, TENNESSEE IN 1968, WHERE SHE EARNED A MASTERS IN LIBRARY SCIENCE AT PEABODY COLLEGE. IN 1970 WOL SUE TOOK A JOB AT THE NEW YORK PUBLIC LIBRARY WHERE SHE ULTIMATELY SERVED AS HEAD REFERENCE LIBRARIAN AT THE MID, MANHATTAN BRANCH. FOR 38 YEARS SHE ANSWERED QUESTIONS FOR NEW YORKERS ON EVERY CONCEIVABLE TOPIC, FINALLY RETIRING FROM NYPL IN 2008. WARM HEARTED AND QUICK TO LAUGH, WOL SUE TOOK CARE OF EVERYONE AROUND HER. SHE IS SURVIVED BY HER HUSBAND JOHN, CHILDREN CAROL AND CHRISTOPHER, HER GRANDCHILDREN JACK, MOOSE, AND ELLIE WHO WILL MISS THEIR HALMONY DEEPLY, HER SISTERS YANG SOO KIM, YUN SOO LIM AND NAM SUE CHUN, AND HER BROTHERS MYUNG SOO CHUN, CHONG SOO CHUN AND MOON SOO CHUN. SHE WAS PRECEDED IN DEATH BY HER SISTER AE SUE JIN. MEMORIAL SERVICES WILL BE HELD AT SCARSDALE COMMUNITY BAPTIST CHURCH ON SATURDAY, MAY 28, 2016 AT 2 O'CLOCK. DONATIONS CAN BE MADE TO THE WOL SUE (CHUN) LEE SCHOLARSHIP AT EWHA WOMANS UNIVERSITY THROUGH THE INTERNATIONAL FOUNDATION OF EWHA WOMANS UNIVERSITY (IFEWU) AT 475 RIVERSIDE DRIVE, RM 1505, NY, NY 10115. RAISE A GLASS (SMALL) OF HARVEY'S BRISTOL CREAM AND REMEMBER HER WELL. 1"}, "snippet": "LEE--Wol Sue (Chun) Wol Sue Lee (Chun) has passed peacefully at her home in Scarsdale, New York. Born in Cheonan, South Korea on January 11, 1938, Wol Sue studied English Literature at Ewha Womans University in Seoul, graduating with honors in 1960. In 1963 she followed love seven thousand miles across the Pacific Ocean to Boston, where she married John Jongjin Lee and earned her Masters in Education at Boston University. John and Wol Sue moved to Nashville, Tennessee in 1968, where she earned a Masters in Library Science at Peabody College. In 1970 Wol Sue took a job at the New York Public Library where she ultimately served as Head Reference Librarian at the Mid-Manhattan branch. For 38 years she answered questions for New Yorkers on every conceivable topic, finally retiring from NYPL in 2008. Warm hearted and quick to laugh, Wol Sue took care of everyone around her. She is survived by her husband John, children Carol and Christopher, her grandchildren Jack, Moose, and Ellie who will miss their Halmony deeply, her sisters Yang Soo Kim, Yun Soo Lim and Nam Sue Chun, and her brothers Myung Soo Chun, Chong Soo Chun and Moon Soo Chun. She was preceded in death by her sister Ae Sue Jin. Memorial services will be held at Scarsdale Community Baptist Church on Saturday, May 28, 2016 at 2 o'clock. Donations can be made to the Wol Sue (Chun) Lee Scholarship at Ewha Womans University through the International Foundation of Ewha Womans University (IFEWU) at 475 Riverside Drive, Rm 1505, NY, NY 10115. Raise a glass (small) of Harvey's Bristol Cream and remember her well. 1", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9F06E2D9133AF934A15756C0A9609D8B63", "keywords": [{"value": "LEE, WOL SUE", "name": "persons"}], "blog": [], "_id": "575244e138f0d8118c453609", "source": "The New York Times"}