{"news_desk": "Classified", "print_page": "18", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "792", "lead_paragraph": "BURGUIERES--Philip Joseph Well-known Houston business and community leader, Philip Joseph Burguieres, passed away on the on the evening of June 30, 2016, surrounded by his family and loved ones. A devoted grandfather, father and husband Philip earned his Bachelor of Science degree in Mechanical Engineering from The University of Louisiana - Lafayette, where a Chair in the engineering department has been dedicated in his honor. In 1992 he received the Outstanding Alumni Award. Shortly after graduation, Philip married Cheryl Courrege and soon joined the Navy, completing training at Officer Candidate School. He served in the U.S. Navy for four years during the Vietnam era as a \"Seabee\", reaching the rank of Lieutenant. Upon completion of his service, Philip was accepted to The Wharton Graduate School of Business. Upon graduation he accepted a job with Cameron Iron Works, Inc. in Houston, Texas in 1971. Under the guidance of Herb Allen, Philip became President and Chief Operating Officer in 1981 at the young age of 38. By 1986 he was one of the youngest Chief Executive Officers to ever run a Fortune 500 company. Philip joined the board of the J.M. Burguieres Company in 1978, a family-owned, land-holding company that he would chair from 1986 until 2012. In 1990, Philip joined Panhandle Eastern Corporation, as President and Chief Executive Officer. Philip returned to the oilfield service industry in 1991 as President, Chief Executive Officer and Chairman of Weatherford International, Inc. Soon after merging the company with Enterra in 1996, Philip resigned, marking the end of a 30-year energy career, during which he was named Energy Service Industry CEO of the Year three times by Financial World Magazine. Philip provided unrelenting service to his industry and community. He served as President of the Petroleum Club of Houston, the Petroleum Equipment Suppliers' Association and as Chairman of the National Ocean Industries Association, the Board of Directors of Texas Commerce Bancshares, McDermott International and Cogen Technologies. He was a member of the Texas Heart Institute's National Advisory Council and chaired the Board of Duchesne Academy of the Sacred Heart. After a brief hiatus, Philip began helping his friend John Sage develop Bridges to Life, serving on its Board. He consulted for Cogen Technologies which led to Bob McNair inviting him to begin a new career as Vice Chairman of the Houston Texans in 1999. Philip served as Chairman of Mental Health America of Greater Houston and in 2000 he received the organization's Ima Hogg Award. He paved the way for the Texans to be the first NFL franchise to implement mental health parity in 2002. For these efforts, he was named the 2003 William Styron Award recipient by the National Mental Health Association. In 2005 Philip received the Woodrow Wilson Corporate Citizenship Award from the Smithsonian Institute. Philip served as Vice Chairman of both the Menninger Clinic and the Baylor College of Medicine as well as on the Executive Committee of M.D. Anderson Cancer Center. He crafted a vision for the Menninger Clinic \"Mental Health Epicenter.\" In 2012, that vision became a reality with the opening of a state-of-the-art, 50-acre psychiatric hospital facility. Philip served as the Vice Chairman of the Meineke Car Care Bowl of Texas. He served the Board of Directors of FMC Technologies, Inc. and Newfield Exploration Company and was a member of the National Petroleum Council. Later that same year, Philip sustained a brain injury. He worked tirelessly over the following years to recover as much as he could and his efforts were nothing short of heroic. He was preceded in death by his parents, Denis Philip Burguieres, Jr. and Emma Louise LeBlanc Burguieres and his first wife Cheryl Courrege Burguieres. He is survived by his wife of nine years, Alice Kirkpatrick Burguieres, and his children Emily Burguieres Dalicandro and her husband Steve, and P. Martial Burguieres and his wife Valeria, his stepchildren Stephanie and Morgan Harcrow and Ashley Harcrow Moseley and her husband Seth, and numerous other family and friends. Although Philip will be sorely missed by everyone whose lives he touched and who had the privilege of knowing him. His remarkable legacy to his family and to the city of Houston will be recognized for generations to come. Services will be held on July 6 and 7 in Houston, Texas under the direction of Bradshaw-Carter Memorial & Funeral Services, 1734 West Alabama Street in Houston and July 8 and 9 in Franklin, Louisa, and New Iberia, Louisiana under the direction of Ibert's Mortuary, 1007 Main Street, Franklin, Louisiana. Memorial gifts may be made to The Menninger Clinic (www.menningerclinic.com/ donateake-a-donation-to- Menninger), Office of Philanthropy, 12301 Main Street, Houston, Texas 77035 or to the Burguieres Family Foundation (www.GHCF.org/donation- ghcf/) payable to the Greater Houston Community Foundation, ATTN: Gift Processor, 5120 Woodway Dr. #", "pub_date": "2016-07-06T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Memorials  BURGUIERES, PHILIP JOSEPH WELL, KNOWN HOUSTON BUSINESS AND COMMUNITY LEADER, PHILIP JOSEPH BURGUIERES, PASSED AWAY ON THE ON THE EVENING OF JUNE 30, 2016, SURROUNDED BY HIS FAMILY AND LOVED ONES. A DEVOTED GRANDFATHER, FATHER AND HUSBAND PHILIP EARNED HIS BACHELOR OF SCIENCE DEGREE IN MECHANICAL ENGINEERING FROM THE UNIVERSITY OF LOUISIANA, LAFAYETTE, WHERE A CHAIR IN THE ENGINEERING DEPARTMENT HAS BEEN DEDICATED IN HIS HONOR. IN 1992 HE RECEIVED THE OUTSTANDING ALUMNI AWARD. SHORTLY AFTER GRADUATION, PHILIP MARRIED CHERYL COURREGE AND SOON JOINED THE NAVY, COMPLETING TRAINING AT OFFICER CANDIDATE SCHOOL. HE SERVED IN THE U.S. NAVY FOR FOUR YEARS DURING THE VIETNAM ERA AS A \"SEABEE\", REACHING THE RANK OF LIEUTENANT. UPON COMPLETION OF HIS SERVICE, PHILIP WAS ACCEPTED TO THE WHARTON GRADUATE SCHOOL OF BUSINESS. UPON GRADUATION HE ACCEPTED A JOB WITH CAMERON IRON WORKS, INC. IN HOUSTON, TEXAS IN 1971. UNDER THE GUIDANCE OF HERB ALLEN, PHILIP BECAME PRESIDENT AND CHIEF OPERATING OFFICER IN 1981 AT THE YOUNG AGE OF 38. BY 1986 HE WAS ONE OF THE YOUNGEST CHIEF EXECUTIVE OFFICERS TO EVER RUN A FORTUNE 500 COMPANY. PHILIP JOINED THE BOARD OF THE J.M. BURGUIERES COMPANY IN 1978, A FAMILY, OWNED, LAND, HOLDING COMPANY THAT HE WOULD CHAIR FROM 1986 UNTIL 2012. IN 1990, PHILIP JOINED PANHANDLE EASTERN CORPORATION, AS PRESIDENT AND CHIEF EXECUTIVE OFFICER. PHILIP RETURNED TO THE OILFIELD SERVICE INDUSTRY IN 1991 AS PRESIDENT, CHIEF EXECUTIVE OFFICER AND CHAIRMAN OF WEATHERFORD INTERNATIONAL, INC. SOON AFTER MERGING THE COMPANY WITH ENTERRA IN 1996, PHILIP RESIGNED, MARKING THE END OF A 30, YEAR ENERGY CAREER, DURING WHICH HE WAS NAMED ENERGY SERVICE INDUSTRY CEO OF THE YEAR THREE TIMES BY FINANCIAL WORLD MAGAZINE. PHILIP PROVIDED UNRELENTING SERVICE TO HIS INDUSTRY AND COMMUNITY. HE SERVED AS PRESIDENT OF THE PETROLEUM CLUB OF HOUSTON, THE PETROLEUM EQUIPMENT SUPPLIERS' ASSOCIATION AND AS CHAIRMAN OF THE NATIONAL OCEAN INDUSTRIES ASSOCIATION, THE BOARD OF DIRECTORS OF TEXAS COMMERCE BANCSHARES, MCDERMOTT INTERNATIONAL AND COGEN TECHNOLOGIES. HE WAS A MEMBER OF THE TEXAS HEART INSTITUTE'S NATIONAL ADVISORY COUNCIL AND CHAIRED THE BOARD OF DUCHESNE ACADEMY OF THE SACRED HEART. AFTER A BRIEF HIATUS, PHILIP BEGAN HELPING HIS FRIEND JOHN SAGE DEVELOP BRIDGES TO LIFE, SERVING ON ITS BOARD. HE CONSULTED FOR COGEN TECHNOLOGIES WHICH LED TO BOB MCNAIR INVITING HIM TO BEGIN A NEW CAREER AS VICE CHAIRMAN OF THE HOUSTON TEXANS IN 1999. PHILIP SERVED AS CHAIRMAN OF MENTAL HEALTH AMERICA OF GREATER HOUSTON AND IN 2000 HE RECEIVED THE ORGANIZATION'S IMA HOGG AWARD. HE PAVED THE WAY FOR THE TEXANS TO BE THE FIRST NFL FRANCHISE TO IMPLEMENT MENTAL HEALTH PARITY IN 2002. FOR THESE EFFORTS, HE WAS NAMED THE 2003 WILLIAM STYRON AWARD RECIPIENT BY THE NATIONAL MENTAL HEALTH ASSOCIATION. IN 2005 PHILIP RECEIVED THE WOODROW WILSON CORPORATE CITIZENSHIP AWARD FROM THE SMITHSONIAN INSTITUTE. PHILIP SERVED AS VICE CHAIRMAN OF BOTH THE MENNINGER CLINIC AND THE BAYLOR COLLEGE OF MEDICINE AS WELL AS ON THE EXECUTIVE COMMITTEE OF M.D. ANDERSON CANCER CENTER. HE CRAFTED A VISION FOR THE MENNINGER CLINIC \"MENTAL HEALTH EPICENTER.\" IN 2012, THAT VISION BECAME A REALITY WITH THE OPENING OF A STATE, OF, THE, ART, 50, ACRE PSYCHIATRIC HOSPITAL FACILITY. PHILIP SERVED AS THE VICE CHAIRMAN OF THE MEINEKE CAR CARE BOWL OF TEXAS. HE SERVED THE BOARD OF DIRECTORS OF FMC TECHNOLOGIES, INC. AND NEWFIELD EXPLORATION COMPANY AND WAS A MEMBER OF THE NATIONAL PETROLEUM COUNCIL. LATER THAT SAME YEAR, PHILIP SUSTAINED A BRAIN INJURY. HE WORKED TIRELESSLY OVER THE FOLLOWING YEARS TO RECOVER AS MUCH AS HE COULD AND HIS EFFORTS WERE NOTHING SHORT OF HEROIC. HE WAS PRECEDED IN DEATH BY HIS PARENTS, DENIS PHILIP BURGUIERES, JR. AND EMMA LOUISE LEBLANC BURGUIERES AND HIS FIRST WIFE CHERYL COURREGE BURGUIERES. HE IS SURVIVED BY HIS WIFE OF NINE YEARS, ALICE KIRKPATRICK BURGUIERES, AND HIS CHILDREN EMILY BURGUIERES DALICANDRO AND HER HUSBAND STEVE, AND P. MARTIAL BURGUIERES AND HIS WIFE VALERIA, HIS STEPCHILDREN STEPHANIE AND MORGAN HARCROW AND ASHLEY HARCROW MOSELEY AND HER HUSBAND SETH, AND NUMEROUS OTHER FAMILY AND FRIENDS. ALTHOUGH PHILIP WILL BE SORELY MISSED BY EVERYONE WHOSE LIVES HE TOUCHED AND WHO HAD THE PRIVILEGE OF KNOWING HIM. HIS REMARKABLE LEGACY TO HIS FAMILY AND TO THE CITY OF HOUSTON WILL BE RECOGNIZED FOR GENERATIONS TO COME. SERVICES WILL BE HELD ON JULY 6 AND 7 IN HOUSTON, TEXAS UNDER THE DIRECTION OF BRADSHAW, CARTER MEMORIAL & FUNERAL SERVICES, 1734 WEST ALABAMA STREET IN HOUSTON AND JULY 8 AND 9 IN FRANKLIN, LOUISA, AND NEW IBERIA, LOUISIANA UNDER THE DIRECTION OF IBERT'S MORTUARY, 1007 MAIN STREET, FRANKLIN, LOUISIANA. MEMORIAL GIFTS MAY BE MADE TO THE MENNINGER CLINIC (WWW.MENNINGERCLINIC.COM"}, "snippet": "BURGUIERES--Philip Joseph Well-known Houston business and community leader, Philip Joseph Burguieres, passed away on the on the evening of June 30, 2016, surrounded by his family and loved ones. A devoted grandfather, father and husband Philip ear...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9B0CE4DB113AF935A35754C0A9609D8B63", "keywords": [{"value": "BURGUIERES, PHILIP JOSEPH WELL, KNOWN HOUSTON BUSINESS AND COMMUNITY LEADER, PHILIP JOSEPH BURGUIERES, PASSED AWAY ON THE ON THE EVENING OF JUNE 30, 2016, SURROUNDED BY HIS FAMILY AND LOVED ONES. A DEVOTED GRANDFATHER, FATHER AND HUSBAND PHILIP EARNED HIS BACHELOR OF SCIENCE DEGREE IN MECHANICAL ENGINEERING FROM THE UNIVERSITY OF LOUISIANA, LAFAYETTE, WHERE A CHAIR IN THE ENGINEERING DEPARTMENT HAS BEEN DEDICATED IN HIS HONOR. IN 1992 HE RECEIVED THE OUTSTANDING ALUMNI AWARD. SHORTLY AFTER GRADUATION, PHILIP MARRIED CHERYL COURREGE AND SOON JOINED THE NAVY, COMPLETING TRAINING AT OFFICER CANDIDATE SCHOOL. HE SERVED IN THE U.S. NAVY FOR FOUR YEARS DURING THE VIETNAM ERA AS A \"SEABEE\", REACHING THE RANK OF LIEUTENANT. UPON COMPLETION OF HIS SERVICE, PHILIP WAS ACCEPTED TO THE WHARTON GRADUATE SCHOOL OF BUSINESS. UPON GRADUATION HE ACCEPTED A JOB WITH CAMERON IRON WORKS, INC. IN HOUSTON, TEXAS IN 1971. UNDER THE GUIDANCE OF HERB ALLEN, PHILIP BECAME PRESIDENT AND CHIEF OPERATING OFFICER IN 1981 AT THE YOUNG AGE OF 38. BY 1986 HE WAS ONE OF THE YOUNGEST CHIEF EXECUTIVE OFFICERS TO EVER RUN A FORTUNE 500 COMPANY. PHILIP JOINED THE BOARD OF THE J.M. BURGUIERES COMPANY IN 1978, A FAMILY, OWNED, LAND, HOLDING COMPANY THAT HE WOULD CHAIR FROM 1986 UNTIL 2012. IN 1990, PHILIP JOINED PANHANDLE EASTERN CORPORATION, AS PRESIDENT AND CHIEF EXECUTIVE OFFICER. PHILIP RETURNED TO THE OILFIELD SERVICE INDUSTRY IN 1991 AS PRESIDENT, CHIEF EXECUTIVE OFFICER AND CHAIRMAN OF WEATHERFORD INTERNATIONAL, INC. SOON AFTER MERGING THE COMPANY WITH ENTERRA IN 1996, PHILIP RESIGNED, MARKING THE END OF A 30, YEAR ENERGY CAREER, DURING WHICH HE WAS NAMED ENERGY SERVICE INDUSTRY CEO OF THE YEAR THREE TIMES BY FINANCIAL WORLD MAGAZINE. PHILIP PROVIDED UNRELENTING SERVICE TO HIS INDUSTRY AND COMMUNITY. HE SERVED AS PRESIDENT OF THE PETROLEUM CLUB OF HOUSTON, THE PETROLEUM EQUIPMENT SUPPLIERS' ASSOCIATION AND AS CHAIRMAN OF THE NATIONAL OCEAN INDUSTRIES ASSOCIATION, THE BOARD OF DIRECTORS OF TEXAS COMMERCE BANCSHARES, MCDERMOTT INTERNATIONAL AND COGEN TECHNOLOGIES. HE WAS A MEMBER OF THE TEXAS HEART INSTITUTE'S NATIONAL ADVISORY COUNCIL AND CHAIRED THE BOARD OF DUCHESNE ACADEMY OF THE SACRED HEART. AFTER A BRIEF HIATUS, PHILIP BEGAN HELPING HIS FRIEND JOHN SAGE DEVELOP BRIDGES TO LIFE, SERVING ON ITS BOARD. HE CONSULTED FOR COGEN TECHNOLOGIES WHICH LED TO BOB MCNAIR INVITING HIM TO BEGIN A NEW CAREER AS VICE CHAIRMAN OF THE HOUSTON TEXANS IN 1999. PHILIP SERVED AS CHAIRMAN OF MENTAL HEALTH AMERICA OF GREATER HOUSTON AND IN 2000 HE RECEIVED THE ORGANIZATION'S IMA HOGG AWARD. HE PAVED THE WAY FOR THE TEXANS TO BE THE FIRST NFL FRANCHISE TO IMPLEMENT MENTAL HEALTH PARITY IN 2002. FOR THESE EFFORTS, HE WAS NAMED THE 2003 WILLIAM STYRON AWARD RECIPIENT BY THE NATIONAL MENTAL HEALTH ASSOCIATION. IN 2005 PHILIP RECEIVED THE WOODROW WILSON CORPORATE CITIZENSHIP AWARD FROM THE SMITHSONIAN INSTITUTE. PHILIP SERVED AS VICE CHAIRMAN OF BOTH THE MENNINGER CLINIC AND THE BAYLOR COLLEGE OF MEDICINE AS WELL AS ON THE EXECUTIVE COMMITTEE OF M.D. ANDERSON CANCER CENTER. HE CRAFTED A VISION FOR THE MENNINGER CLINIC \"MENTAL HEALTH EPICENTER.\" IN 2012, THAT VISION BECAME A REALITY WITH THE OPENING OF A STATE, OF, THE, ART, 50, ACRE PSYCHIATRIC HOSPITAL FACILITY. PHILIP SERVED AS THE VICE CHAIRMAN OF THE MEINEKE CAR CARE BOWL OF TEXAS. HE SERVED THE BOARD OF DIRECTORS OF FMC TECHNOLOGIES, INC. AND NEWFIELD EXPLORATION COMPANY AND WAS A MEMBER OF THE NATIONAL PETROLEUM COUNCIL. LATER THAT SAME YEAR, PHILIP SUSTAINED A BRAIN INJURY. HE WORKED TIRELESSLY OVER THE FOLLOWING YEARS TO RECOVER AS MUCH AS HE COULD AND HIS EFFORTS WERE NOTHING SHORT OF HEROIC. HE WAS PRECEDED IN DEATH BY HIS PARENTS, DENIS PHILIP BURGUIERES, JR. AND EMMA LOUISE LEBLANC BURGUIERES AND HIS FIRST WIFE CHERYL COURREGE BURGUIERES. HE IS SURVIVED BY HIS WIFE OF NINE YEARS, ALICE KIRKPATRICK BURGUIERES, AND HIS CHILDREN EMILY BURGUIERES DALICANDRO AND HER HUSBAND STEVE, AND P. MARTIAL BURGUIERES AND HIS WIFE VALERIA, HIS STEPCHILDREN STEPHANIE AND MORGAN HARCROW AND ASHLEY HARCROW MOSELEY AND HER HUSBAND SETH, AND NUMEROUS OTHER FAMILY AND FRIENDS. ALTHOUGH PHILIP WILL BE SORELY MISSED BY EVERYONE WHOSE LIVES HE TOUCHED AND WHO HAD THE PRIVILEGE OF KNOWING HIM. HIS REMARKABLE LEGACY TO HIS FAMILY AND TO THE CITY OF HOUSTON WILL BE RECOGNIZED FOR GENERATIONS TO COME. SERVICES WILL BE HELD ON JULY 6 AND 7 IN HOUSTON, TEXAS UNDER THE DIRECTION OF BRADSHAW, CARTER MEMORIAL & FUNERAL SERVICES, 1734 WEST ALABAMA STREET IN HOUSTON AND JULY 8 AND 9 IN FRANKLIN, LOUISA, AND NEW IBERIA, LOUISIANA UNDER THE DIRECTION OF IBERT'S MORTUARY, 1007 MAIN STREET, FRANKLIN, LOUISIANA. MEMORIAL GIFTS MAY BE MADE TO THE MENNINGER CLINIC (WWW.MENNINGERCLINIC.COM", "name": "persons"}], "blog": [], "_id": "5787013c38f0d80e646b3af7", "source": "The New York Times"}