{"news_desk": "Classified", "print_page": "18", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "493", "lead_paragraph": "CARR--Helen B.,(nee Trainer), beloved wife, devoted mother, nurturing grandmother, loving sister, thoughtful aunt and faithful friend, died peacefully at her home in Southampton, NY on June 11, 2016, just 12 days before her 95th birthday. Helen was born June 23, 1921 in Central Falls, CT to Harold A. Trainer and Sarah E. Trainer (nee Fraser). Her family moved to Coventry, RI, where she graduated from Coventry High School, earning the senior superlative of \"Miss Dependable\". As an active 4H member, Helen was featured on radio programming as \"Peggy Clover\". Choosing to study nursing, she graduated from The Memorial Hospital School of Nursing in Pawtucket, RI. Helen garnered special recognition for her speed and proficiency administering The Sister Kenny treatment to patients victimized by Polio. While visiting family in Helen's care, Peter F. Carr asked Helen to a hospital dance. They would later marry January 30, 1945. Helen chose a career as a public health nurse, visiting neighborhoods and homes in service of the poor and disadvantaged. Peter, Helen and their son Peter, Jr. traveled The Thoroughbred Racing circuit eventually settling in New York. After welcoming a second child, Helen stopped working outside the home in nursing. However, she did become the \"neighborhood nurse\", ready to provide first aid, wipe a tear or apply a Band-Aid. As their family grew, they continued to travel for Peter's career in racing. This took them to Hialeah, Florida in the winter and Saratoga, NY during the summer but Long Island was home. Along with her husband, Helen conceptualized and created a health care insurance program for the New York State Jockey Agent's Benevolent Association. A program Helen administered long after her husband's death. Although she hadn't played for years, Helen developed a love of golf which she shared with her husband. Whether attending a symphony at Carnegie Hall, a ballet at The Met, cabaret at The Algonquin or a Broadway show, Helen loved music and the arts. Her love for poetry, both reading and writing lasted throughout her lifetime. With her ability to make friends easily, she was treasured by everyone who knew her. Dedication to her family was at the core of everything she did throughout her life. She was an extraordinarily caring person. Helen will be sadly missed by her daughter Karen and her wife Yvette Christofilis of Westchester, NY, her daughter Sharon of Southampton, NY, her cherished brother Arthur of Coventry, RI, grandson Kevin of Arkansas, dear friends and relatives. Helen was predeceased by her husband, Peter Sr. in 1985 and her son, Peter Jr. in 2014. A Funeral Mass and graveside memorial service in Coventry, RI, will be announced at a future date. Memorial donations may be made to Leukemia & Lymphoma Society (LLS), www.lls.org; American Heart Association, www.heart.org; East End Hospice, www.eeh.org, The Hospital for Special Surgery's Autoimmunity and Inflammation Program (www.hss.edu), Group For The East End, www.groupfortheeast end.org. A kind thought and prayer for peace would truly honor Helen's spirit. 1/3", "pub_date": "2016-07-06T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  CARR, HELEN B."}, "snippet": "CARR--Helen B.,(nee Trainer), beloved wife, devoted mother, nurturing grandmother, loving sister, thoughtful aunt and faithful friend, died peacefully at her home in Southampton, NY on June 11, 2016, just 12 days before her 95th birthday. Helen wa...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9505E3DB113AF935A35754C0A9609D8B63", "keywords": [{"value": "CARR, HELEN B.", "name": "persons"}], "blog": [], "_id": "5787011338f0d80e646b3aeb", "source": "The New York Times"}