{"news_desk": "Classified", "print_page": "18", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "535", "lead_paragraph": "TAYLOR--Jack Crawford, of St. Louis, Missouri, died July 2, 2016, at the age of 94. Beloved father of Andrew C. (Barbara) Taylor and Jo Ann Taylor Kindle (Tom Caruso); devoted grandfather of Alison Kindle (Kyle) Hogan, Carolyn Kindle (Adam) Betz, Christine Taylor (Lee) Broughton, Kelly Taylor and Patricia Taylor (Andy Magee); and cherished great- grandfather of Grace and Amelia Broughton and Kylie Hogan. Taylor was the founder of Enterprise Holdings, which through its Enterprise Rent-A-Car, National Car Rental and Alamo Rent A Car brands is the largest and most comprehensive service provider in the car rental industry. Born and raised in St. Louis, Taylor served his country as a decorated Navy fighter pilot in World War II before returning home to build the company his family still owns and operates. In 1957, he launched a small, auto leasing operation with seven vehicles in the lower level of a Cadillac dealership--expanding to daily car rental a few years later as an additional service to customers. In the decades to come, he turned his start-up into one of the business world's greatest success stories. As the rest of the industry focused on serving airports, Taylor pioneered the \"home city\" car rental market. By renting cars from convenient, neighborhood locations to meet a variety of customer needs, Enterprise quietly but steadily developed a market segment that grew to be as large as or larger than the airport-based rental market. Today, Enterprise Holdings owns three of the most successful car rental brands in the world, a fleet of 1.7 million vehicles and offers extensive car rental and car-sharing services, truck rental, corporate fleet management and retail car sales. Taylor built his company on a simple philosophy: \"Take care of your customers and your employees first, and the profits will follow.\" And indeed they did. Over the years, his passion for the business was equaled only by his devotion to his family and his generosity to his beloved home town. Through the years, Taylor--whose charitable giving ranked him No. 11 on The Chronicle of Philanthropy's 2015 \"Philanthropy 50\" list of America's top donors--made many notable private contributions to several of St. Louis's leading civic and cultural not-for-profit institutions, notably the St. Louis Public Schools Foundation, the Saint Louis Symphony Orchestra, the Missouri Botanical Garden, Forest Park Forever and the Donald Danforth Plant Science Center. Other local beneficiaries of his family's and his company's generosity have included St. Louis Children's Hospital, the Urban League of Metropolitan St. Louis, the St. Louis Zoo, the St. Louis Art Museum, the St. Louis Science Center, Harris-Stowe State University, Saint Louis University, the University of Missouri-St. Louis, Our Little Haven and Cardinal Glennon Children's Hospital. In his integrity, optimism and spirit of service, Jack Taylor was a shining example of the \"Greatest Generation.\" With his passing, St. Louis has lost one of its greatest friends and benefactors. Funeral service private. The family requests that donations be made to the Donald Danforth Plant Science Center, 975 N. Warson Road, St. Louis, MO 63132; Forest Park Forever, 5595 Grand Drive, St. Louis, MO 63103; or the St. Louis Symphony Orchestra, 718 North Grand Blvd., St. Louis, MO, 63103. Condolences may be sent via email to taylorfamily@ehi.com. 1/3", "pub_date": "2016-07-06T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  TAYLOR, JACK CRAWFORD"}, "snippet": "TAYLOR--Jack Crawford, of St. Louis, Missouri, died July 2, 2016, at the age of 94. Beloved father of Andrew C. (Barbara) Taylor and Jo Ann Taylor Kindle (Tom Caruso); devoted grandfather of Alison Kindle (Kyle) Hogan, Carolyn Kindle (Adam) Betz, ...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9901E1DB113AF935A35754C0A9609D8B63", "keywords": [{"value": "TAYLOR, JACK CRAWFORD", "name": "persons"}], "blog": [], "_id": "5787012438f0d80e646b3aef", "source": "The New York Times"}