{"news_desk": "Classified", "print_page": "18", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "235", "lead_paragraph": "WIESEL--Eliezer (Elie), Mutual of America and its Board of Directors, together with its officers and employees, mourn the passing of Elie Wiesel, who was an esteemed member of the Board of Directors for more than twenty-five years. Elie Wiesel served on numerous Board committees and was one of the founding members of the Mutual of America Community Partnership Award Selection Committee. His many years of dedicated service were distinguished by his wise counsel and exceptional insights. Highly respected as a writer, teacher, philosopher and scholar, Elie Wiesel was an extraordinary, kind man, whose devotion to championing human rights was exemplary. He was fiercely committed to fighting indifference and served as a constant conscience, reminding us all of our moral responsibilities to one another. Elie Wiesel's wisdom, experience and commitment to personal and professional excellence and accountability profoundly touched and influenced many lives all over the world. Elie Wiesel was a friend to each of us. We who were privileged to have known him will gratefully remember his eloquence, strength of character and high ethical standards. His warmth and friendship will be deeply missed. While we mourn his passing, we greatly admire the manner in which he lived his life. Elie Wiesel, our friend and colleague, will be remembered with profound respect and affection. Thomas J. Moran, Chairman of the Board John R. Greed, President and Chief Executive Officer Mutual of America Life Insurance Company 1/3", "pub_date": "2016-07-06T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  WIESEL, ELIEZER (ELIE)"}, "snippet": "WIESEL--Eliezer (Elie), Mutual of America and its Board of Directors, together with its officers and employees, mourn the passing of Elie Wiesel, who was an esteemed member of the Board of Directors for more than twenty-five years. Elie Wiesel ser...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9F04E0DB113AF935A35754C0A9609D8B63", "keywords": [{"value": "WIESEL, ELIEZER", "name": "persons"}], "blog": [], "_id": "5787012138f0d80e646b3aee", "source": "The New York Times"}