{"news_desk": "Classified", "print_page": "18", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "260", "lead_paragraph": "HOULIHAN--Kathrene \"Kate\" (nee Blish), of Chicago, IL; New Rochelle, Crestwood, and Bronxville, NY died July 2 at home surrounded by family. She was 96. She and Dan, her husband of 53 years raised nine children in love and faith: Kathie (Jim), Rita, Dorothy (Marcel), Daniel (Marie), Joe (Anna), Mark (Amy), Barbara (Bill), Gerry (Maureen) and Liz (Ralph). A graduate of Maplehurst Convent of the Sacred Heart (1937) and Manhattanville College (1941), she served on the board of the Convent of the Sacred Heart, Greenwich. Her faith and intellectual curiosity sparked many interests - American History, art, opera, embroidery, travel, baseball, and French cooking. Her legendary dinner parties were a key ingredient of Dan's and his partners' (James G. Houlihan and Howard Parnes) business, Houlihan-Parnes Realtors. Longtime parishioner of Annunciation Parish 1949-1999 (Crestwood, NY) she joined St. Joseph's in 1999. The Houlihans generously supported Catholic education. Kate is survived by 19 grandchildren, eight great-grandchildren, many nieces and nephews, her brother-in-law, Joe and his wife June (Northbrook, IL), five cousins, and her longtime nurse and friend Grace Sendras. Kate was predeceased by her husband, her brother (Syl) and sisters (Sally, Marie, Betsy) and sisters-in-law (Rita Anne, Janet). A woman of deep faith, Kate guided her family to \"always do something worthwhile\" and \"to be good to everybody.\" Calling Hours at Fred H. McGrath's, Bronxville, July 5, 6-9; July 6, 2-4 and 7-9. Mass of Christian Burial St. Joseph's Church, July 7, 9:45am. In lieu of flowers please contribute to Annunciation School, Crestwood, NY or The Pregnancy Care Center, New Rochelle, NY. 1/3", "pub_date": "2016-07-06T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  HOULIHAN, KATHRENE \"KATE\" (NEE BLISH)"}, "snippet": "HOULIHAN--Kathrene \"Kate\" (nee Blish), of Chicago, IL; New Rochelle, Crestwood, and Bronxville, NY died July 2 at home surrounded by family. She was 96. She and Dan, her husband of 53 years raised nine children in love and faith: Kathie (Jim), Rit...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9C05E2DB113AF935A35754C0A9609D8B63", "keywords": [{"value": "HOULIHAN, KATHRENE \"KATE\"", "name": "persons"}], "blog": [], "_id": "5787015d38f0d80e646b3b07", "source": "The New York Times"}