{"news_desk": "Classified", "print_page": "18", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "342", "lead_paragraph": "ROBBINS--Albert, editor, author, lawyer and lifelong advocate for civil liberties, died July 2, 2016 in New York after a fierce fight with lengthy illness. He was 67. Son of Leo and Sylvia Sabel Robbins, Albert earned a B.A. and M.A. in American history at Temple University in his native Philadelphia, where he was an editor for The Drummer, a counterculture weekly. He moved to New York as associate editor at Harper's Magazine Company. He then went on to become executive editor of the ACLU Civil Liberties Review, publications director of the Educational Fund for Individual Rights, and managing editor of the National Law Journal. A graduate of Fordham Law School, he joined the New York law firm of Cahill, Gordon, and Reindel, litigating First Amendment issues and the scientific aspects of early asbestos cases. He returned to the Law Journal as General Counsel and associate publisher/editor of Law Technology Product News, collaborating on the first systems to manage court documents on the Internet. A passionate force for workers' and immigrants' rights, Albert authored \"Coming to America, Immigrants From Northern Europe\" (Delacorte, 1981) and co-authored \"The Watergate File\" (Flash Books, 1973); \"Getting Angry Six Days a Week\" (Beacon, 1979) and \"Whistle-Blowing\" (McGraw-Hill, 1978). He was a member of the Lawyers Committee for Human Rights, represented individuals seeking asylum in the US, and was secretary of the Committee on Immigration Law of the Association of the Bar of the City of New York. In his retirement, he pursued his passion for collecting by selling rare books. Friends and loved ones will remember Albert for his encyclopedic intellect, sharp sense of humor, and appreciation for 1940s music. He is survived by his beloved partner, U.S. Bankruptcy Judge Nancy Hershey Lord; his cherished children Laura Robbins, Charlie Robbins, and Alix Comeau; his treasured granddaughter Natalie Robbins; and two brothers. His dear wife, Amy Comeau, predeceased him. Services Wednesday, July 6 at 10:30am at Riverside Memorial Chapel, 180 W. 76th St. Burial at Beth David Cemetery, Elmont, NY. Donations: the Perlmutter Cancer Center or the ACLU. 1/3", "pub_date": "2016-07-06T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  ROBBINS, ALBERT"}, "snippet": "ROBBINS--Albert, editor, author, lawyer and lifelong advocate for civil liberties, died July 2, 2016 in New York after a fierce fight with lengthy illness. He was 67. Son of Leo and Sylvia Sabel Robbins, Albert earned a B.A. and M.A. in American h...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A03E2DB113AF935A35754C0A9609D8B63", "keywords": [{"value": "ROBBINS, ALBERT", "name": "persons"}], "blog": [], "_id": "5787014b38f0d80e646b3afe", "source": "The New York Times"}