{"news_desk": "Classified", "print_page": "17", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "814", "lead_paragraph": "OLICK--Arthur, died on July 2 in Bethesda, Maryland of multiple sclerosis (M.S.). He was 85. He will be remembered as a loving husband, devoted father, grandfather, and brother, and an attorney with few equals. Rising from modest beginnings in the Bronx in New York City, he forged a legal career of unusual accomplishment that included study at Yale University (B.A. 1952; J.D. 1955), public service in the U.S. Army (1956-57) and the U.S. Attorney's office for the Southern District of New York (1962-68), and private practice at several Manhattan law firms, most notably Anderson, Kill & Olick from which he retired. Through the course of a wide-ranging career he represented both local municipalities and prominent cultural figures, became one of the nation's leading experts on insurance coverage litigation, and was known to many as a lawyer's lawyer, as evidenced by his representation of law firms in high-profile bankruptcy proceedings. Arthur Seymour Olick was born on June 15, 1931 to Anita Babsky and Jacob (Jack) Olick, both first generation Americans born in New York City. Jack was a technical writer who was also what is now called an \"early adopter\" of new technologies, thanks to which Arthur was one of only a handful of Americans who learned of the Japanese bombing of Pearl Harbor on December 7, 1941 via television. He graduated from Evander Childs High School at age 16 before going on to study political science at Yale where he graduated magna cum laude and was a member of Phi Beta Kappa. He also excelled at Yale Law School where he was a moot court champion. It was at Yale where Arthur met and, in 1954, married Selma Ada Kaufman of New Haven. They were married for 62 years, during which Selma was Art's constant companion, mother to the couple's two children, Robert (born 1957) and Karen (born 1961), and, in later years as his M.S. progressed, Art's caregiver and advocate. Upon relocating to New York following his Army service, Art entered private practice for several years before joining the U.S. Attorney's Office for the Southern District of New York under Robert Morgenthau, where he worked for six years (1962-68), the last three as Chief of the Civil Division. He returned to private practice as a partner at several law firms before joining the firm of Gene Anderson, his former colleague at the U.S. Attorney's Office. Together, Anderson, Olick, and other attorneys at the firm became nationally recognized for their innovative litigation strategies on behalf of insurance policyholders seeking coverage for personal injuries and other damages related to exposure to asbestos. He also served as managing partner of the firm, lectured frequently on trial practice, partnerships, product liability, and business bankruptcy, and represented Zsa Zsa Gabor, Peter Max, Don McLean, Meatloaf, and Gloria Swanson on various commercial matters. Throughout his years of private practice, however, Arthur was continually inspired by the call of public service. He was very active in civic affairs in Westchester County where the family lived for most of the 1960s, 70s, and 80s, serving as attorney for several local townships. It was in this capacity that he engaged in a series of court cases to deny tax-exempt status under state and local laws for Sun Myung Moon's Unification Church. In one case, Arthur won a court order to cross-examine Moon, leading the Unification Church to quickly settle. In addition, he served as president of the Greenburg Central Seven School District, leading the implementation of a controversial busing program in the 1970s. He and Selma were also founding members of Bet Am Shalom, a Reconstructionist temple in White Plains. The family built a weekend home in Putnam Valley where they spent many weekends with family and friends, and where, true to his deep sense of patriotism, Art raised and lowered the American flag on national holidays to recorded military music. In retirement, Art and Selma spent part of the year in Florida and as much time as possible every year enjoying theater, opera, and their grandchildren. Arthur was defined by a lifelong drive to learn, to lead, and to serve. He pursued great passions with great energy, led nearly every institution in which he served, set high standards and expectations for colleagues and his family members alike, and, by any measure, achieved the success associated with the American Dream in which he so fervently believed. Arthur is survived by his children Robert (Manlius, NY) and Karen (Washington, DC), her husband John Gibson, and five grandchildren, Joshua, Sarah, Rachel, Stephen, and Grant, and his brothers Phillip (New York City) and David (San Francisco). His wife Selma preceded him in death earlier this year. Services Thursday, July 7th, at 11am at Riverside Chapel, Manhattan. Family will be receiving at the Yale Club at 50 Vanderbilt Avenue on Thursday from 5-8pm. Donations may be made in Arthur's name to the Multiple Sclerosis Society. 1/3", "pub_date": "2016-07-05T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  OLICK, ARTHUR"}, "snippet": "OLICK--Arthur, died on July 2 in Bethesda, Maryland of multiple sclerosis (M.S.). He was 85. He will be remembered as a loving husband, devoted father, grandfather, and brother, and an attorney with few equals. Rising from modest beginnings in the...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E04E0DC113AF936A35754C0A9609D8B63", "keywords": [{"value": "OLICK, ARTHUR", "name": "persons"}], "blog": [], "_id": "5785af2038f0d804dfd9ba3f", "source": "The New York Times"}