{"news_desk": "Classified", "print_page": "22", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "300", "lead_paragraph": "DRURY-JOHNSON--Susan. March 11, 1955 - July 10, 2016. Susan Drury-Johnson, 61, of Mamaroneck, NY, died at 1:15am Sunday, July 10, 2016 in the presence of her husband and three sons. She had been under palliative care for lung cancer. Susan was born March 11, 1955 in East Orange, NJ to Bob and Sylvia Drury. She is survived by her husband, David, of 29 years and her three boys--Christopher, Nicholas, and Dylan, as well as her three siblings, Robert, Ellen, and David. Susan and her family had been residents of Mamaroneck for 25 years. Susan graduated from Fairleigh Dickinson College and had a long, successful career on Madison Avenue. Susan was considered one of the pioneers of the digital age, introducing that process into the advertising community. She was often asked to address women's groups on the subject of being a successful female executive. Above all else, Susan was loving, caring, and selfless. She was the determined mother of three boys who she put before all else and who in turn wanted nothing more but to make her proud. She was a pillar of the community; she took active roles in the school system, church, and served as a counselor and role model for countless individuals who looked to her for wisdom and guidance. She will be long remembered for her leadership and contributions to her fellow friends of Bill. Susan was an avid reader. She cherished the beach, and enjoyed exercising. Susan loved the arts-- specifically music, movies, and theatre. Susan would want noted her special relationship with the Johnson family dog, Leo. A Memorial service will be held on July 23 at 11:00am, Rye Presbyterian Church, 882 Boston Post Road, Rye, New York 10580. Contributions as a memorial may be made to the American Cancer Society at donate.cancer.org. 1/3", "pub_date": "2016-07-14T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  DRURY, JOHNSON, SUSAN"}, "snippet": "DRURY-JOHNSON--Susan. March 11, 1955 - July 10, 2016. Susan Drury-Johnson, 61, of Mamaroneck, NY, died at 1:15am Sunday, July 10, 2016 in the presence of her husband and three sons. She had been under palliative care for lung cancer. Susan was bor...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9F02EFD8113AF937A25754C0A9609D8B63", "keywords": [{"value": "DRURY, JOHNSON, SUSAN", "name": "persons"}], "blog": [], "_id": "57918caf38f0d87a83eba85b", "source": "The New York Times"}