{"news_desk": "Classified", "print_page": "20", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "265", "lead_paragraph": "SAXE--Robert L. Scientist and businessman Bob Saxe was considered to be the father of the smart window industry. He passed away at age 81 on June 29, 2016, and is survived by his brother Stephen O. Saxe. Bob was married for 34 years to Marie Posner Saxe, an apparel industry executive who passed away in 2008. Robert Saxe started Research Frontiers Inc. over 50 years ago, and is the principal inventor on many of its patents. Under his leadership, the company achieved world-wide recognition as the premier developer of SPD-Smart light control technology currently licensed to over 40 companies, including most of the world's automotive glass producers. It is used in automobiles, aircraft, yachts, homes and offices, and museums, and was prominently featured at the most recent World's Fair in Milan. At the time of his death, Mr. Saxe was Research Frontiers' Chairman of the Board and Chief Technology Officer Mr. Saxe's published work on the nature of light allows scientists to derive several key fundamental constants used by physicists. He graduated from Harvard College in 1956 with an A.B. degree, Cum Laude in General Studies (with a major in physics) and received an M.B.A. degree from Harvard Business School in 1960. His technology makes cars, homes, offices, and aircraft more energy efficient, comfortable, and safer. Bob Saxe took great pride in the benefits that his SPD-SmartGlass technology brought to many industries, and the way it improved people's lives. A Memorial Service will be held at the Frank E. Campbell Funeral Chapel at 1076 Madison Avenue in Manhattan on July 13, 2016 at 6:00pm. 1/3", "pub_date": "2016-07-10T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  SAXE, ROBERT L"}, "snippet": "SAXE--Robert L. Scientist and businessman Bob Saxe was considered to be the father of the smart window industry. He passed away at age 81 on June 29, 2016, and is survived by his brother Stephen O. Saxe. Bob was married for 34 years to Marie Posne...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9905EFD9113AF933A25754C0A9609D8B63", "keywords": [{"value": "SAXE, ROBERT L", "name": "persons"}], "blog": [], "_id": "578c473638f0d83596d54811", "source": "The New York Times"}