{"news_desk": "Classified", "print_page": "20", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "478", "lead_paragraph": "BERNSTEIN--Alison R.,graduated from Vassar College summa cum laude with a B.A. in history in 1969. She was named to the Board of Trustees at age 22, the youngest person ever to hold that position. The then President Simpson noted on her appointment: \"If anyone can mediate between hairy youth and hoary age, it is Alison Bernstein.\" Following Vassar, Alison entered a Ph.D. program in history at Columbia University. In 1974, while working on her dissertation on federal policy and Native Americans, Alison took a position with the Fund for the Improvement of Post-Secondary Education [FIPSE] in the US Department of Education. This launched her into a career in education and educational policy. In 1983, Alison joined the Ford Foundation, first as program officer and later as Vice President for Knowledge, Creativity and Freedom. At Ford, Alison became a leader in higher education and a voice for justice across the globe. She was the architect of countless initiatives that promoted a higher quality of education for diverse and marginalized populations. Alison was a vibrant presence; fostering the talents of others and encouraging bold programming pursuits and innovative thinking. Over the course of her life, Alison wrote and co-wrote five books on topics ranging from difference and diversity in South Africa and the United States to the role of philanthropy in higher education. In 2011, after a year at Spelman College, Alison became Director of the Rutgers' Institute for Women's Leadership where she focused particularly on Women and Health and Women, Media and Technology. Alison spent the last years of her life spearheading a campaign to endow the Gloria Steinem Chair in Media, Culture and Feminist Studies. Alison had a recognized jaunty and ebullient style; in moments of passionate conviction, she would wave her eyeglasses, usually perched atop her head. She adored her twins, Emma and Julia and instilled in them both her social justice values and also her unflagging love of life. Alison knew how to throw a party and organized her friends to travel with her. She cultivated a wide range of interests, from musical theater and romantic comedies to book clubs and bird watching. Alison was curious, perceptive and ferociously intelligent, adding a zest for life to every group she joined. She died on June 30th of cancer in her home surrounded by the love of her dog, friends, partner, and daughters. She is survived by her daughters Emma Brown-Bernstein, a public defender in Atlanta and Julia Brown-Bernstein, a public school history teacher in Los Angeles, and her partner Professor Johanna Schoen of Rutgers University. Anyone wishing to make a charitable gift in her honor should give to the Gloria Steinem Endowed Chair at Rutgers University. Checks should be made out to Rutgers University Foundation, noting the gift is for the Gloria Steinem Endowed Chair, c/o Lisa Hetfield, IWL, 162 Ryders Lane, New Brunswick NJ, 08901. 1/3", "pub_date": "2016-07-10T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  BERNSTEIN, ALISON R."}, "snippet": "BERNSTEIN--Alison R.,graduated from Vassar College summa cum laude with a B.A. in history in 1969. She was named to the Board of Trustees at age 22, the youngest person ever to hold that position. The then President Simpson noted on her appointmen...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E05E2D9113AF933A25754C0A9609D8B63", "keywords": [{"value": "BERNSTEIN, ALISON R.", "name": "persons"}], "blog": [], "_id": "578c472438f0d83596d5480d", "source": "The New York Times"}