{"news_desk": "Classified", "print_page": "20", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "372", "lead_paragraph": "TONER--Tom, Tom died one year ago at age 87 from complications of lung cancer. His road to Broadway began in the theater of the Carnegie Library, Homestead, PA, where, from the wings, Tom watched his big sister Vernie perform. As part of the \"Greenfield Gang\" at Central Catholic High School in Pittsburgh, Tom acted, put on shows, and made lifelong friends. He worked ore boats on the Great Lakes, served in Japan with the US Army, graduated from UCLA, and launched his professional acting career. Swept into the growing regional theater movement, Tom performed all over the country, and was a long time company member at the Alley Theater, Arena Stage and Old Globe. Even as a young actor, his strong talent, plus expertise at make up and wigs brought Tom plum character roles. His special treat was playing the maid or maiden aunt, then thrilling audiences with his curtain call \"reveal.\" Tom moved to New York, performed in plays on and off Broadway (notably, A Texas Trilogy, The Good Doctor, The Elephant Man), appeared in film (including multiple Coen Brothers movies) and TV. Then, to his great delight, found himself reborn in middle-age as a \"Song and Dance Man!,\" continuing his career in Broadway musicals, including The Secret Garden, Me and My Girl, and Ragtime. Tom was known for his ability to bring acting companies together, but as a consummate storyteller, he sometimes caused fellow actors to linger too long, and race from the Green Room, barely making their entrance. He loved walking to work from his Manhattan Plaza home, or watching the glow of Times Square and Broadway from the \"tropical retreat\" of his balcony. If \"all the world's a stage,\" Tom designed the set for his own world, magically magnifying his tiny apartment to suit his vision. The fifth of nine children, Tom grew up in a rambunctious, joy-filled, Irish family. His eccentric, free spirit will be forever celebrated by his remaining siblings, Betty Jean, Mary Alice, and Bob, dozens of loving nieces and nephews, his cherished confidants, friends and colleagues. His ashes are at St Mary's Cemetery, Munhall, PA, with Mother and Pop, and part of the sidewalk sparkle at 42nd Street. Please share stories at Legacy.com. 1/3", "pub_date": "2016-07-10T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  TONER, TOM"}, "snippet": "TONER--Tom, Tom died one year ago at age 87 from complications of lung cancer. His road to Broadway began in the theater of the Carnegie Library, Homestead, PA, where, from the wings, Tom watched his big sister Vernie perform. As part of the \"Gree...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E02EFD9113AF933A25754C0A9609D8B63", "keywords": [{"value": "TONER, TOM", "name": "persons"}], "blog": [], "_id": "578c475138f0d83596d54813", "source": "The New York Times"}