{"news_desk": "Classified", "print_page": "20", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "257", "lead_paragraph": "CHANLER--Harvey, a fine graphic artist and basketball standout at Forest Hills High School, passed away on Friday, July 1, in New Canaan, CT. He was 87. Harvey was born in New York City, a few months before the start of the Great Depression, to immigrant parents who fled eastern Europe for the United States. At Forest Hills, he competed for the league's scoring championship with Hall of Famer, Bob Cousy. He pursued his creative talents and enrolled at Pratt Institute in Brooklyn. Harvey worked in advertising for some of the country's largest consumer companies such as Swingline Stapler and English Leather. At MEM Co, he served as Senior Vice President for Advertising. His creative mind led to numerous inventions such as soap on a rope, stories told on bubble bath paper washcloths and dramatic recordings of Bible Stories. Mr. Chanler also helped start the first international facsimile service in the 1970s. Harvey maintained a great sense of humor throughout his life. He enjoyed performing card tricks and became known as The Wizard for one of his most memorable tricks. Harvey is survived by his children, Ann of New York, NY, Bill of Atlanta, GA and Cliff of New Canaan, CT, their mother, Carole Chanler, and six beautiful grandchildren, Alex and Kaya (Scheman), Casey, Liliana, Cole and Catalina. He is also survived by three nieces, Patricia Doniger, Beryl Title and Polly Feiner, daughters of recording artist Arlene Title, his only sibling, and his beloved cousin Fred Wendrow. Contributions can be made to the Parkinson's Disease Foundation pdf.org. 1/3", "pub_date": "2016-07-10T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  CHANLER, HARVEY"}, "snippet": "CHANLER--Harvey, a fine graphic artist and basketball standout at Forest Hills High School, passed away on Friday, July 1, in New Canaan, CT. He was 87. Harvey was born in New York City, a few months before the start of the Great Depression, to im...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A01E2D9113AF933A25754C0A9609D8B63", "keywords": [{"value": "CHANLER, HARVEY", "name": "persons"}], "blog": [], "_id": "578c47da38f0d83596d54833", "source": "The New York Times"}