{"news_desk": "Classified", "print_page": "20", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "495", "lead_paragraph": "WARWICK--John Petersen, passed away of natural causes on June 26th, 2016 at the age of 90. John was a devoted and loving husband of 53 years to his wife, Janet, and a dedicated father to Brian of Larchmont, NY and to Jennifer of Shelburne, VT. John was always present for his family and devoted his heart and soul to ensure his 'family first' commitment. John served as a mentor to his grandchildren, nieces, nephews, cousins, friends and business associates offering sound advice and extraordinary generosity. This was the essence of his spirit. Born in New Rochelle, NY, John served three years in the US Navy during World War II. He graduated from Dartmouth College in 1948. A New York City resident, John spent most of his professional career in New York's advertising business from the 1960's - 1980's. John dedicated 42 years of his life building one of New York's most prominent advertising agencies that was originally started under the name, Warwick & Legler in 1939. The name was later changed to Warwick Advertising, and finally, Warwick, Baker, O'Neill. John served as Chairman and CEO for 33 years and retired in 1991. With over 250 employees at their height in their New York City office, and 75 in their European offices, Warwick became an internationally recognized agency with offices in Paris, London, Frankfurt & Brussels. \"Warwick Advertising\" as it was commonly known, was considered a creative pioneer and, under John's stewardship, was responsible for many highly successful and noteworthy advertising campaigns. Some of the agency's clients included, Timex, Seagram's, Revlon, Pfizer, Mennen, Bausch & Lomb, Benjamin Moore, US Tobacco, Fruit of the Loom, Burlington Industries, Schering-Plough, Air Canada, Schaefer, Heineken and Amstel Light beers, Empire Blue Cross/Blue Shield, and Sterling Drug. Warwick Advertising was a member of the Alliance International partnership of independent agencies that serviced clients with international needs. John also believed strongly in using the agency's talents to engage in Pro Bono and public service work. The Joseph E. Seagram & Sons company entrusted Warwick with some of their most prized brands such as 7 Crown, VO, Extra Dry Gin, Crown Royal Whisky and others for over 46 years. Warwick Advertising also enjoyed a multi-decade relationship with United States Tobacco. John served on the Board of AAAA; \"Association of American Advertising Agencies\" for two terms. His main interests included golf and American History. John is survived by his wife Janet, his children; Brian and Jennifer, his grandchildren Julia, Eric, Sydney and Kathryn; his sister Mary Lou Eaton, his first cousin Douglas Warwick and several nieces and nephews. In 1990, John was afflicted with a rare form of Peripheral Neuropathy. He became one of the founders of the \"Neuropathy Association\" based in New York City in efforts to understand and research this condition and achieve greater public and professional awareness which later merged with The Foundation for Peripheral Neuropathy. In memory of John, donations are welcome at The Foundation for Peripheral Neuropathy. www.foundationforpn.org. 1/3", "pub_date": "2016-07-10T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  WARWICK, JOHN PETERSEN"}, "snippet": "WARWICK--John Petersen, passed away of natural causes on June 26th, 2016 at the age of 90. John was a devoted and loving husband of 53 years to his wife, Janet, and a dedicated father to Brian of Larchmont, NY and to Jennifer of Shelburne, VT. Joh...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9F0DEFD9113AF933A25754C0A9609D8B63", "keywords": [{"value": "WARWICK, JOHN PETERSEN", "name": "persons"}], "blog": [], "_id": "578c479938f0d83596d54825", "source": "The New York Times"}