{"news_desk": "Classified", "print_page": "20", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "223", "lead_paragraph": "GRAYSON--Richard M. March 25, 1941 - July 3, 2016. Richard Grayson was a pianist, composer, teacher and improviser extraordinaire. Yamaha and the Showa Conservatory of music repeatedly invited him to Japan, where he gave lectures, concerts, and seminars on classical and jazz improvisation. His last concert was at Los Angeles County Museum of Art in May of this year. He passed away after a long illness. He was born in Brooklyn, New York, grew up in North Hollywood, CA, and graduated from Van Nuys High School. He earned a Bachelor of Arts from UCLA, Master of Arts from Chicago University, and his Ph.D. in composition from UCLA. He was a professor of music at Occidental College, until his retirement in 2000. He was then invited to teach music theory and composition at Crossroads School in Santa Monica, where he remained until June of this year. He lived in Santa Monica for over 40 years with his wife of 46 years, Dr. Susan Grayson. He was highly respected and liked by his colleagues, and his students adored and challenged him, to their mutual delight. He leaves behind his beloved wife, Dr. Susan Grayson; sister, Florence Ginsburg; brother, Robert Grayson; nephew, Bret Ginsburg; loving cousins, extended family and friends. The date for a memorial gathering to honor Dr. Grayson is yet to be determined. 1/3", "pub_date": "2016-07-10T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  GRAYSON, RICHARD M"}, "snippet": "GRAYSON--Richard M. March 25, 1941 - July 3, 2016. Richard Grayson was a pianist, composer, teacher and improviser extraordinaire. Yamaha and the Showa Conservatory of music repeatedly invited him to Japan, where he gave lectures, concerts, and se...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9804E1D9113AF933A25754C0A9609D8B63", "keywords": [{"value": "GRAYSON, RICHARD M", "name": "persons"}], "blog": [], "_id": "578c47d338f0d83596d54831", "source": "The New York Times"}