{"news_desk": "Classified", "print_page": "20", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "568", "lead_paragraph": "SERGI--Frances B. After a long, joyful and distinguished life, Frances Barbieri Sergi passed away on June 26, 2016. She was born July 31, 1919 in New York City to Theresa LaGumina Barbieri and Frank Barbieri, both of whom were born in Italy. Frances was raised in Queens, New York and was an honors graduate of Richmond Hill High School, Hunter College and New York University. She played a piano recital at Carnegie Hall in 1933, worked at the 1939 World's Fair and helped ship tanks from New York to Europe during WW II. Frances was predeceased by her parents, her beloved sister Eleanor, and her loving husband of 55 years, Rocco J. Sergi. She leaves her two devoted sons and their spouses, Vincent A.F. Sergi and Debbie (Chicago), Theodore S. Sergi and Barbara (West Hartford, CT), four treasured grandsons: Nicholas and spouse Jennifer Mabary (San Antonio), Gregory (Los Angeles), Justin (New York City) and Julian (Hollywood) and one very wonderful great-granddaughter, Carolyn Marcella Sergi (San Antonio). Frances was one of the greatest school teachers of modern history; elected as the first recipient of the Kew Forest School Hall of Fame in 2004 after 40+ years of teaching fourth grade. Her teaching of reading, writing, math, the multiplication tables, nature (bird projects), the arts, and thesis-like projects for 10-year-olds is legendary. She has been described by her former students as \"stern but loving, tough but fair, demanding but praising\" with a \"no-nonsense classroom atmosphere that demanded that one must respect all others.\" Her philosophy was always one of \"You can do it.\" The Sergi family would like all her former students to know that she was as great a mom and grandma as she was a teacher. At age 81 she retired from teaching and joined the Kew Forest School Development Office, working until age 88 cajoling her former pupils into making contributions. Frances loved music of all kinds: classical, opera, Frank Sinatra and The Mills Brothers. She was passionate about musical theater and made costumes for school play productions for decades. She loved history and her visits with Rocco to America's great historical sites. And she was proud of her hometown of New York City, its excitement and its international sounds and flavors. She also believed in the curative powers of witch hazel. Frances made a lasting impression on everyone she met, making everyone around her feel included and happy. Frances was devoted to the Church of the Resurrection, Richmond Hill and St. Luke's Church, Forest Hills, and served both in many capacities. Frances was very thankful to the devoted staff of The McAuley and St. Mary Home, West Hartford, CT. where she spent the last eight good years of her 97. Her last five years were especially joyful thanks to her faithful assistants Carmen Baig, Raenette Bowens and Ruth Daley. Mom, we are doing our best in your absence. We will remember to throw cold water on our faces and get back to working hard and helping others, just like you did. Ci vediamo, Nonna. A celebration of Frances' life will be held in Forest Hills and Richmond Hill, NY in October. Memorial contributions may be made to the Kew Forest School, 119-17 Union Turnpike, Forest Hills, NY 11375. Condolences may be sent to The Sergi family at 11 Castlewood Rd., West Hartford, CT 06107. Taylor & Modeen Funeral Home, West Hartford has care of services. 1/3", "pub_date": "2016-07-10T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  SERGI, FRANCES B"}, "snippet": "SERGI--Frances B. After a long, joyful and distinguished life, Frances Barbieri Sergi passed away on June 26, 2016. She was born July 31, 1919 in New York City to Theresa LaGumina Barbieri and Frank Barbieri, both of whom were born in Italy. Franc...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9C00EFD9113AF933A25754C0A9609D8B63", "keywords": [{"value": "SERGI, FRANCES B", "name": "persons"}], "blog": [], "_id": "578c47cd38f0d83596d54830", "source": "The New York Times"}