{"news_desk": "Classified", "print_page": "20", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "303", "lead_paragraph": "KUCKENS--John H.,Jr. (Jack), of Sarasota, Florida, formerly of Rockville Centre and East Rockaway, NY, died on June 28, 2016 at home surrounded by his loving family. Jack was predeceased by his wife of 67 years, Loreen E. Kuckens. He is survived by his four children Candace DiPietro (Robert), John H. Kuckens III (Katherine), Craig A. Kuckens (Patricia), Karen Gogarty, eight grandchildren and two great-grandchildren. Jack attended Long Island's Lynbrook High School followed by one year at Cortland State Teacher's College prior to joining the army in 1943. He advanced to Second Lieutenant in the Third Division Army Infantry after Officer's Training, was stationed in the European Theatre. Jack was awarded the Bronze Star for valor in 1945 after leading his company in the capture of hundreds of German soldiers. After marrying Loreen in August 1946, Jack resumed his college career at Hofstra University, graduating with a B.S. in Accounting. He joined Price Waterhouse & Co., in 1949 as a junior auditor and rose through the ranks of the firm, eventually becoming a partner in 1968. As head of Personnel for the New York office, Jack, a CPA, identified and mentored many accounting professionals, recruited at various colleges and helped shape the organization's policies during a period of great change. Jack and Loreen were members of Bethany Congregational Church of East Rockaway, Long Island and The First Congregational Church of Sarasota. As an avid golfer, Jack was a member of the Rockville Links Country Club of Long Island, the Mountain Manor Golf Association in the Poconos, Florida's Sara Bay Country Club and the Bird Key Yacht Club. Jack received the George M. Eastabrook Award for Distinguished Service in 1977 from Hofstra's Alumni Association. Jack can be best remembered by making a donation to the Veterans of Foreign Wars or the Multiple Sclerosis Society. 1/3", "pub_date": "2016-07-10T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  KUCKENS, JOHN H."}, "snippet": "KUCKENS--John H.,Jr. (Jack), of Sarasota, Florida, formerly of Rockville Centre and East Rockaway, NY, died on June 28, 2016 at home surrounded by his loving family. Jack was predeceased by his wife of 67 years, Loreen E. Kuckens. He is survived b...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9400E1D9113AF933A25754C0A9609D8B63", "keywords": [{"value": "KUCKENS, JOHN H.", "name": "persons"}], "blog": [], "_id": "578c476338f0d83596d54816", "source": "The New York Times"}