{"news_desk": "Classified", "print_page": "20", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "169", "lead_paragraph": "LOOMIS--William Farnsworth, 1940-2016, was born in Boston, MA. Son of Violet Amory and William Farnsworth Loomis, Sr. He was educated at Le Rosey, Phillips Exeter Academy and he a bachelor's degree from Harvard and a Ph.D. from the Massachusetts Institute of Technology. Bill then joined the UC San Diego faculty in 1966 and became Distinguished Professor Emeritus. He was a passionate and erudite scientist, his enthusiasm and love of knowledge were infectious and his devotion to rigorous biological research and education was unwavering. Bill passed away in his lab working on his latest scientific endeavor. Bill was a beloved husband, father, and grandfather. He loved to paint, write, garden and travel. He had just returned from a three week European vacation with his entire family. His light, passion, humor and kindness will be greatly missed by all. He is survived by his wife, Maria Margarita Behrens, siblings, Tom La Farge and Jacqueline Quillen, Daughters Catherine Loomis Healy, Emily Loomis Murphey and Carolina Arahuetes and his six beloved grandchildren. 1/3", "pub_date": "2016-07-10T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  LOOMIS, WILLIAM FARNSWORTH"}, "snippet": "LOOMIS--William Farnsworth, 1940-2016, was born in Boston, MA. Son of Violet Amory and William Farnsworth Loomis, Sr. He was educated at Le Rosey, Phillips Exeter Academy and he a bachelor's degree from Harvard and a Ph.D. from the Massachusetts I...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E0CE1D9113AF933A25754C0A9609D8B63", "keywords": [{"value": "LOOMIS, WILLIAM FARNSWORTH", "name": "persons"}], "blog": [], "_id": "578c478d38f0d83596d54821", "source": "The New York Times"}