{"news_desk": "Classified", "print_page": "20", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "442", "lead_paragraph": "WILSON--Philip D.,Jr., M.D., died peacefully at home on June 29, 2016. He was 96. A man of unbounded wit and charm, Dr. Wilson possessed a warmth of character and caring for others that deeply endeared him to patients, colleagues, friends and family alike. Dr. Wilson was born in 1920 in Boston. His father was a prominent surgeon, his mother a native of France and the daughter of well-known French actress and comedienne, Rejane. His parents met in Paris during World War I. The second of three, Philip and his siblings often travelled to France with their mother on summer holiday. A graduate of the Kent School, \"Ox\" Wilson rowed on the varsity heavyweight crew that won the Thames Challenge Cup at Henley in 1938. Dr. Wilson's collegiate career started as a member of the Harvard class of 1942, but the onset of the Second World War led him to an accelerated MD program at Columbia. Although he will no longer take his daily walk in Central Park, Dr. Wilson is responsible for thousands who still can. He was a pivotal figure in the development and improvement of total hip replacement in the United States. Under his stewardship as Surgeon in Chief from 1972 to 1989, the Hospital For Special Surgery attained international prominence as a leading center of orthopedic care, research and clinical training. In an era when medical practice grew increasingly fast-paced, Dr. Wilson is universally lauded for maintaining a primary emphasis on the personal and human side of patient care. Leisure time often found him on the tennis court or golf course with his beloved late wife of 42 years, Katherine S. Wilson, who died in 2005. Nowhere were his recreational talents more readily apparent, however, than on the water, where the love of sailing he discovered cruising the coast of New England in his youth continued into his last years. Dr. Wilson will long be remembered for his immense love of family, his compassion, intelligence, wisdom, unassuming charm and limitless generosity. He is survived by two daughters, Lucy Watson, Elizabeth Watson and her husband Marc Sydorak, and two sons, David and his wife Janet, and Patrick and his wife Nina. He was preceded in death by his daughter Nicole Beebe and son William Watson. Philip leaves nine grandchildren, Mercy Watson, Brooke Noble, Peter Beebe, Erica and Matthew Wilson, and Gardner, Katherine, Harrison and Leverett Wilson; and two great-grandchildren Callie and Taylor Noble. A celebration of his life will be held in New York City this autumn. In lieu of flowers, contributions may be sent to the Hospital for Special Surgery, 535 East 70th St., New York, NY 10021. 1/3", "pub_date": "2016-07-10T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  WILSON, PHILIP D."}, "snippet": "WILSON--Philip D.,Jr., M.D., died peacefully at home on June 29, 2016. He was 96. A man of unbounded wit and charm, Dr. Wilson possessed a warmth of character and caring for others that deeply endeared him to patients, colleagues, friends and fami...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9C01EED9113AF933A25754C0A9609D8B63", "keywords": [{"value": "WILSON, PHILIP D.", "name": "persons"}], "blog": [], "_id": "578c47eb38f0d83596d5483a", "source": "The New York Times"}