{"news_desk": "Classified", "print_page": "15", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "341", "lead_paragraph": "BRADEMAS--John, husband of Dr. Mary Ellen Brademas, passed away following a long illness on July 11, 2016 at the age of 89. They were married in 1977 when he was a Member of Congress and she was a medical student at Georgetown University. John Brademas was a visionary leader in Congress and in higher education. A graduate of Harvard, he went on to earn a Doctorate at Oxford as a Rhodes Scholar. He represented Indiana's Third Congressional District in the U.S. House of Representatives from 1959-81, the last four years serving as Majority Whip. For over two decades on Capitol Hill, he became known as a champion of the arts, humanities, education, and services for children, elderly and disabled. In 1981, he became the 13th President of New York University, serving until 1992. As President, launching a $1 billion fundraising campaign, he led the transformation of NYU from regional commuter school to an internationally prestigious residential research university. Following his tenure as NYU President, he continued to be active in public life, dedicating himself to causes in the fields of democracy, peace building, fighting corruption and promoting arts and culture, including serving as Chairman of President Clinton's Committee on the Arts and the Humanities and founding at NYU two centers reflecting his lifelong interests: the King Juan Carlos I of Spain Center, supporting scholarship on modern Spain, and the John Brademas Center, focusing on Congress and public policy. He is also survived by his sister, Eleanor Brazeau; his stepchildren, Katherine Goldberg (Tom), Jane Murray, and John Briggs (Robin); his step-grandchildren, James (Alexis) and Briggs Goldberg, Cameron and John Murray, and Alexandra and Molly Briggs; and his step-great- grandson, Maxwell Jay Goldberg. Visitation will be held on Thursday 12-2pm and 5-7pm. Funeral Service will be on Friday at 9:30am at Frank E. Campbell \"The Funeral Chapel,\" 81st Street and Madison Avenue. In lieu of flowers, the Brademas family suggests contributions in John Brademas' honor be made to the NYU Brademas Center, 53 Washington Square S., Room 308, New York, NY 10012. 1/3", "pub_date": "2016-07-13T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  BRADEMAS, JOHN"}, "snippet": "BRADEMAS--John, husband of Dr. Mary Ellen Brademas, passed away following a long illness on July 11, 2016 at the age of 89. They were married in 1977 when he was a Member of Congress and she was a medical student at Georgetown University. John Bra...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9804E2D8113AF930A25754C0A9609D8B63", "keywords": [{"value": "BRADEMAS, JOHN", "name": "persons"}], "blog": [], "_id": "57903b7e38f0d85ae5114a5e", "source": "The New York Times"}