{"news_desk": "Classified", "print_page": "15", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "194", "lead_paragraph": "BROWN--Roscoe C.,Jr. The Community Service Society (CSS) and its President and CEO David R. Jones mourn the death of Roscoe C. Brown Jr., 94, a Tuskegee Airman in World War II, an educator, and mentor to a generation of African-American policy makers and civic leaders. Among his many achievements, he was the first U.S. pilot to shoot down a German fighter jet. A remarkable feat considering he did it from the cockpit of a propeller plane. At the time, the accepted view of blacks in the military was that they were not equally capable as their white counterparts. Brown, who received his doctoral degree from NYU, shattered that myth. Despite being subjected to vicious bigotry and racism, he went on to fly 68 combat missions, was heralded as a war hero along with his fellow Tuskegee Airmen and received the Distinguished Flying Cross, the Congressional Gold Medal and numerous other awards. Over his illustrious career in public service Brown worked tirelessly to address educational inequities and expand access to educational opportunities in New York's poor communities. With great sadness we mark his death, and extend our deepest sympathies to his family and friends. 1/3", "pub_date": "2016-07-13T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  BROWN, ROSCOE C."}, "snippet": "BROWN--Roscoe C.,Jr. The Community Service Society (CSS) and its President and CEO David R. Jones mourn the death of Roscoe C. Brown Jr., 94, a Tuskegee Airman in World War II, an educator, and mentor to a generation of African-American policy mak...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9400E2D8113AF930A25754C0A9609D8B63", "keywords": [{"value": "BROWN, ROSCOE C.", "name": "persons"}], "blog": [], "_id": "57903b5a38f0d85ae5114a5a", "source": "The New York Times"}