{"news_desk": "Classified", "print_page": "17", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "520", "lead_paragraph": "MARSHALL--Louis, age 93, died in his home in Houston, TX on July 5, 2016. He was born in Manhattan, NY November 22, 1922, the third child of Bessie and Max Marshall. He was raised in Brooklyn, NY. He completed his B.S. in Chemical Engineering at City College of New York in 1944 with highest honors. At CCNY he served as president of the student chapter of the American Institute of Chemical Engineers and as treasurer of the Tau Beta Pi chapter (the honorary fraternity for engineering). Lou had two extraordinary passions, engineering and family. Lou approached engineering with an abiding curiosity that drove him to unravel phenomena that many would not even notice. He had a methodical attention to detail - careful analysis of multiple possibilities - and a keen awareness of how a given plant design could go wrong. As a chemical engineer, he initially worked as a plant operator for Shell Oil, but moved to a position with Lummus Engineering in 1950 to focus on petrochemical plant design, his passion. He remained with Lummus for 35 years, where he became known as the \"Engineer's Engineer.\" His colleagues looked to Lou as a trouble shooter who could determine the source of problems and devise solutions. At his retirement dinner, a younger colleague said that he learned more about engineering from Lou Marshall than from his entire university training. Early on, Lou recognized the power of the digital computer to transform the practice of chemical engineering. He pioneered some of the first uses of linear programming to optimize petrochemical plant operation, and did initial work applying nonlinear programming to similar problems. After retiring from Lummus in 1986, he continued an extensive consulting practice applying linear optimization techniques to petrochemical plant operation. Lou's other great passion was his family. In 1945 he married his best friend and college sweetheart, Faith Gladstone. Their 71 years of marriage were an inspiration to all who knew them. In addition to being survived by Faith, Lou is also survived by their two children, Ellen Ruth Marshall, attorney in Orange County, CA (Robert Arnold, attorney), and David Aaron Marshall, economist in Chicago, IL (Maija Freimanis, physician) and their two grandchildren, Astrid Carla Marshall, medical student in Manhattan, NY (Jefferson Li, business student) and Max Benjamin Marshall, jazz pianist in New York. Lou served as a role model for his children and grandchildren, encouraging a passion for science and math, and conveying his deep love of music, photography, and woodworking. In a letter to his children on the occasion of his 90th birthday, he wrote, \"If Mom and I have been examples to you in the way we have lived our lives, then I am doubly satisfied.\" The family acknowledges with special gratitude the loving care provided by Catalina Alvarez in recent years. The funeral will be held Friday, July 8, 2016 at 11am at the Proler Family Chapel at Beth Israel Memorial Gardens Cemetery, 1101 Antoine, Houston, TX. The family requests that any remembrances be made as memorial contributions to Congregation Beth Israel, Houston, TX, or to an educational or charitable organization of your choice. 1/3", "pub_date": "2016-07-07T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  MARSHALL, LOUIS"}, "snippet": "MARSHALL--Louis, age 93, died in his home in Houston, TX on July 5, 2016. He was born in Manhattan, NY November 22, 1922, the third child of Bessie and Max Marshall. He was raised in Brooklyn, NY. He completed his B.S. in Chemical Engineering at C...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9B0CE5DA113AF934A35754C0A9609D8B63", "keywords": [{"value": "MARSHALL, LOUIS", "name": "persons"}], "blog": [], "_id": "578852c138f0d81aa65f6f0b", "source": "The New York Times"}