{"news_desk": "Classified", "print_page": "17", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "919", "lead_paragraph": "DUGGAL--Baldev. The Passing of a Visionary New York Businessman. Baldev Duggal (August 17, 1937 - June 29, 2016), a visionary entrepreneur, who over five decades built several iconic NYC businesses, including Duggal Visual Solutions and The Duggal Greenhouse, passed away peacefully in his sleep early last Wednesday morning, only days after an advance celebration of his upcoming 79th birthday with his family. Duggal was a proud New Yorker and a living manifestation of the American Dream. An immigrant, he came to the United States by himself from India in 1957 with only $200 in his pocket and managed to translate his last name into a global brand in the arts, graphics and media world. Made in India: In 1947, in Duggal's formative years, India won its independence. During the struggles that preceded independence, his father, Biasdev Duggal, an insurance manager, was imprisoned as a local leader for peaceful resistance to British rule. As a boy, Duggal learned a powerful lesson on the power of individuals to make change against the odds. The Land of Opportunity: Duggal arrived in New York Harbor in 1957, alone and with $200 in his pocket to start his new life. Coming from a then small village in India, far from being intimidated by the size and vibrancy of New York City he was energized by it. It began a lifetime love affair with the city he lived in until his death. He managed to get work in photo print shops and as a cameraman for famed NYC television correspondent Gabe Pressman. Whatever barriers existed for young 'third-world' immigrants in the 1950s, he simply couldn't afford to be hindered by them. It wasn't long before he started his own business, Duggal Color Projects. He was hand developing film in a bathtub in a basement apartment in the Riverdale section of the Bronx. Soon the legends like Marcel Duchamp, Bert Stern, and Richard Avedon were giving him jobs. His lab was the go-to place for artists in the 1960s. One of his favorite anecdotes of those days was when Andy Warhol's studio once offered to pay him in-kind with original paintings, but he declined as he needed the cash for his struggling small business. The new challenge for Duggal became how to scale his business. Hand-processing film was slow and tedious but was far superior to the automated processes of the day which yielded dull whites. He knew there could be something better and he invented a revolutionary process for film development, the \"dip-and-dunk\" machine, that combined the quality of hand processing with the efficiency and consistency of a mechanical process. This marriage of art and science would be something he would repeat and be known for throughout his life. Vision, Timing and Tenacity: By 1970, his business had grown so much he needed more space. Seeking lower real estate prices, he moved to a 12-story building in Chelsea that he later purchased, in an area that later became 'The Photo District', as other labs and camera shops opened around him to share in the market Duggal was building. At this point, Duggal Color Projects had already expanded into a comprehensive film processing, printing and finishing company that could handle a wide range of jobs for photographers, advertising firms, museums, and corporations. To stay on top, Duggal kept innovating and adding new services for his burgeoning clientele. In the 1980s Duggal saw the potential for Digital services to transform the industry, and he pioneered early electronic retouching services and became the first commercial lab to feature drum scanning technology. While that business took a long time to grow, his early investments gave him a head start and experience no one else had. In the last decades, while many others, including Kodak, failed to make the transition to Digital, Duggal was already an established industry leader with a litany of pioneering firsts. Along the way, Duggal had to ride out many economic downturns, 9/11 and Hurricane Sandy. Events that would take him and his Company to the brink, but he embodied the toughness New Yorkers are famous for and kept coming back stronger. Today Duggal Visual Solutions, Inc. employs over 350 dedicated employees and boasts over 250,000 square feet of production space in New York City. Green Fields: Never one to stand still, in his 70s, Duggal began to start other businesses. Notably 'The Duggal Greenhouse', formerly a dilapidated warehouse at the Brooklyn Navy Yard he had rehabilitated with an eco-friendly design, and transformed into the pre-eminent event space in New York. The huge, column free space with tremendous views of the New York City skyline has attracted the likes of Beyonce, Nike, Christian Dior and CNN, which recently hosted a Democratic Party Debate at the facility. Duggal's interest in Green Technology as both an opportunity and a way to make a positive impact led him to start Lumisolair. The Man: Baldev Duggal was an upbeat charismatic man, always scanning the horizon for what came next. He took on each day with boundless energy and an optimism, which challenged individuals and teams to achieve more than they believed possible. His dreams found their ideal home in New York City, a place that allowed him to experiment without restraint and bring together his love for art and science into a platform that fundamentally transformed how artists and marketers would communicate with the world. Baldev Duggal is survived by his three children Sue, Dave and Michael and eight grandchildren. He is also survived by his brother Sukhdev Duggal. 1/3", "pub_date": "2016-07-07T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  DUGGAL, BALDEV"}, "snippet": "DUGGAL--Baldev. The Passing of a Visionary New York Businessman. Baldev Duggal (August 17, 1937 - June 29, 2016), a visionary entrepreneur, who over five decades built several iconic NYC businesses, including Duggal Visual Solutions and The Duggal...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9802E6DA113AF934A35754C0A9609D8B63", "keywords": [{"value": "DUGGAL, BALDEV", "name": "persons"}], "blog": [], "_id": "578852a738f0d81aa65f6f04", "source": "The New York Times"}