{"news_desk": "Classified", "print_page": "20", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "317", "lead_paragraph": "ROSENFIELD--Herbert. Founding member of the BMCC Foundation Board of Directors Passes Away. Borough of Manhattan Community College/CUNY and the BMCC Foundation mourn the passing of our friend and longtime supporter Herbert Rosenfield, a founding member of the BMCC Foundation Board of Directors, on which he served for more than 30 years. Mr. Rosenfield, who passed away on Wednesday, July 20, 2016 at the age of 97, was a strong ally to the College. \"Sadly today we've lost a true hero of Downtown Manhattan and a friend that will be missed by many,\" said BMCC President Antonio Perez. \"Herb had a deep concern for those in need and a willingness to help make a difference in their futures.\" In the 1960s, the City of New York acquired 24 square blocks along West, Washington and Greenwich Streets. This area has since become, in large part, the Independence Plaza residential project and BMCC, whose 27,000-member student body has become a major force in Lower Manhattan. In addition, Public School 234 took up residence on Chambers and Greenwich Streets, while farther west on Chambers, an additional building for Stuyvesant High School was constructed. Mr. Rosenfield was serving as president of the Chambers Canal Civic Association during the 1980s when the city was looking to sell property in TriBeCa to encourage large-scale developments. The plan was protested by many, including Mr. Rosenfield, who spoke out as an ally in support of small businesses and neighborhood schools, including BMCC. In 1984, Mr. Rosenfield was presented with the BMCC Distinguished Service Award at BMCC's Commencement. The Abner B. Rosenfield Award Fund, which Mr. Rosenfield established to honor the memory of his father, has provided financial support and recognition to numerous BMCC students who exemplify academic excellence and participate in community service. We extend our condolences to Mr. Rosenfield's children Dr. Patricia L. Rosenfield, Thomas Priest Rosenfield and Nelson An-ping Chang and their families. 1/3", "pub_date": "2016-07-22T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  ROSENFIELD, HERBERT"}, "snippet": "ROSENFIELD--Herbert. Founding member of the BMCC Foundation Board of Directors Passes Away. Borough of Manhattan Community College/CUNY and the BMCC Foundation mourn the passing of our friend and longtime supporter Herbert Rosenfield, a founding m...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9C05EFDF1E3AF931A15754C0A9609D8B63", "keywords": [{"value": "ROSENFIELD, HERBERT", "name": "persons"}], "blog": [], "_id": "579c18dd38f0d83c0fcf78db", "source": "The New York Times"}