{"news_desk": "Classified", "print_page": "20", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "288", "lead_paragraph": "PAUL--Eve W.,retired General Counsel of Planned Parenthood Federation of America, died peacefully Thursday morning in her Manhattan home following a long, hard-fought battle with cancer. Ms. Paul, a native New Yorker, graduated from Cornell University in 1950, where she was managing editor of the Cornell Daily Sun, and from Columbia Law School in 1952, where she served as an editor of the Law Review. She began her career at the New York law firm then known as Hays, Sklar before moving to Stamford, Connecticut and taking a break from practice to raise her children. She eventually opened her own law practice in Stamford, served on the Planning Board, and ran as a Democrat for the state legislature. Returning to New York in 1970, Ms. Paul worked for New York's Legal Aid Society and the law firm of Greenbaum, Wolff & Ernst before joining Planned Parenthood in 1978, where she served as General Counsel until 2003. In that same year, she lost her husband and partner in life of 51 years, Robert D. Paul. Ms. Paul leaves behind two children; Jeremy Paul of Newton, MA and Sarah Paul of New York City, their spouses Laurel Leff and Dr. Mark Nachamie; four grandchildren, Jason Paul, Russell Paul, Eli Nachamie and Owen Nachamie; and two devoted caregivers, Dell Hart and Evetta Clarke. A service will be held at the Riverside Memorial Chapel, 180 West 76th Street, New York, NY 10023 on Sunday, July 24, 2016 at 9:45am. In lieu of flowers, contributions may be directed to the Cooke Center for Learning and Development (https://www.cooke center.org), Northeastern University School of Law's Health Policy and Law Fund (http://www.northeastern.edu /law/giving/index.html) or Cornell University's College of Arts and Sciences. Eve will be sorely missed. 1/3", "pub_date": "2016-07-22T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  PAUL, EVE W."}, "snippet": "PAUL--Eve W.,retired General Counsel of Planned Parenthood Federation of America, died peacefully Thursday morning in her Manhattan home following a long, hard-fought battle with cancer. Ms. Paul, a native New Yorker, graduated from Cornell Univer...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A02E0DF1E3AF931A15754C0A9609D8B63", "keywords": [{"value": "PAUL, EVE W.", "name": "persons"}], "blog": [], "_id": "579c192a38f0d83c0fcf78ef", "source": "The New York Times"}