{"news_desk": "Classified", "print_page": "16", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "271", "lead_paragraph": "NAHAS--Edmund Alfred, born October 22, 1932, passed away after a brief illness on July 17, 2016. Ed is survived by his beloved wife, Vickie (nee Goolsby) from Tennessee and their children and grandchildren: daughter Jennifer Nahas of Cambridge, MA and her children, Sophia and Lukas; son and daughter -in-law, Stuart and Bronwyn Nahas of Paramus, NJ and their children, Aaron, Tara and Dylan; daughter and son-in-law, Heather Nahas and Matthew Waugh of Belmont, MA and their children, Katherine and Alexander; and son and daughter-in-law, Jeffrey and Kellyn Nahas of Amesbury, MA and their children, Natalie and Hannah. Edmund resided with Vickie in Brooklyn, New York. Ed graduated Trinity College in 1954 and earned his law degree from Columbia University in 1957. Thereafter, Edmund joined his uncle at the Manhattan firm that became Zraick, Nahas & Rich, where he practiced law until his retirement in 2011. Edmund's life was devoted to his family, friends, clients and his Church. He had a tireless work ethic and a driving desire to help others. When he was not working, Ed enjoyed the Pocono Mountains, visiting his children and grandchildren and following sports, particularly, the New York Giants. Ed is also survived by his brother, Alfred Nahas and his family, his nephew, Peter Poulakakos and his family and a host of extended family and friends. Services at McLaughlin & Sons Funeral Home, 9620 Third Avenue, Brooklyn, New York will be held on Thursday, July 21st in the afternoon and evening. A funeral mass will be held at St. Mary's Antiochian Orthodox Church, 8100 Ridge Boulevard, Brooklyn, New York at 10:00am on Friday, July 22, 2016. 1/3", "pub_date": "2016-07-21T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  NAHAS, EDMUND ALFRED"}, "snippet": "NAHAS--Edmund Alfred, born October 22, 1932, passed away after a brief illness on July 17, 2016. Ed is survived by his beloved wife, Vickie (nee Goolsby) from Tennessee and their children and grandchildren: daughter Jennifer Nahas of Cambridge, MA...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E0CE6DF1E3AF932A15754C0A9609D8B63", "keywords": [{"value": "NAHAS, EDMUND ALFRED", "name": "persons"}], "blog": [], "_id": "579ac77f38f0d81bd1ba57c5", "source": "The New York Times"}