{"news_desk": "Classified", "print_page": "21", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "226", "lead_paragraph": "HANDLER--Mark S. Warm, compassionate with a wicked sense of humor, Mark S. Handler (83 years old), passed away suddenly at his beloved home in East Hampton. Mark's career with Macy's began in 1958 in the executive training squad. He rose through the ranks from Junior Assistant Buyer in fabrics to Buyer in 1961. He was named Vice President in 1965, Senior Vice President in 1967, President of Bamberger's, a division of Macy's, in 1971 and Division Chairman in 1979. He became President and Chief Operating Officer of the Macy's Corporation in 1980, and Chief Merchandising Officer in 1992. That same year he was named co-Chairman and co-Chief Executive Officer of Macy's Corporation. He retired from his celebrated career with Macy's in 1995. He was beloved, respected and admired by all the many people's careers and lives he touched and advanced. A true gentleman who was madly in love with his family. He is survived by his wife of 56 years, Barbara, son, Jon (Cindy) and daughter, Jody (Neal) and four loving granddaughters, Caroline, Lori, Evie and Sophie. Known for his culinary prowess, his charming hospitality, an avid but adequate golfer, and his Cary Grant looks. We will miss him very much. The funeral service will be held at the Yardley & Pino Funeral Home, 94 Pantigo Road in East Hampton, NY, at 11am on Wednesday. 1/3", "pub_date": "2016-07-20T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  HANDLER, MARK S"}, "snippet": "HANDLER--Mark S. Warm, compassionate with a wicked sense of humor, Mark S. Handler (83 years old), passed away suddenly at his beloved home in East Hampton. Mark's career with Macy's began in 1958 in the executive training squad. He rose through t...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E01EFD6113AF933A15754C0A9609D8B63", "keywords": [{"value": "HANDLER, MARK S", "name": "persons"}], "blog": [], "_id": "579975d438f0d87cf647e338", "source": "The New York Times"}