{"news_desk": "Classified", "print_page": "24", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "430", "lead_paragraph": "POTTER--Priscilla Bowden, died after a brief illness on July 19th in New York City. A fine arts painter, her landscapes of Eastern Long Island where she spent much of her adult life were lauded. In the words of the former art critic for the East Hampton Star, \"Priscilla Bowden had such a knack for capturing the very essence of the East End that to see her paintings, with their misty tones and sense of space and distance, meant that afterwards you went out to the woods and bays and beaches with a renewed appreciation of their beauty. She painted what she saw, but she conveyed so much more.\" Born in Glen Cove, Long Island in 1940 she graduated from Radcliffe College going on to the Art Student's League in New York to study painting. New York became her - as a gifted young woman she explored her passions - fashion, romance, far-flung travel. Yet painting was always in the forefront. In 1970 she won the Chaloner Prize awarding her further art studies in Paris but after a few years in France she returned to the landscape she loved most settling into the famed art colony of East Hampton. It was there she met and married the late Jeffrey Potter, the friend and biographer of Jackson Pollock. Together they were at the center of the artistic and literary world's heyday on the South Fork. As her reputation as a painter grew, her work was shown in numerous galleries and museums on Long Island and in New York with shows also in Washington, DC, Florida, Virginia, Connecticut and Oxford, England. Her first gallerist remembers, \"Bowden shared with her contemporary, Jane Wilson, the quality of mystery when dealing with the sky and fog. She was a strong and gifted artist who created works of lasting beauty.\" Friends will remember her generous involvement in the East End community -- she played flute in a chamber group, loved the opera, donated her art and her name to charitable fundraisers, and for a while lent her unique talents to making quirky video \"shorts\" for East Hampton's local television. She is survived by two sisters, Linda Laux of Washington, DC and Mary Beth Bowden of New York City, and two nieces, and she enjoyed a close relationship with her husband's four adult children. She will be dearly missed by all who will long remember her gracious and hospitable company, her artistic talent and her wry sense of humor. A memorial service will be held at The Cathedral of St. John the Divine at a later date. 1/3", "pub_date": "2016-07-24T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  POTTER, PRISCILLA BOWDEN"}, "snippet": "POTTER--Priscilla Bowden, died after a brief illness on July 19th in New York City. A fine arts painter, her landscapes of Eastern Long Island where she spent much of her adult life were lauded. In the words of the former art critic for the East H...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A07E7DD1E3AF937A15754C0A9609D8B63", "keywords": [{"value": "POTTER, PRISCILLA BOWDEN", "name": "persons"}], "blog": [], "_id": "579ebc5b38f0d8533c250839", "source": "The New York Times"}