{"news_desk": "Classified", "print_page": "24", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "209", "lead_paragraph": "BUNIS--Irene, the veteran Broadway wardrobe supervisor passed away on July 20th in New York City. A graduate of SUNY Brockport, Irene began her career in the wardrobe department of the Jose Limon Dance company and subsequently worked with the Dance Theater Foundation, Alvin Ailey and the Metropolitan Opera. She joined the Theatrical Wardrobe Union Local 764 in 1981. Irene's Broadway productions included La Cage aux Folles, Legs Diamond, Peter Brooks' Cherry Orchard, Annie 2, Shogun the Musical, I Hate Hamlet, The Chairs, M. Butterfly, Nick & Nora, Crazy For You, Meet Me in St. Louis, Best Little Whorehouse Goes Public, Sunset Boulevard, The Capeman, Annie Get Your Gun (1999 revival), Breakfast at Tiffany's and Mamma Mia! Irene worked with every prominent Broadway costume designer, including Theoni V. Aldredge, Colleen Atwood, Bob Crowley, A. Christina Giannini, Willa Kim, Florence Klotz, William Ivey Long, Bob Mackie, Chloe Obolensky, Anthony Powell, Ann Roth and Mark Thompson. Irene worked on the Tony Awards from 1992. Survived by her husband Barry Gelda, her children Michelle and Samuel Gelda, and her brother, Harvey Bunis, and sister, Sobyl Bunis. A memorial service is being planned for the near future. Donations can be made to Broadway Cares/Broadway Fights AIDS https://www.broadwaycares. org/ and Memorial Sloan Kettering https://giving.mskcc.org/ 1/3", "pub_date": "2016-07-24T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  BUNIS, IRENE"}, "snippet": "BUNIS--Irene, the veteran Broadway wardrobe supervisor passed away on July 20th in New York City. A graduate of SUNY Brockport, Irene began her career in the wardrobe department of the Jose Limon Dance company and subsequently worked with the Danc...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9801E0DE1E3AF937A15754C0A9609D8B63", "keywords": [{"value": "BUNIS, IRENE", "name": "persons"}], "blog": [], "_id": "579ebc8938f0d8533c250848", "source": "The New York Times"}