{"news_desk": "Classified", "print_page": "24", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "224", "lead_paragraph": "TAFFAE--Robert Charles, of Boca Raton, FL, age 94, passed away July 16, 2016. Loving and devoted husband of Anita Runkel Taffae. Adoring father of Peter R. Taffae of Santa Monica, CA, Jessica (Glenn) Pack of Hillsborough, NC and Joen Bettmann (Arthur) of Atlanta, GA. Grandfather of Andrew (Robin) and Jennie Pack. Great-grandfather of Dylan and Farrah Rae. Devoted uncle of Susan (Bernard) Mendik Tarkinow and Nancy Troy. A past resident of Scarsdale and Chappaqua, NY. He attended Poly Prep Country Day School in Brooklyn, NY and graduated from Rutgers University, New Brunswick, NJ. He served during World War II with the 75th Infantry Division and was awarded the Combat Infantryman's Badge, The Bronze Star Medal of Valor and recently The Legion d'Honneur (Chevalier). Taffae was President of Leon Taffae Co., Inc., Coffee Importers. He was a member of the New York Coffee and Sugar Exchange, The Green Coffee Association of New York, where he served on the Board of Directors and Chair of the Adjudication Committee. A past trustee of Congregation Emanu-El of Westchester. Past member of the Bankers Club and the India House, NYC. He was an accomplished artist, Francophile and avid tennis player. He was blessed with an extraordinary life filled with people he loved deeply. His intellect, spirit, humor and affection inspired all of us. He will be greatly missed. 1/3", "pub_date": "2016-07-24T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  TAFFAE, ROBERT CHARLES"}, "snippet": "TAFFAE--Robert Charles, of Boca Raton, FL, age 94, passed away July 16, 2016. Loving and devoted husband of Anita Runkel Taffae. Adoring father of Peter R. Taffae of Santa Monica, CA, Jessica (Glenn) Pack of Hillsborough, NC and Joen Bettmann (Art...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9B07E6DD1E3AF937A15754C0A9609D8B63", "keywords": [{"value": "TAFFAE, ROBERT CHARLES", "name": "persons"}], "blog": [], "_id": "579ebca738f0d8533c250850", "source": "The New York Times"}