{"news_desk": "Classified", "print_page": "24", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "843", "lead_paragraph": "HONN--Francis Jerome, beloved husband, father and grandfather, passed away peacefully in West Caldwell, New Jersey on July 2, 2016 at age 94. A 60-year veteran of the chemical industry, he was the inventor of the yellow Hi-Liter, introduced by Carter's Ink Co. in 1963. He holds over 25 patents. Born in Syracuse, NY and raised in Ohio, he earned a B.S. from John Carroll University, M.S. from the Polytechnic Institute of Brooklyn, and Ph.D. in organic chemistry from the University of Pittsburgh. Beginning his career in wartime research for General Cable Corp., he worked on substitute materials for natural rubber and subsequently developed wire insulation from newly invented synthetic plastics and elastomers. Following the war, he became a Fellow of the Mellon Institute in Pittsburgh where he conducted research for the Quartermaster Corps, the Office of Rubber Reserve and Armstrong Cork Co. His optical cement, designed to overcome the deficiencies of heat-sensitive Canada balsam, was adopted by the military. From the Mellon Institute, Honn joined M.W. Kellogg Co. where he pioneered the development of fluoroelastomers for use at high temperatures in missile and aerospace applications. When the Kellogg division was acquired by the 3M Company, he moved into the role of chemical industry executive, a path he followed with various global chemical companies for the next thirty years. His experience includes serving as vice president of technology for Carter's Ink, vice president of commercial development for the chemical division of Olin Mathieson, vice president of new products for the Mennen Co., and a number of positions with BASF Corporation, ending as director of corporate planning, development and marketing and a member of the executive committee. After retiring from BASF, he served as an outside director of Henkel Corp., the U.S. subsidiary of Henkel KGaA, until 1992. Never content to be anything other than active, in 1988 Honn accepted the Alfred Driscoll Chair and Professor of PharmaceuticalChemical Studies in the Business School at Fairleigh Dickinson University. For 15 years, he taught courses on managing research and technology, strategic management, and international business to MBA candidates employed by the chemical and pharmaceutical industries. While there he wrote three textbooks. Honn joined the American Chemical Society in 1944 and remained an active member for his entire career. Another long-term commitment was to the Commercial Development Association, for which he served as president in 1974-75. He was awarded the Golden C for his invention of the Hi-Liter and pioneering work in fluoroelastomers. He was founding chairman of the CDA Educational Foundation. Beyond his professional accomplishments, Honn shared a lifelong love of opera and classical music with his beloved wife of 66 years, Alyce. Their first date was attending \"La Boheme\" at the old Met. He served as trustee and trustee emeritus of the New Jersey Symphony Orchestra for thirty years, and was a steadfast and enthusiastic supporter. Following his motto to \"keep busy!\", he was president of the Residents Association at Crane's Mill after moving there in 2010. At the time of his death, he was Chair of the Finance Committee of the Organization of Residents Associations of New Jersey, which includes all 25 continuing care retirement communities in the state. At the age of 92, he co-authored a 30- page report on the impact of Hurricane Sandy on Continuing Care Retirement Communities. In the last several years, he facilitated different lecture series for the Crane's Mill residents based on the Great Courses, including one on the technology of ancient Greece and Rome. His family knew well his prodigious memory, which was amply documented in the 254-page memoir he wrote at age 87. Among his many recollections are those detailing his commute to high school on trolleys heated by coal fired stoves, a 1937 trip on a Great Lakes iron ore carrier, and the research specialties of his professors at Brooklyn Poly, eminent scientists who had fled Nazi Germany. Ever intellectually driven, he leaves behind a stack of bedside reading that includes books on the Federal Reserve, materials science, and Harry Truman, as well as carefully catalogued copies of \"Chemical and Engineering News.\" Throughout his long and productive life, he remained devoted to his family. He is survived by his son and daughter in law, David Honn and Leigh Davis Honn of Acton, MA, his son, Gregory Honn, of Greenwich, CT, and his daughter and son-in-law, Cynthia and Robert Hillas, of Princeton, NJ, as well as by his loving grandchildren, Robert Jr. and his wife Camden, Alison and her husband Jonathan, Mary and Timothy. He was predeceased by his wife, Alyce, and his daughter, Jasper Honn. A private burial service was held at Immaculate Conception Cemetery in Montclair, New Jersey. A Celebration of Life will be held on Saturday, August 27, at 11:00am at Crane's Mill retirement community, 459 Passaic Avenue, West Caldwell, NJ. A reception and lunch will follow immediately after the gathering. All friends and family are welcome. In lieu of flowers, contributions can be made to the New Jersey Symphony Orchestra, 60 Park Place, 9th floor, Newark, NJ 07102, or online at njsymphony.org. 1/3", "pub_date": "2016-07-24T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  HONN, FRANCIS JEROME"}, "snippet": "HONN--Francis Jerome, beloved husband, father and grandfather, passed away peacefully in West Caldwell, New Jersey on July 2, 2016 at age 94. A 60-year veteran of the chemical industry, he was the inventor of the yellow Hi-Liter, introduced by Car...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9C0CEFDE1E3AF937A15754C0A9609D8B63", "keywords": [{"value": "HONN, FRANCIS JEROME", "name": "persons"}], "blog": [], "_id": "579ebcd238f0d8533c25085a", "source": "The New York Times"}