{"news_desk": "Classified", "print_page": "24", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "191", "lead_paragraph": "BALIFF--Robert Jay, MD. January 21, 1932 - July 17, 2016. Our man for all seasons, Physician and professor. Devoted husband of 61 years to Cora Manson died of Dementia. Rah! Midwood. Father to Keith, Ethan, Leslie and Dan Paisner. Grandfather to Jacob, Hana and Rose Paisner. Brother-in-law and uncle to Mansons, Kleins and Biers. Companion to Rusty the poodle. Caring cousin, friend, and partner. Outstanding doctor, teacher, mountain hiker, lover of all things with wheels, animal photographer, safari traveller, glacier climber, exceptional woodworker, model builder dog lover and master repairman. We are grateful to the friends and family who were there for him and us during these difficult years. You made life easier, took him to dinner, called, baked him goodies, walked his dog, expressed concerns, cared for him physically, smoothed the way medically, treated him with respect. He knew that you cared. Special appreciation to Keith's friends at Bayville who support Keith and welcomed his Dad. Private graveside service to the tune of \"Leaving on a Jet Plane.\" Donations in his name may be made to United Cerebral Palsy, UCP Bayville, 85 Bayville Avenue, Bayville, NY, 11709. Attention Arios. 1/3", "pub_date": "2016-07-24T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  BALIFF, ROBERT JAY"}, "snippet": "BALIFF--Robert Jay, MD. January 21, 1932 - July 17, 2016. Our man for all seasons, Physician and professor. Devoted husband of 61 years to Cora Manson died of Dementia. Rah! Midwood. Father to Keith, Ethan, Leslie and Dan Paisner. Grandfather to J...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9C05E0DE1E3AF937A15754C0A9609D8B63", "keywords": [{"value": "BALIFF, ROBERT JAY", "name": "persons"}], "blog": [], "_id": "579ebc3638f0d8533c25082d", "source": "The New York Times"}