{"news_desk": "Classified", "print_page": "24", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "227", "lead_paragraph": "STUPACK--Irwin Sheldon, 87, of Sarasota, FL, and formerly of Southbury, CT and Rockville Centre, NY passed away on July 16, 2016, after a five year battle with Mantle-Cell Lymphoma. Mr. Stupack was a graduate of James Madison High School in Brooklyn, and Long Island University where he was one of the first people in the United States to receive a MBA Degree. Irwin served as a Desk Sergeant in the U.S. Army. While stationed at Fort Dix, NJ, he married Betti Hamburger Stupack and the couple had two children. They remained married until Betti's death in 1999. Subsequently, Irwin married Frederika Jacobson and the couple lived in Sarasota, FL. During his long career in the Men's Apparel business, Irwin worked for J.P. Stevens, Wamsutta Mills, Fair-Tex Mills and Kellwood Corporation. He was instrumental in obtaining the first NFL Licensed clothing and was at the forefront of the \"Made in America\" trend of the 1990s when his clientele included the major catalogue companies of; L.L. Bean, Clifford & Wills, Lands End and Patagonia. He is survived by his wife, Fredy, his son Robert Stupack of Larkspur, CA, daughter Barbara Anton of Boulder, CO, his grandchildren, Stephanie Stupack, Michael Anton and Joel Anton. He will also be missed by his cousins and nieces, Philip and Susan Cohen, Carol Cohen, Claire and George Tornay, Ellen Seh and JoAnn Berman. 1/3", "pub_date": "2016-07-24T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  STUPACK, IRWIN SHELDON"}, "snippet": "STUPACK--Irwin Sheldon, 87, of Sarasota, FL, and formerly of Southbury, CT and Rockville Centre, NY passed away on July 16, 2016, after a five year battle with Mantle-Cell Lymphoma. Mr. Stupack was a graduate of James Madison High School in Brookl...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9905E6DD1E3AF937A15754C0A9609D8B63", "keywords": [{"value": "STUPACK, IRWIN SHELDON", "name": "persons"}], "blog": [], "_id": "579ebc4538f0d8533c250831", "source": "The New York Times"}