{"news_desk": "Classified", "print_page": "24", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "296", "lead_paragraph": "WOODROOFE--Martha. Martha \"Molly\" Reed Woodroofe, died on Wednesday, July 20, 2016 following a valiant battle with pancreatic cancer. Molly was born in Pittsburgh in 1975 and was a devoted daughter to and cherished by her parents the Reverend Robert \"Woody\" and Sally Woodroofe and extremely close to her older sister Louise. She remained passionate about Pittsburgh and its teams. She graduated from Butler Area High School in Pennsylvania, was an AllIvy soccer standout at Yale University, and later earned a Master's from Georgetown University. Molly was a beloved history teacher and coach at three independent schools starting at the Westminster School in Connecticut before moving to Washington, DC where she spent a decade teaching and coaching as the school's first female varsity coach at St. Albans. While at St. Albans she met her partner, Blair Parker, then a history teacher at National Cathedral School and with whom she shared a commitment to teaching. In 2013 Molly and Blair moved to New York City where Molly became the History Department Head at the Spence School. Molly lived life with purpose and joy that was felt by everyone she encountered. Even in the nine months after her diagnosis she continued to teach and carry forth her other responsibilities, which included making sure everyone in her presence was happy and comforted. Her passion for sports and world travel was unwavering. She watched every USWNT game and traveled to their World Cup victory in Vancouver. She spent her last days rooting for her favorite teams and planning vacations while surrounded by friends and family. A memorial service will be held at 10am on Monday, July 25 at the Washington National Cathedral. In lieu of flowers, donations may be made to Yale Women's Soccer or the Pancreatic Cancer Action Network. 1/3", "pub_date": "2016-07-24T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  WOODROOFE, MARTHA"}, "snippet": "WOODROOFE--Martha. Martha \"Molly\" Reed Woodroofe, died on Wednesday, July 20, 2016 following a valiant battle with pancreatic cancer. Molly was born in Pittsburgh in 1975 and was a devoted daughter to and cherished by her parents the Reverend Robe...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=980CE6DD1E3AF937A15754C0A9609D8B63", "keywords": [{"value": "WOODROOFE, MARTHA", "name": "persons"}], "blog": [], "_id": "579ebc7c38f0d8533c250844", "source": "The New York Times"}