{"news_desk": "Classified", "print_page": "24", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "328", "lead_paragraph": "GIMBEL--Thomas S. T.,Jr. Educator, Author, Disability Pioneer, 1985 - 2016. Son of Thomas S. T. Gimbel and Lesley B. Gimbel of Glen Cove, NY and brother of Peter B. Gimbel, Lesley B. Gimbel and Hope K. Gimbel. He died Thursday, July 14, of heart failure associated with Duchenne Muscular Dystrophy. Thomas \"Tommy\" was a graduate of the Portledge School, 2003; Brown University, B.A., 2007; Harvard University, M.A., 2009; and, NYU, M.A., 2012 having concentrated on religious studies and comparative religion. He published the book \"God's Words in Human Voices\" in 2007, writing by blowing Morse Code through a straw- like tube attached to his computer. His yet to be published autobiography, \"Muscleman,\" is in its last editing stages. Tommy was a faculty member at Portledge School in Locust Valley, NY, and a revered teacher of both modern and ancient languages. He was a director of Youth Ministry at St. John's of Lattingtown Episcopal Church, a teacher of Adult Bible Studies, and he gave several sermons. He was a recently ordained Christian Minister. Earlier in his life, Tommy and his brother Peter, were featured on the MDA Labor Day telethon. Tommy spoke at certain conferences for the Parent Project including internationally. While he still had use of his arms, he was a painter and cartoonist. Later, he used the internet to tutor students and compete at chess. Tommy Gimbel was an example of \"can do\" optimism even with very limited physical capabilities, in a wheel chair and requiring full-time breathing assistance from a ventilator machine. He had clarity of vision and purpose and an aura of welcoming kindness to everyone. His soft spoken wisdom from personal experience and Christian philosophy delivered with a sense of humor drew and inspired people. Many have reported that his observations and appreciation of life's gifts changed their lives forever. Contributions in Tommy's memory may be made to: St. John's of Lattingtown / Memory of Tommy, 325 Lattingtown Rd., Locust Valley, NY 11560. 1/3", "pub_date": "2016-07-24T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  GIMBEL, THOMAS S. T."}, "snippet": "GIMBEL--Thomas S. T.,Jr. Educator, Author, Disability Pioneer, 1985 - 2016. Son of Thomas S. T. Gimbel and Lesley B. Gimbel of Glen Cove, NY and brother of Peter B. Gimbel, Lesley B. Gimbel and Hope K. Gimbel. He died Thursday, July 14, of heart f...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A00EFDE1E3AF937A15754C0A9609D8B63", "keywords": [{"value": "GIMBEL, THOMAS S. T.", "name": "persons"}], "blog": [], "_id": "579ebc7538f0d8533c250842", "source": "The New York Times"}