{"news_desk": "Classified", "print_page": "23", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "136", "lead_paragraph": "SCHEPPS--J. Lew. The family mourns the passing of Lew, 96, on June 28, 2016, following a prolonged illness. He was predeceased by his beloved wives Sonia and Suzanne and brother Aaron, and is survived by his loving partner Geraldine Kory; son Solomon, daughter-in-law Karen, grandson Daniel; daughter Francine, son-in- law David, granddaughters Rachel, Jaclyn and Molly; brother Elihu, loving nieces and nephews. Lew, a veteran of WWII, retired from a successful career in the textile business as founding partner of Mastex Industries which he ran with his two brothers. He went on to dedicate himself to the Jewish National Fund, continuing the legacy begun by his parents, Isadore and Rae. Funeral service will be held on Thursday, June 30th, 10am at Congregation Kol Ami in White Plains. Donations can be sent to Jewish National Fund. 1", "pub_date": "2016-06-29T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Memorials  SCHEPPS, J. LEW. THE FAMILY MOURNS THE PASSING OF LEW, 96, ON JUNE 28, 2016, FOLLOWING A PROLONGED ILLNESS. HE WAS PREDECEASED BY HIS BELOVED WIVES SONIA AND SUZANNE AND BROTHER AARON, AND IS SURVIVED BY HIS LOVING PARTNER GERALDINE KORY; SON SOLOMON, DAUGHTER, IN, LAW KAREN, GRANDSON DANIEL; DAUGHTER FRANCINE, SON, IN, LAW DAVID, GRANDDAUGHTERS RACHEL, JACLYN AND MOLLY; BROTHER ELIHU, LOVING NIECES AND NEPHEWS. LEW, A VETERAN OF WWII, RETIRED FROM A SUCCESSFUL CAREER IN THE TEXTILE BUSINESS AS FOUNDING PARTNER OF MASTEX INDUSTRIES WHICH HE RAN WITH HIS TWO BROTHERS. HE WENT ON TO DEDICATE HIMSELF TO THE JEWISH NATIONAL FUND, CONTINUING THE LEGACY BEGUN BY HIS PARENTS, ISADORE AND RAE. FUNERAL SERVICE WILL BE HELD ON THURSDAY, JUNE 30TH, 10AM AT CONGREGATION KOL AMI IN WHITE PLAINS. DONATIONS CAN BE SENT TO JEWISH NATIONAL FUND. 1"}, "snippet": "SCHEPPS--J. Lew. The family mourns the passing of Lew, 96, on June 28, 2016, following a prolonged illness. He was predeceased by his beloved wives Sonia and Suzanne and brother Aaron, and is survived by his loving partner Geraldine Kory; son Solomon, daughter-in-law Karen, grandson Daniel; daughter Francine, son-in- law David, granddaughters Rachel, Jaclyn and Molly; brother Elihu, loving nieces and nephews. Lew, a veteran of WWII, retired from a successful career in the textile business as founding partner of Mastex Industries which he ran with his two brothers. He went on to dedicate himself to the Jewish National Fund, continuing the legacy begun by his parents, Isadore and Rae. Funeral service will be held on Thursday, June 30th, 10am at Congregation Kol Ami in White Plains. Donations can be sent to Jewish National Fund. 1", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9D04EEDF113AF93AA15755C0A9609D8B63", "keywords": [{"value": "SON SOLOMON, DAUGHTER, IN, LAW KAREN, GRANDSON DANIEL", "name": "persons"}, {"value": "BROTHER ELIHU, LOVING NIECES AND NEPHEWS. LEW, A VETERAN OF WWII, RETIRED FROM A SUCCESSFUL CAREER IN THE TEXTILE BUSINESS AS FOUNDING PARTNER OF MASTEX INDUSTRIES WHICH HE RAN WITH HIS TWO BROTHERS. HE WENT ON TO DEDICATE HIMSELF TO THE JEWISH NATIONAL FUND, CONTINUING THE LEGACY BEGUN BY HIS PARENTS, ISADORE AND RAE. FUNERAL SERVICE WILL BE HELD ON THURSDAY, JUNE 30TH, 10AM AT CONGREGATION KOL AMI IN WHITE PLAINS. DONATIONS CAN BE SENT TO JEWISH NATIONAL FUND. 1", "name": "persons"}, {"value": "DAUGHTER FRANCINE, SON, IN, LAW DAVID, GRANDDAUGHTERS RACHEL, JACLYN AND MOLLY", "name": "persons"}, {"value": "SCHEPPS, J. LEW. THE FAMILY MOURNS THE PASSING OF LEW, 96, ON JUNE 28, 2016, FOLLOWING A PROLONGED ILLNESS. HE WAS PREDECEASED BY HIS BELOVED WIVES SONIA AND SUZANNE AND BROTHER AARON, AND IS SURVIVED BY HIS LOVING PARTNER GERALDINE KORY", "name": "persons"}], "blog": [], "_id": "577dc68038f0d85bf991fb20", "source": "The New York Times"}