{"news_desk": "Classified", "print_page": "23", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "344", "lead_paragraph": "SWIRBUL--L. Philip. Leon Philip Swirbul died peacefully on June 12 in Tuxedo Park, NY surrounded by his loving family. The cause was complications related to Parkinson's. He was 85. Known to his family and friends as Phil, Mr. Swirbul was born in Bay Shore, Long Island on February 19, 1931. His father, Jake Swirbul, was one of the founders of the Grumman Aircraft Engineering Corporation. Phil Swirbul was a graduate of the Lawrenceville School and Princeton University where he earned an A.B. degree in 1953. Following Princeton, he served in the U.S. Navy from 1953-1955 with the rank of Lieutenant Junior Grade (LTJG). During his 50-year career as an investment advisor to high net worth individuals, Phil was associated with several Wall Street firms including Reynolds & Co., A.G. Edwards, and Morgan Stanley. He was married to his loving wife, Serene, for 62 years. They established their home in Tuxedo Park, NY in 1968 where they raised four sons and where Phil gave distinguished leadership service to the affairs of St. Mary's Church, The Tuxedo Park School, and The Tuxedo Club. As a dedicated member of the St. Mary's Church vestry, Phil served as Senior Warden. He was also President of the Board of Trustees of The Tuxedo Park School. A life- long tennis player with a renowned backhand, Phil was Chairman of the Board of Governors of The Tuxedo Club. A beloved figure in Tuxedo Park, Phil will be remembered and missed for his devotion to his family, his commitment to the community and his love of sports. He was an enthusiastic supporter of the Mets and Jets. He is survived by his wife, Serene, and his four sons: Philip and his wife Malu; Paul and his wife Barbara; Mark and Jason and his wife Jill. He is also survived by his seven grandchildren: Mackenzie, Sarah, Justin, Madison, Caitlin, Tyler and Emma and a twin brother, William R. Swirbul of Perrysburg, Ohio. A memorial service will be held at St. Mary's Church in Tuxedo Park, NY on Friday, June 17th at 11:00am. 1", "pub_date": "2016-06-15T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Memorials  SWIRBUL, L. PHILIP. LEON PHILIP SWIRBUL DIED PEACEFULLY ON JUNE 12 IN TUXEDO PARK, NY SURROUNDED BY HIS LOVING FAMILY. THE CAUSE WAS COMPLICATIONS RELATED TO PARKINSON'S. HE WAS 85. KNOWN TO HIS FAMILY AND FRIENDS AS PHIL, MR. SWIRBUL WAS BORN IN BAY SHORE, LONG ISLAND ON FEBRUARY 19, 1931. HIS FATHER, JAKE SWIRBUL, WAS ONE OF THE FOUNDERS OF THE GRUMMAN AIRCRAFT ENGINEERING CORPORATION. PHIL SWIRBUL WAS A GRADUATE OF THE LAWRENCEVILLE SCHOOL AND PRINCETON UNIVERSITY WHERE HE EARNED AN A.B. DEGREE IN 1953. FOLLOWING PRINCETON, HE SERVED IN THE U.S. NAVY FROM 1953, 1955 WITH THE RANK OF LIEUTENANT JUNIOR GRADE (LTJG). DURING HIS 50, YEAR CAREER AS AN INVESTMENT ADVISOR TO HIGH NET WORTH INDIVIDUALS, PHIL WAS ASSOCIATED WITH SEVERAL WALL STREET FIRMS INCLUDING REYNOLDS & CO., A.G. EDWARDS, AND MORGAN STANLEY. HE WAS MARRIED TO HIS LOVING WIFE, SERENE, FOR 62 YEARS. THEY ESTABLISHED THEIR HOME IN TUXEDO PARK, NY IN 1968 WHERE THEY RAISED FOUR SONS AND WHERE PHIL GAVE DISTINGUISHED LEADERSHIP SERVICE TO THE AFFAIRS OF ST. MARY'S CHURCH, THE TUXEDO PARK SCHOOL, AND THE TUXEDO CLUB. AS A DEDICATED MEMBER OF THE ST. MARY'S CHURCH VESTRY, PHIL SERVED AS SENIOR WARDEN. HE WAS ALSO PRESIDENT OF THE BOARD OF TRUSTEES OF THE TUXEDO PARK SCHOOL. A LIFE, LONG TENNIS PLAYER WITH A RENOWNED BACKHAND, PHIL WAS CHAIRMAN OF THE BOARD OF GOVERNORS OF THE TUXEDO CLUB. A BELOVED FIGURE IN TUXEDO PARK, PHIL WILL BE REMEMBERED AND MISSED FOR HIS DEVOTION TO HIS FAMILY, HIS COMMITMENT TO THE COMMUNITY AND HIS LOVE OF SPORTS. HE WAS AN ENTHUSIASTIC SUPPORTER OF THE METS AND JETS. HE IS SURVIVED BY HIS WIFE, SERENE, AND HIS FOUR SONS: PHILIP AND HIS WIFE MALU; PAUL AND HIS WIFE BARBARA; MARK AND JASON AND HIS WIFE JILL. HE IS ALSO SURVIVED BY HIS SEVEN GRANDCHILDREN: MACKENZIE, SARAH, JUSTIN, MADISON, CAITLIN, TYLER AND EMMA AND A TWIN BROTHER, WILLIAM R. SWIRBUL OF PERRYSBURG, OHIO. A MEMORIAL SERVICE WILL BE HELD AT ST. MARY'S CHURCH IN TUXEDO PARK, NY ON FRIDAY, JUNE 17TH AT 11:00AM. 1"}, "snippet": "SWIRBUL--L. Philip. Leon Philip Swirbul died peacefully on June 12 in Tuxedo Park, NY surrounded by his loving family. The cause was complications related to Parkinson's. He was 85. Known to his family and friends as Phil, Mr. Swirbul was born in Bay Shore, Long Island on February 19, 1931. His father, Jake Swirbul, was one of the founders of the Grumman Aircraft Engineering Corporation. Phil Swirbul was a graduate of the Lawrenceville School and Princeton University where he earned an A.B. degree in 1953. Following Princeton, he served in the U.S. Navy from 1953-1955 with the rank of Lieutenant Junior Grade (LTJG). During his 50-year career as an investment advisor to high net worth individuals, Phil was associated with several Wall Street firms including Reynolds & Co., A.G. Edwards, and Morgan Stanley. He was married to his loving wife, Serene, for 62 years. They established their home in Tuxedo Park, NY in 1968 where they raised four sons and where Phil gave distinguished leadership service to the affairs of St. Mary's Church, The Tuxedo Park School, and The Tuxedo Club. As a dedicated member of the St. Mary's Church vestry, Phil served as Senior Warden. He was also President of the Board of Trustees of The Tuxedo Park School. A life- long tennis player with a renowned backhand, Phil was Chairman of the Board of Governors of The Tuxedo Club. A beloved figure in Tuxedo Park, Phil will be remembered and missed for his devotion to his family, his commitment to the community and his love of sports. He was an enthusiastic supporter of the Mets and Jets. He is survived by his wife, Serene, and his four sons: Philip and his wife Malu; Paul and his wife Barbara; Mark and Jason and his wife Jill. He is also survived by his seven grandchildren: Mackenzie, Sarah, Justin, Madison, Caitlin, Tyler and Emma and a twin brother, William R. Swirbul of Perrysburg, Ohio. A memorial service will be held at St. Mary's Church in Tuxedo Park, NY on Friday, June 17th at 11:00am. 1", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9C03E7DB103AF936A25755C0A9609D8B63", "keywords": [{"value": "PAUL AND HIS WIFE BARBARA", "name": "persons"}, {"value": "MARK AND JASON AND HIS WIFE JILL. HE IS ALSO SURVIVED BY HIS SEVEN GRANDCHILDREN: MACKENZIE, SARAH, JUSTIN, MADISON, CAITLIN, TYLER AND EMMA AND A TWIN BROTHER, WILLIAM R. SWIRBUL OF PERRYSBURG, OHIO. A MEMORIAL SERVICE WILL BE HELD AT ST. MARY'S CHURCH IN TUXEDO PARK, NY ON FRIDAY, JUNE 17TH AT 11:00AM. 1", "name": "persons"}, {"value": "SWIRBUL, L. PHILIP. LEON PHILIP SWIRBUL DIED PEACEFULLY ON JUNE 12 IN TUXEDO PARK, NY SURROUNDED BY HIS LOVING FAMILY. THE CAUSE WAS COMPLICATIONS RELATED TO PARKINSON'S. HE WAS 85. KNOWN TO HIS FAMILY AND FRIENDS AS PHIL, MR. SWIRBUL WAS BORN IN BAY SHORE, LONG ISLAND ON FEBRUARY 19, 1931. HIS FATHER, JAKE SWIRBUL, WAS ONE OF THE FOUNDERS OF THE GRUMMAN AIRCRAFT ENGINEERING CORPORATION. PHIL SWIRBUL WAS A GRADUATE OF THE LAWRENCEVILLE SCHOOL AND PRINCETON UNIVERSITY WHERE HE EARNED AN A.B. DEGREE IN 1953. FOLLOWING PRINCETON, HE SERVED IN THE U.S. NAVY FROM 1953, 1955 WITH THE RANK OF LIEUTENANT JUNIOR GRADE", "name": "persons"}], "blog": [], "_id": "576b51a138f0d83413c93df0", "source": "The New York Times"}