{"news_desk": "Book Review Desk", "print_page": "21", "section_name": "Books; Arts", "subsection_name": null, "byline": {"original": "By MARIA RUSSO", "person": [{"rank": 1, "role": "reported", "firstname": "Maria", "organization": "", "lastname": "RUSSO"}]}, "abstract": null, "type_of_material": "Review", "word_count": "516", "lead_paragraph": "one day on our blue planet . . . in the Antarctic Written and illustrated by Ella Bailey. 32 pp. Flying Eye Books. $16.95. (Picture book; ages 3 to 7)\n \nPart of a stylish new illustrated series devoted to the daily lives of young animals, this snapshot of an Adélie penguin chick shows her as adorable — and also a brave adventurer. It’s the day she first leaves her parents and journeys out to sea, swimming like a champ as she navigates Antarctic waters filled with predators and prey. Bailey covers the basics in a tone that’s informative but delighted by the improbabilities of penguins. Her friendly, big-eyed creatures look as if they’re having a blast.", "pub_date": "2016-02-14T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Bookshelf; At Home in the Cold"}, "snippet": "one day on our blue planet .&#x2008;.&#x2008;. in the Antarctic Written and illustrated by Ella Bailey. 32&#x202F;pp. Flying Eye Books. $16.95. (Picture book; ages 3 to 7)&#xa;   &#xa;Part of a stylish new illustrated series devoted to the daily lives of young animals, this snapshot of an Ad&#xE9;lie penguin chick shows her as adorable &#x2014; and also a brave adventurer. It&#x2019;s the day she first leaves her parents and journeys out to sea, swimming like a champ as she navigates Antarctic waters filled with predators and prey. Bailey covers the basics in a tone that&#x2019;s informative but delighted by the improbabilities of penguins. Her friendly, big-eyed creatures look as if they&#x2019;re having a blast.", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9D0DEED71031F937A25751C0A9609D8B63", "keywords": [], "blog": [], "_id": "56ca897638f0d873cb95039e", "source": "The New York Times"}