{"news_desk": "Classified", "print_page": "16", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "155", "lead_paragraph": "HIGGINS--V. Louise, born February 21, 1922, originally of Andover, MA, daughter of the late James A. and Martina F. Higgins, died peacefully on March 25, 2016. She was predeceased by her loving siblings, Martina F. Higgins and John A. Higgins and survived by three nieces and a nephew. Louise was highly respected as both a teacher and a Director in the Westport Public Schools. A serious and valued historian of Southport, she added important documents, maps and photographs to the Pequot Library and the Fairfield Museum. V. Louise not only explored the history and geography of the United States; she also travelled extensively in Europe, Russia and Egypt. V. Louise was immensely intelligent, endlessly insightful with an incredibly witty sense of humor and a zest for life. At Louise's request, no services will be held. Donations can be made to Louise's favorite charity, the Fairfield Museum, writing \"V. Louise Higgins Memorial\" in the notes. 1", "pub_date": "2016-04-20T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Memorials  HIGGINS, V. LOUISE, BORN FEBRUARY 21, 1922, ORIGINALLY OF ANDOVER, MA, DAUGHTER OF THE LATE JAMES A. AND MARTINA F. HIGGINS, DIED PEACEFULLY ON MARCH 25, 2016. SHE WAS PREDECEASED BY HER LOVING SIBLINGS, MARTINA F. HIGGINS AND JOHN A. HIGGINS AND SURVIVED BY THREE NIECES AND A NEPHEW. LOUISE WAS HIGHLY RESPECTED AS BOTH A TEACHER AND A DIRECTOR IN THE WESTPORT PUBLIC SCHOOLS. A SERIOUS AND VALUED HISTORIAN OF SOUTHPORT, SHE ADDED IMPORTANT DOCUMENTS, MAPS AND PHOTOGRAPHS TO THE PEQUOT LIBRARY AND THE FAIRFIELD MUSEUM. V. LOUISE NOT ONLY EXPLORED THE HISTORY AND GEOGRAPHY OF THE UNITED STATES; SHE ALSO TRAVELLED EXTENSIVELY IN EUROPE, RUSSIA AND EGYPT. V. LOUISE WAS IMMENSELY INTELLIGENT, ENDLESSLY INSIGHTFUL WITH AN INCREDIBLY WITTY SENSE OF HUMOR AND A ZEST FOR LIFE. AT LOUISE'S REQUEST, NO SERVICES WILL BE HELD. DONATIONS CAN BE MADE TO LOUISE'S FAVORITE CHARITY, THE FAIRFIELD MUSEUM, WRITING \"V. LOUISE HIGGINS MEMORIAL\" IN THE NOTES. 1"}, "snippet": "HIGGINS--V. Louise, born February 21, 1922, originally of Andover, MA, daughter of the late James A. and Martina F. Higgins, died peacefully on March 25, 2016. She was predeceased by her loving siblings, Martina F. Higgins and John A. Higgins and survived by three nieces and a nephew. Louise was highly respected as both a teacher and a Director in the Westport Public Schools. A serious and valued historian of Southport, she added important documents, maps and photographs to the Pequot Library and the Fairfield Museum. V. Louise not only explored the history and geography of the United States; she also travelled extensively in Europe, Russia and Egypt. V. Louise was immensely intelligent, endlessly insightful with an incredibly witty sense of humor and a zest for life. At Louise's request, no services will be held. Donations can be made to Louise's favorite charity, the Fairfield Museum, writing \"V. Louise Higgins Memorial\" in the notes. 1", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9D05E4DF123AF933A15757C0A9609D8B63", "keywords": [{"value": "HIGGINS, V. LOUISE, BORN FEBRUARY 21, 1922, ORIGINALLY OF ANDOVER, MA, DAUGHTER OF THE LATE JAMES A. AND MARTINA F. HIGGINS, DIED PEACEFULLY ON MARCH 25, 2016. SHE WAS PREDECEASED BY HER LOVING SIBLINGS, MARTINA F. HIGGINS AND JOHN A. HIGGINS AND SURVIVED BY THREE NIECES AND A NEPHEW. LOUISE WAS HIGHLY RESPECTED AS BOTH A TEACHER AND A DIRECTOR IN THE WESTPORT PUBLIC SCHOOLS. A SERIOUS AND VALUED HISTORIAN OF SOUTHPORT, SHE ADDED IMPORTANT DOCUMENTS, MAPS AND PHOTOGRAPHS TO THE PEQUOT LIBRARY AND THE FAIRFIELD MUSEUM. V. LOUISE NOT ONLY EXPLORED THE HISTORY AND GEOGRAPHY OF THE UNITED STATES", "name": "persons"}, {"value": "SHE ALSO TRAVELLED EXTENSIVELY IN EUROPE, RUSSIA AND EGYPT. V. LOUISE WAS IMMENSELY INTELLIGENT, ENDLESSLY INSIGHTFUL WITH AN INCREDIBLY WITTY SENSE OF HUMOR AND A ZEST FOR LIFE. AT LOUISE'S REQUEST, NO SERVICES WILL BE HELD. DONATIONS CAN BE MADE TO LOUISE'S FAVORITE CHARITY, THE FAIRFIELD MUSEUM, WRITING \"V. LOUISE HIGGINS MEMORIAL\" IN THE NOTES. 1", "name": "persons"}], "blog": [], "_id": "57217d5f38f0d83acb9a6277", "source": "The New York Times"}