{"news_desk": "Classified", "print_page": "26", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "263", "lead_paragraph": "ALPERT--Murray, of Pelham Manor, NY passed away on July 10th at the age of 87. He was born in New York City to Anna and Louis Alpert, the youngest of four boys. He served his military service during the Korean War, stationed at Landstuhl Hospital in Germany. On return, he went to the College of the City of New York, a BA, and then MS in Psychology, and then a Ph.D in Psychology from New York University. Murray met and married his first wife, Betty, and had his first child, Peter. After Betty passed away, Murray later married Toni, who had a daughter, Michelle, and together they had a son, Theodore. Years later, he also helped raise Amelia and Eliza with his third wife, Taffy. Murray's distinguished career was devoted to research, and training Ph.D candidates as a Professor of Psychology at NYU, where he was Director of Psychology, Department of Psychiatry. He also was Adjunct Professor at the University of Pais Vasco, Bilbao, Spain. Murray was elected President of the American Psychopathological Association in 1984. Murray was an avid biker, tennis player and swimmer, and went to the gym daily until his last year. He was interested in politics, and the downtrodden, and read The New York Times daily. He called Pelham his home for 13 years sharing his time between New York and New Hampshire. Murray is survived by his son Peter, daughter-in-law Donna, grandsons Christopher, Kevin, Eric and Peter, as well as son Theodore. He is predeceased by his first wife Betty and his brothers: Bernie, Harold and Philip. 1/3", "pub_date": "2016-07-17T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  ALPERT, MURRAY"}, "snippet": "ALPERT--Murray, of Pelham Manor, NY passed away on July 10th at the age of 87. He was born in New York City to Anna and Louis Alpert, the youngest of four boys. He served his military service during the Korean War, stationed at Landstuhl Hospital ...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9506E0D7113AF934A25754C0A9609D8B63", "keywords": [{"value": "ALPERT, MURRAY", "name": "persons"}], "blog": [], "_id": "5795820c38f0d838f06b9bc2", "source": "The New York Times"}