{"news_desk": "Classified", "print_page": "26", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "298", "lead_paragraph": "SHIPPEE--Elizabeth Freeman Little, died peacefully at home on July 12 in her 96th year. Born November 10, 1920, in Central Falls, RI, she was a 64 year resident of Greenwich, CT. Elizabeth's early life was spent in China where her father, Lester Knox Little, rose to become Inspector General of the Chinese Maritime Customs Service. She lived in various coastal cities in China, graduating from the Shanghai American School in 1937. She spent a year in Switzerland before entering Wellesley College from which she graduated in 1942, with a degree in Ancient Greek. Elizabeth loved China and returned to Shanghai after World War II with her husband, Nathan; daughter Elizabeth was born in 1946. They left in 1948 as the Nationalist government fell. Elizabeth and her family moved to Greenwich in 1952, and for six decades she was an active member of many local organizations including the choirs at Second Congregational and First Presbyterian churches. As a board member of the Greenwich Symphony, she was honored for building the orchestra's subscription base to support a level of professional performances that continues to this day. Choral singing was her greatest artistic delight, and with the Greenwich Choral Society and Berkshire Choral International, she sang in dozens of concerts including performances at the Aldeburgh Festival and Canterbury Cathedral in England, and Carnegie Hall. She is survived by her four children and their spouses, Elizabeth S. Boylan (Robert J. Boylan), Robert W. Shippee (Gayle Beyer), Richard R. Shippee (Deborah Matz), and Arthur B. Shippee (Mary Porterfield), along with five grandchildren and four great-grandchildren. A Celebration of Life will be held at a later date. For information write: ELS.Service.2016@gmail.com No flowers requested but friends could contribute, or better, subscribe to the Greenwich Symphony or the Greenwich Choral Society in her memory. 1/3", "pub_date": "2016-07-17T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  SHIPPEE, ELIZABETH FREEMAN LITTLE"}, "snippet": "SHIPPEE--Elizabeth Freeman Little, died peacefully at home on July 12 in her 96th year. Born November 10, 1920, in Central Falls, RI, she was a 64 year resident of Greenwich, CT. Elizabeth's early life was spent in China where her father, Lester K...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9900E7D6113AF934A25754C0A9609D8B63", "keywords": [{"value": "SHIPPEE, ELIZABETH FREEMAN LITTLE", "name": "persons"}], "blog": [], "_id": "579581f238f0d838f06b9bbf", "source": "The New York Times"}