{"news_desk": "Classified", "print_page": "26", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "302", "lead_paragraph": "VICTOR--I. Arnold III. Arnold Victor, a cultured, accomplished New Yorker, died unexpectedly on June 28, 2016 from complications of colon cancer. He was 76. Arnold grew up in Dallas, Texas and was a member of the Hillcrest High School Class of 1957. He received his B.A. from Rice University in 1961. He was awarded a Fulbright Scholarship for post-graduate study in Slavic Languages at the University of Vienna, Austria. He then received his Master of Science in Linguistics from Georgetown University before teaching Humanities at Howard University. Fluent in Esperanto, French, German, Russian and Mandarin, Arnold was always quick with a witty retort or a loving word. He lived in Greenwich Village for more than 40 years, happily serving as the consummate New York City tour guide for his many out-of-town friends and relatives. A world traveler who documented every trip with postcards mailed to family and friends, he was also devoted to studying and sharing his family history. A Mensan who was active in Esperanto circles, Arnold was also a longtime subscriber to the Metropolitan Opera and the New York Philharmonic. Kindhearted and a great storyteller (and strong debater!), he will always be remembered for his keen mind and sense of humor and as a devoted son, brother, uncle, great-uncle and loyal friend. Arnold was predeceased by his parents, I.A. and Cecile Victor, and partner Michael Degenhardt. He is survived by his sisters Marion Perini; Carol Ann Luby and husband Dan; nieces Alice Liebman Angier, Dana Luby Roark, Julie Liebman Presnall, Caroline Perini; nephews Eric Liebman and Mark Luby, seven great-nieces, one great-nephew, all of Dallas- Ft. Worth, and many beloved cousins. He was buried in Green-Wood Cemetery, Brooklyn. If desired, memorial contributions may be made to: The Metropolitan Opera, Lincoln Center, New York, NY 10023. www.metopera.org/ Support/ Make-a-Gift/ Commemorative-Gifts 1", "pub_date": "2016-07-17T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Memorials  VICTOR, I. ARNOLD III. ARNOLD VICTOR, A CULTURED, ACCOMPLISHED NEW YORKER, DIED UNEXPECTEDLY ON JUNE 28, 2016 FROM COMPLICATIONS OF COLON CANCER. HE WAS 76. ARNOLD GREW UP IN DALLAS, TEXAS AND WAS A MEMBER OF THE HILLCREST HIGH SCHOOL CLASS OF 1957. HE RECEIVED HIS B.A. FROM RICE UNIVERSITY IN 1961. HE WAS AWARDED A FULBRIGHT SCHOLARSHIP FOR POST, GRADUATE STUDY IN SLAVIC LANGUAGES AT THE UNIVERSITY OF VIENNA, AUSTRIA. HE THEN RECEIVED HIS MASTER OF SCIENCE IN LINGUISTICS FROM GEORGETOWN UNIVERSITY BEFORE TEACHING HUMANITIES AT HOWARD UNIVERSITY. FLUENT IN ESPERANTO, FRENCH, GERMAN, RUSSIAN AND MANDARIN, ARNOLD WAS ALWAYS QUICK WITH A WITTY RETORT OR A LOVING WORD. HE LIVED IN GREENWICH VILLAGE FOR MORE THAN 40 YEARS, HAPPILY SERVING AS THE CONSUMMATE NEW YORK CITY TOUR GUIDE FOR HIS MANY OUT, OF, TOWN FRIENDS AND RELATIVES. A WORLD TRAVELER WHO DOCUMENTED EVERY TRIP WITH POSTCARDS MAILED TO FAMILY AND FRIENDS, HE WAS ALSO DEVOTED TO STUDYING AND SHARING HIS FAMILY HISTORY. A MENSAN WHO WAS ACTIVE IN ESPERANTO CIRCLES, ARNOLD WAS ALSO A LONGTIME SUBSCRIBER TO THE METROPOLITAN OPERA AND THE NEW YORK PHILHARMONIC. KINDHEARTED AND A GREAT STORYTELLER (AND STRONG DEBATER!), HE WILL ALWAYS BE REMEMBERED FOR HIS KEEN MIND AND SENSE OF HUMOR AND AS A DEVOTED SON, BROTHER, UNCLE, GREAT, UNCLE AND LOYAL FRIEND. ARNOLD WAS PREDECEASED BY HIS PARENTS, I.A. AND CECILE VICTOR, AND PARTNER MICHAEL DEGENHARDT. HE IS SURVIVED BY HIS SISTERS MARION PERINI; CAROL ANN LUBY AND HUSBAND DAN; NIECES ALICE LIEBMAN ANGIER, DANA LUBY ROARK, JULIE LIEBMAN PRESNALL, CAROLINE PERINI; NEPHEWS ERIC LIEBMAN AND MARK LUBY, SEVEN GREAT, NIECES, ONE GREAT, NEPHEW, ALL OF DALLAS, FT. WORTH, AND MANY BELOVED COUSINS. HE WAS BURIED IN GREEN, WOOD CEMETERY, BROOKLYN. IF DESIRED, MEMORIAL CONTRIBUTIONS MAY BE MADE TO: THE METROPOLITAN OPERA, LINCOLN CENTER, NEW YORK, NY 10023. WWW.METOPERA.ORG"}, "snippet": "VICTOR--I. Arnold III. Arnold Victor, a cultured, accomplished New Yorker, died unexpectedly on June 28, 2016 from complications of colon cancer. He was 76. Arnold grew up in Dallas, Texas and was a member of the Hillcrest High School Class of 195...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9D05E6D6113AF934A25754C0A9609D8B63", "keywords": [{"value": "VICTOR, I. ARNOLD III. ARNOLD VICTOR, A CULTURED, ACCOMPLISHED NEW YORKER, DIED UNEXPECTEDLY ON JUNE 28, 2016 FROM COMPLICATIONS OF COLON CANCER. HE WAS 76. ARNOLD GREW UP IN DALLAS, TEXAS AND WAS A MEMBER OF THE HILLCREST HIGH SCHOOL CLASS OF 1957. HE RECEIVED HIS B.A. FROM RICE UNIVERSITY IN 1961. HE WAS AWARDED A FULBRIGHT SCHOLARSHIP FOR POST, GRADUATE STUDY IN SLAVIC LANGUAGES AT THE UNIVERSITY OF VIENNA, AUSTRIA. HE THEN RECEIVED HIS MASTER OF SCIENCE IN LINGUISTICS FROM GEORGETOWN UNIVERSITY BEFORE TEACHING HUMANITIES AT HOWARD UNIVERSITY. FLUENT IN ESPERANTO, FRENCH, GERMAN, RUSSIAN AND MANDARIN, ARNOLD WAS ALWAYS QUICK WITH A WITTY RETORT OR A LOVING WORD. HE LIVED IN GREENWICH VILLAGE FOR MORE THAN 40 YEARS, HAPPILY SERVING AS THE CONSUMMATE NEW YORK CITY TOUR GUIDE FOR HIS MANY OUT, OF, TOWN FRIENDS AND RELATIVES. A WORLD TRAVELER WHO DOCUMENTED EVERY TRIP WITH POSTCARDS MAILED TO FAMILY AND FRIENDS, HE WAS ALSO DEVOTED TO STUDYING AND SHARING HIS FAMILY HISTORY. A MENSAN WHO WAS ACTIVE IN ESPERANTO CIRCLES, ARNOLD WAS ALSO A LONGTIME SUBSCRIBER TO THE METROPOLITAN OPERA AND THE NEW YORK PHILHARMONIC. KINDHEARTED AND A GREAT STORYTELLER", "name": "persons"}, {"value": "CAROL ANN LUBY AND HUSBAND DAN", "name": "persons"}, {"value": "NEPHEWS ERIC LIEBMAN AND MARK LUBY, SEVEN GREAT, NIECES, ONE GREAT, NEPHEW, ALL OF DALLAS, FT. WORTH, AND MANY BELOVED COUSINS. HE WAS BURIED IN GREEN, WOOD CEMETERY, BROOKLYN. IF DESIRED, MEMORIAL CONTRIBUTIONS MAY BE MADE TO: THE METROPOLITAN OPERA, LINCOLN CENTER, NEW YORK, NY 10023. WWW.METOPERA.ORG", "name": "persons"}, {"value": "NIECES ALICE LIEBMAN ANGIER, DANA LUBY ROARK, JULIE LIEBMAN PRESNALL, CAROLINE PERINI", "name": "persons"}], "blog": [], "_id": "5795822138f0d838f06b9bc7", "source": "The New York Times"}