{"news_desk": "Classified", "print_page": "26", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "414", "lead_paragraph": "GRAHAM--John. John Robert Graham, was born in Chicago, Illinois on October 11, 1930, and passed away peacefully on June 28, 2016. During his eighty-five years, he traveled widely, collaborated with intelligence and honor, and enjoyed international cultures. After his high school graduation, John attended the United States Merchant Marine Academy at Kings Point, New York. Graduating in 1952, he was Class President and awarded the prestigious Academic Star. In 1997, Palmer Hall was named for him, honoring his \"wholehearted interest, unswerving loyalty, and support\" to the U.S.M.M.A. He was a member of the Academy's Superintendent's Council, and recipient of the Superintendent's Trophy, the Outstanding Professional Achievement Award (1972), the Superintendent's Award (1987), and the Kings Pointer of the Year Award (2012). During the Korean War, John served as a U.S. Navy officer on the minesweeper, Implicit (MSO 455). He received multiple commendations from the Navy Commander Mine Force, and was released from active duty in 1955. Returning to sea, John joined the Robin S.S. Line traveling to numerous port cities in South and East Africa and obtained his Master's License in 1957. After leaving professional sea faring, John attended Harvard Business School, and graduated in 1959. John Graham then began a long and successful career in business finance. His roles included Vice President of Hartford National Bank (1959-65), Heublein, Inc., Treasurer (1965-74), and Sr. Vice President of Finance and Administration at Sikorsky Aircraft Company (1974-80). From 1980-82, he served as Chief Financial Officer of Planning Research Corporation. In 1982, he joined Uniroyal, Inc. as Vice President of Finance, Chief Financial Officer and Director, Chairman of Uniroyal Canada and Uniroyal Europe. John was a Director of Uniroyal Holding at the time of his death, and is recognized in Who's Who in America, and Who's Who in American Finance. All his life, John Graham loved the sea, sailing, and exploring the East and West coasts of the United States and Canada. He crewed on several long voyages in the Pacific Ocean, and \"doubled Cape Horn\" as navigator aboard a 42' ketch from Argentina to Antarctica in 1996. John leaves his wife, Beverly Criley; sons, Jonathan and Karl Graham; stepchildren, Wayne Wager and Margit Moore; grandchildren, Austen and Bevan Moore, Emery and Abigail Wager, Ben and Will Graham; and great-grandchildren, Kellan, Campbell, Ellison Moore and Adriana Moore. Throughout his life, John Robert Graham was known and loved as a man of great warmth, intelligence, honor, and service. Please send gifts of remembrance to Seattle Children's Hospital. 1/3", "pub_date": "2016-07-17T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  GRAHAM, JOHN"}, "snippet": "GRAHAM--John. John Robert Graham, was born in Chicago, Illinois on October 11, 1930, and passed away peacefully on June 28, 2016. During his eighty-five years, he traveled widely, collaborated with intelligence and honor, and enjoyed international...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9507EFD7113AF934A25754C0A9609D8B63", "keywords": [{"value": "GRAHAM, JOHN", "name": "persons"}], "blog": [], "_id": "5795820c38f0d838f06b9bc3", "source": "The New York Times"}