{"news_desk": "Classified", "print_page": "26", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "376", "lead_paragraph": "VELEZ--Anthony. Anthony \"Tony\" Velez, 69, photographer and activist, Vietnam veteran, beloved husband, father, brother, uncle, friend, died on July 6, 2016, surrounded by loved ones, from multiple myeloma, his second cancer linked to Agent Orange. A professor of photography for twenty-seven years, he retired in 2014 from Kean University. A lifelong artist, his work has been broadly recognized, including by the New York Historical Society, New Jersey Historical Society, Norwalk Historical Society; and is part of collections held at historical societies of Brooklyn, New York, Norwalk, New Jersey, El Museo del Barrio, Bronx Museum, and Brooklyn Museum. His recent project, commissioned by the Norwalk Historical Society, is exhibited at the Norwalk Historical Society Museum. He was recipient of numerous grants and commissions, including, National Endowment of the Arts and New York Foundation for the Arts, and his work featured in numerous publications, including, \"This is Brooklyn: Its Historic Districts and Landmarks\", \"100 New york Photographers\" (2009). He was born to Puerto Rican immigrants in the south Bronx and raised there and in public housing in East New York. After serving in Vietnam in the 11th Armored Cavalry (1966-67), he organized with other veterans in Vietnam Veterans Against the War. He attended New York City's High School for Art and Design, and studied at Brooklyn College with Walter Rosenblum, and was a member of the Photographer's Forum. A New Yorker at heart, he embraced the communities he became part of in Norwalk, Connecticut, where he relocated with his wife in 2007; including, Norwalk Arts Commission, Rowayton Arts Center, and Westport Arts Center, and the community of Village Creek where he lived. He received medical care at Memorial Sloan Kettering. Special thanks to Dr. Susan Slovin, Dr. Eric Lis, and Dr. Alexander Lesokhin. He also appreciated the care that he received from doctors at the West Haven VA Hospital. Tony's intelligence, enthusiasm, warmth and zest for life was contagious and his commitment to social justice unwavering. He will be sorely missed by all who knew him, and especially by his family - Barbara Zerzan, Sophia Velez (Emily Storm), Nick Zerzan (Alex), Jessica Zerzan (Joshua Rubin), and grandchildren, Rex, Charlie and Ellie. A memorial service will be held September 17, 2016, 2pm, at his home in Norwalk, CT. 1/3", "pub_date": "2016-07-17T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  VELEZ, ANTHONY"}, "snippet": "VELEZ--Anthony. Anthony \"Tony\" Velez, 69, photographer and activist, Vietnam veteran, beloved husband, father, brother, uncle, friend, died on July 6, 2016, surrounded by loved ones, from multiple myeloma, his second cancer linked to Agent Orange....", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=950CE7D6113AF934A25754C0A9609D8B63", "keywords": [{"value": "VELEZ, ANTHONY", "name": "persons"}], "blog": [], "_id": "579581b338f0d838f06b9bb1", "source": "The New York Times"}