{"news_desk": "Classified", "print_page": "13", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "450", "lead_paragraph": "DEUTSCH--Joan. Over the past 18 months, with the support of her family, friends and a dedicated medical team, Joan finally with grace succumbed to brain cancer at age 80 on Sunday, July 10th at her home in Irvington, NY. Joan was born and raised in Brooklyn. She graduated from Erasmus High School and then Brooklyn College with a degree in molecular biology, followed by additional courses at New York University. 60 years ago, at age 21, she was selected by The Sloan Kettering Institute for Cancer Research to join their tumor screening department under the supervision of two early prominent cancer pioneers. As a young woman, Joan too, was also then recognized as a cancer pioneer. During her 18 years there, she co-authored and published 10 scientific papers and contributed to important inter-department research. She was an inspiration and example for her daughters and other young women to emulate her in the field of science. Joan then continued her career at the Department of Obstetrics and Gynecology at the Einstein College of Medicine. Over the next 14 years, she co-authored and published 11 research papers while collaborating in many other scientific projects. Upon retirement from Einstein she dedicated her remaining years to volunteer work in animal preservation and nature. She spent five years in nutrition research at the Bronx Zoo Veterinary Hospital, followed by 14 years at the Bronx Botanical Garden Research Center conducting a program for the gene sequencing of plants, while mentoring graduates and interns. Joan was a voracious reader who traveled extensively with Marty and friends from Tibet to Alaska and points beyond, enriching her passion for music and the arts while also sampling the local cuisines. She was a skilled cook, a gracious hostess known for her gourmet dinners and daily family meals. She was reserved regarding her many accomplishments and considered them private. Joan was ahead of her time in many ways. All who knew this elegant and beautiful woman loved and admired her. She made the world a better place and her legacy will live on. She is survived by Martin, her husband and companion of 58 years, her devoted children Aline and Scott Hillman, Madeline and Scott Kerbel four precious grandchildren, Mathew, Amanda, Michelle, and Samantha and many other loving nieces and nephews. Her parents Louis and Esther Friedman and older sister Arline Rosenberg predeceased her. Burial will be private at gravesite. In lieu of Shiva, a memorial will be held at 11am on July 24th at Temple Beth Abraham located at 25 Leroy Avenue in Tarrytown, NY followed a light meal. Donations in her memory can be sent to The Jamie Deutsch Cancer Foundation, 146 Hardscrabble Road, Briarcliff Manor, NY 10510. 1/3", "pub_date": "2016-07-12T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  DEUTSCH, JOAN"}, "snippet": "DEUTSCH--Joan. Over the past 18 months, with the support of her family, friends and a dedicated medical team, Joan finally with grace succumbed to brain cancer at age 80 on Sunday, July 10th at her home in Irvington, NY. Joan was born and raised i...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E04E4D8113AF931A25754C0A9609D8B63", "keywords": [{"value": "DEUTSCH, JOAN", "name": "persons"}], "blog": [], "_id": "578ee9d238f0d84bd30e949d", "source": "The New York Times"}