{"news_desk": "Classified", "print_page": "13", "section_name": "Paid Death Notices", "subsection_name": null, "byline": null, "abstract": null, "type_of_material": "Paid Death Notice", "word_count": "987", "lead_paragraph": "LOWE--William Webb II, 95, a pioneer in the introduction of nuclear electric power plants in the United States and abroad, died July 4, 2016, at his home in Alexandria, Virginia of cancer. He was a graduate of Purdue University in Chemical Engineering, a Fellow of the American Institute of Chemists, and a member of the American Institute of Chemical Engineers, the American Chemical Society and the American Nuclear Society. He was also an independent scholar of 17th century English merchant marine history. Lowe was born on December 18, 1920, in Bartlesville, Oklahoma, the son of William Webb Lowe and Grace Evans Lowe. In 1944 he married Mary Jean Sanford of Webster Groves, Missouri. He was preceded in death by his ex-wife, Mary Jean Sanford Lowe; his brothers Lt. Col. Richard Wyche Lowe and Robert Evans Lowe; and one grandchild. He is survived by five children: William Lowe III of Lutz, FL; Judith Lowe of Vienna, VA; Dr. Barbara Lowe-Fierke of Northfield, MN; Dr. Robert Lowe of Lansdale, PA; and Jennifer Lowe Foley of Catlett, VA; fourteen grandchildren; four great grandchildren; his second wife of 42 years, Sylvia Stallings Lowe; and three stepchildren: Dr. Sarah Morris of Los Angeles, CA, Julia Morris Kashkashian of Boulder, CO, and Dr. Michael Morris of Falls Church, VA. In February 1942, two months after the Japanese attack on Pearl Harbor, Lowe volunteered for Army service and was assigned to continue chemical engineering studies at Purdue. In May 1943, he and three others were withdrawn from their units and sent to the University of Pennsylvania for additional engineering courses. In March 1944, with sealed orders, he took seventeen soldiers, all engineers, by train from Philadelphia to Lamy, New Mexico. They were taken by night in an unmarked bus to the now historic 109 East Palace Street atomic bomb project receiving station in Santa Fe, and then to Los Alamos to provide engineering support for scientists. Lowe was chosen by Dr. Arthur Charles Wahl, co-discoverer of plutonium, to help develop methods for producing the extremely pure plutonium thought to be essential for a successful plutonium weapon. Lowe was then 23 years old. Dr. Wahl was 25. Purifying plutonium was considered the second most difficult problem at Los Alamos. Wahl specified the chemistry, Lowe led the team that developed the equipment. By October 1944, they had a process and equipment that worked and Lowe was put in charge of operations. Lowe later wrote: \"I was assigned to supervise receipt and purification of essentially all plutonium made during WWII. In July 1945, I walked down the hall to the metallurgy lab to view with long thoughts the first hemisphere of plutonium, about the size of a baseball, silver coated and resting on a tripod in a dry box.\" Dr. Wahl's group was a very small but important part of the enormous enterprise centrally directed and logistically supported by the Manhattan District of the U.S. Corps of Engineers. The project had the highest War Production Board priority. After the war, Lowe received letters of commendation from Major General Groves, leader of the Manhattan Project, and J. Robert Oppenheimer, Director of the Los Alamos Laboratory. He was authorized by the Secretary of War to wear the U.S. Army commendation ribbon. As the Cold War and then Korean War began, Lowe moved to Richland, Washington as Chief of the Nuclear Engineering Section of the Hanford office of the newly created U.S. Atomic Energy Commission. There he initiated a series of critical mass experiments that provided the basis for doubling the plutonium production rate of the original plants. In 1954, he became Chief Nuclear Engineer at Bath Iron Works in Bath, Maine. In 1956, Lowe joined James K. Pickard and Frederick H. Warren as a partner of the engineering firm Pickard, Warren and Lowe and eventually became chairman of it and its successor organizations. In 1960, he and his two partners were cofounders of the Nuclear Utilities Service Corporation. During his career, Lowe worked on behalf of electric power company clients to help select sites, set major design parameters, train people, and conduct safety oversight for a quarter of the 104 nuclear electric power units built in the United States and for several abroad. In the early 1960s, he pioneered the use of quantitative probabilistic risk analysis for choosing nuclear power plant sites and advocated its use for design, construction and operation to identify and reduce the probability of significant accidents. However, when concluding a talk about nuclear power in 1971, he said no new technology had evolved without there being accidents and that \"We must be careful what we do.\" After the Three Mile Island nuclear power plant accident in March 1979, Lowe went to the site at the request of the owners, and was the first to recognize that a massive hydrogen ignition had occurred in the containment, that there was a hydrogen bubble in the primary system, and that the fuel core had been destroyed. He specified procedures for removing the hydrogen bubble in the primary system and other actions to stabilize and analyze the condition of the unit. Aside from his substantial contributions to science and humanity, William Webb Lowe leaves behind a legacy of a generosity of spirit, an unwavering sense of responsibility to those he loved, a firm belief in the importance of honesty, a curiosity about and respect for the forces of nature, a sense of fun and accomplishment in mastering nature, and a fascination in the history of those who have gone before. He now joins his ancestors and though he will be sorely missed, these legacies will live on in those who knew him, and will be passed on to the generations to come. Funeral services will be held on Friday, July 15, 2016 at 2pm at Christ Church, 118 North Washington Street, Alexandria, VA. In lieu of flowers, donations may be made to the Christ Church Foundation Fund: HistoricChristChurch.org. 1/3", "pub_date": "2016-07-12T00:00:00Z", "document_type": "article", "slideshow_credits": null, "headline": {"main": "Paid Notice: Deaths  LOWE, WILLIAM WEBB II"}, "snippet": "LOWE--William Webb II, 95, a pioneer in the introduction of nuclear electric power plants in the United States and abroad, died July 4, 2016, at his home in Alexandria, Virginia of cancer. He was a graduate of Purdue University in Chemical Enginee...", "multimedia": [], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9901E4D8113AF931A25754C0A9609D8B63", "keywords": [{"value": "LOWE, WILLIAM WEBB II", "name": "persons"}], "blog": [], "_id": "578ee9a638f0d84bd30e9496", "source": "The New York Times"}